{
    "detachmentName": "teleport assault",
    "detachmentRule": [
        {
            "name": "teleport shunt",
            "lore": "Hardened against the corrupting touch of Chaos, protected by silver sigils and the warriors’ own purity of spirit, Grey Knights are capable of enduring rapid and repeated submersions in the warp. When a lightning-fast purgation is required, orbiting strike cruisers maintain a constant spiritual lock on their battle-brothers, enabling Grey Knights to perform short-ranged teleportations. Flickering in and out of reality, this exceptional mobility allows them to outmanoeuvre the most otherworldly of enemies.",
            "description": "Each time a <strong>GREY KNIGHTS</strong> unit with the Deep Strike ability Advances, do not make an Advance roll. Instead, until the end of the phase, add 6'' to that unit’s Move characteristic and that unit can <strong>FLY</strong>."
        }
    ],
    "enhacements": [
        {
            "name": "First to the Fray",
            "points": 35,
            "lore": "Whether braving premature teleportation assaults or leaping from the hatch of a transport still aglow from atmospheric entry, this sanctified commander frequently makes the first strike in battle, and ever from an unexpected quarter. Inspired by such zealous bravery, his battle-brothers are never far behind.",
            "description": "GREY KNIGHTS model with the Deep Strike ability only. The bearer’s unit must start the battle in Reserves, but neither it, nor any TRANSPORT it is embarked within, is counted towards any limits the mission places on the number of Strategic Reserves units you can have. That unit can be set up using its Deep Strike ability in the Reinforcements step of your first, second or third Movement phase, regardless of any mission rules."
        },
        {
            "name": "Domina Liber Daemonica",
            "points": 20,
            "lore": "This tome is said to be a relic of Supreme Grand Master Janus, he who mastered all six hundred and sixty-six words of banishment, each one painstakingly recorded on its pages. In times of need a hero of the Chapter will carry this book into battle, its bindings crackling with arcane energy as the words repel warp entities and send daemons howling back into the warp.",
            "description": "GREY KNIGHTS model only. Each time the bearer makes a melee attack add 1 to the Wound roll and, if that attack targets a DAEMON unit, add 1 to the Damage characteristic of that attack as well."
        },
        {
            "name": "Sigil of Exigence",
            "points": 30,
            "lore": "Forged by the Techmarine Dorvel urThann, this small chor-bronze icon contains a powerful teleport matrix and a trio of vigilant machine spirits. Their pre-cogitative psyroutines guard against attacks from afar, spiriting their host and his allies away from danger in a blaze of light.",
            "description": "GREY KNIGHTS model only. Once per battle, in your opponent’s Shooting phase, when the bearer’s unit is selected as the target of a ranged attack, you can remove the bearer’s unit from the battlefield and then set it back up again anywhere on the battlefield that is more than 9\" horizontally away from all enemy models. If the bearer is no longer an eligible target, your opponent can then select new targets for any attacks that had targeted the bearer’s unit."
        },
        {
            "name": "Inescapable Wrath",
            "points": 15,
            "lore": "When this warrior leads his battle-brothers into the foe, they strike like silver lances of lightning. By focusing his powers upon a pivotal moment, he connects himself via a tether of inevitability to his enemies. Drawn by the tether, he bears down upon them with incredible speed, ensuring none escape his and his warriors’ wrath.",
            "description": "GREY KNIGHTS model only. Add 1 to Charge rolls made for the bearer’s unit."
        }
    ]
,    
    "stratagems": [
        {
            "name": "truesilver armour",
            "subindex": "wargear stratagem",
            "lore": "Grey Knights battle plate incorporates litanies of purity, strands of sanctified silver and other sacred wards, whose defences can be further empowered by ritual mantras.",
            "when": "Your opponent’s Shooting phase or the Fight phase, just after an enemy unit has selected its targets.",
            "target": "One GREY KNIGHTS unit from your army that was selected as the target of one or more of that enemy unit’s attacks.",
            "effect": "Until the end of the phase, each time an attack targets your unit, worsen the Armour Penetration characteristic of that attack by 1.",
            "cp": 1,
            "color": "green"
        },
        {
            "name": "death from the warp",
            "subindex": "battle tactic stratagem",
            "lore": "Utilising their warp-attuned senses during the timeless instant of teleportation, Grey Knights know exactly where the enemy are before they arrive. They emerge from the blinding flare of warp energies already firing.",
            "when": "Your Movement phase.",
            "target": "One GREY KNIGHTS PSYKER unit from your army that either Advanced this turn or arrived using the Deep Strike or Teleport Assault abilities this turn.",
            "effect": "Until the end of the turn, ranged weapons equipped by models in your unit have the [ASSAULT] ability and each time a model in your unit makes an attack, add 1 to the Hit roll.",
            "cp": 1,
            "color": "green"
        },
        {
            "name": "prognisticated arrival",
            "subindex": "epic deed stratagem",
            "lore": "Accessing a vision granted by the Chapter’s Prognosticars, the Grey Knights perceive the hidden ways of the battlefield and a sliver of the enemy’s intentions, granting them a prophetic situational awareness that aids their strategic disposition.",
            "when": "Your Movement phase.",
            "target": "One GREY KNIGHTS PSYKER unit from your army that is arriving using the Deep Strike or Teleport Assault abilities this phase.",
            "effect": "Your unit can be set up anywhere on the battlefield that is more than 3\" horizontally away from all enemy models.",
            "restrictions": "A unit targeted by this Stratagem is not eligible to declare a charge in the same turn.",
            "cp": 1,
            "color": "blue"
        },
        {
            "name": "mists of deimos",
            "subindex": "strategic ploy stratagem",
            "lore": "When the enemy closes in, the Grey Knights wreathe themselves in psychic mists to confound the foe while they reposition until the time is ready to launch a counter-blow.",
            "when": "Your opponent’s Movement phase, just after an enemy unit ends a Normal, Advance or Fall Back move.",
            "target": "One GREY KNIGHTS PSYKER unit from your army that is within 9\" of that enemy unit.",
            "effect": "Your unit can make a Normal move of up to 6\" as if it were your Movement phase or, if it has the Deep Strike ability, it can be placed into Strategic Reserves.",
            "restrictions": "You cannot select a unit that is within Engagement Range of one or more enemy units.",
            "cp": 1,
            "color": "blue"
        },
        {
            "name": "radiant strike",
            "subindex": "battle tactic stratagem",
            "lore": "Psychic fire rimes the blades of the Grey Knights as they charge at the foe, fanned by their battle fury. At the moment of contact, the empyric charge is unleashed in a blast of azure light.",
            "when": "Fight phase.",
            "target": "One GREY KNIGHTS PSYKER unit from your army.",
            "effect": "Until the end of the phase, melee weapons equipped by models in your unit with the [PSYCHIC] ability also have the [DEVASTATING WOUNDS] ability.",
            "cp": 2,
            "color": "green"
        },
        {
            "name": "haloed in soulfire",
            "subindex": "strategic ploy stratagem",
            "lore": "The blazing glare of ancient technology and the shrouding coils of the immaterium often linger, obscuring the Grey Knights’ presence.",
            "when": "Your Movement phase.",
            "target": "One GREY KNIGHTS PSYKER unit from your army that is arriving using the Deep Strike or Teleport Assault abilities this phase.",
            "effect": "Until the start of your next Movement phase, your unit cannot be targeted by ranged attacks unless the attacking model is within 12\".",
            "cp": 2,
            "color": "blue"
        }
    ]
    
}