{
    "detachmentName": "oathband",
    "detachmentRule": [
        {
            "name": "ruthless efficiency",
            "lore": "The Kin of an Oathband are skilled warriors and ruthless expansionists, instinctively working together to defeat their foes and efficiently achieve their aims. As with everything, they approach war with a grim, methodical pragmatism that is an inspiration to other Kin. ",
            "description": "At the start of the battle, select a number of units from your opponent’s army depending on the battle size, as shown below: <br/> <br/> <li><strong>Incursion:</strong> 2 units </li> <li><strong>Strike Force:</strong> 4 units</li> <li><strong>Onslaught:</strong> 6 units</li> <br/> <p> Each of those units start the battle with 2 Judgement tokens (see Eye of the Ancestors).</p> <p>If, at the start of any of your Command phases, any of those units have been destroyed, you gain a number of CP depending on how early in the battle you destroyed it, as shown below (you can only gain CP in this way once per battle, and CP gained in this way are an exemption to the Core Rules that limit the maximum number of CP you can gain per battle round to 1). <br/><br/> </p> <li>Unit destroyed by the start of your first or second Command phase: <strong> 3 CP </strong></li>  <li>Unit destroyed by the start of your first or second Command phase: <strong> 2 CP </strong> </li> <li>Unit destroyed by the start of your first or second Command phase: <strong> 1 CP </strong>  </li>    "
        } 
    ],
    "enhacements": [
        {
            "name": "appraising glare",
            "points": 20,
            "lore": "Few Kin can cast the Eye of the Ancestors with the swiftness and grim efficiency of this venerable leader. Where their merciless gaze falls, the strengths and weaknesses of the enemy are laid bare, and there their warriors strike hardest.",
            "description": "LEAGUES OF VOTANN model only. In your Command phase, you can select one objective marker your opponent controls. Until the start of your next Command phase, while an enemy unit is within range of that objective marker, it counts as having one more Judgement token than it actually has (to a maximum of 2)."
        },
        {
            "name": "a long list",
            "points": 15,
            "lore": "This warrior holds the majority of the galaxy’s races in contempt, and seeks out their many nemeses with a keen and inescapable eye. No sooner have they settled a Grudge against one foe, than they move to the next name on their list.",
            "description": "LEAGUES OF VOTANN model only. Each time the bearer’s unit destroys an enemy unit, if that enemy unit has one or more Judgement tokens, you can select one other enemy unit that is visible to the bearer. That other unit gains one Judgement token."
        },
        {
            "name": "grim demeanour",
            "points": 20,
            "lore": "This warlord’s grim countenance is legendary, and they are rumoured to have never smiled. Such a demeanour is, of course, an outward sign of how seriously they undertake their solemn tasks, and under their stern gaze no Kin will be found wanting.",
            "description": "LEAGUES OF VOTANN model only. You can re-roll Battle-shock tests taken for the bearer’s unit, and models in that unit can ignore any or all modifiers to their characteristics and/or to any rolls or tests made for them (excluding modifiers to saving throws)."
        },
        {
            "name": "wayfarer's grace",
            "points": 25,
            "lore": "This one-of-a-kind void suit was crafted for the famed Hernkyn adventurer Sîmmka Farstryd as thanks for her saving the Hold world of Hyvôk’s Kindred. Incorporating ancient technological secrets interpreted from Votannic lore, Wayfarer’s Grace acts as a life-support system for its wearer. Monitoring their vital statistics constantly, the suit provides medical support and can even restart its wearer’s stopped heart in extremis.",
            "description": "model only. The first time the bearer is destroyed, after placing a Judgement token next to the unit that destroyed it, roll one D6 at the end of the phase. On a 2+, set the bearer back up on the battlefield as close as possible to where it was destroyed and not within Engagement Range of any enemy units, with its full wounds remaining."
        }
    ],
    "stratagems": [
        {
            "name": "warrior pride",
            "subindex": "battle tactic stratagem",
            "lore": "The warriors of the Leagues of Votann pride themselves on their martial skill and proficiency in combat, and when the Ancestors are watching their actions they can quickly overwhelm and pick apart their foes.",
            "when": "Fight phase.",
            "target": "One LEAGUES OF VOTANN unit from your army, and one enemy unit that has one or more Judgement tokens and is within Engagement Range of that LEAGUES OF VOTANN unit.",
            "effect": "Until the end of the phase, each time a model in your unit makes a melee attack that targets that enemy unit, improve the Armour Penetration characteristic of that attack by 1 for each Judgement token that enemy unit has.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "green"
        },
        {
            "name": "ordered retreat",
            "subindex": "strategic ploy stratagem",
            "lore": "Not for the Kin the sudden panic of the rout. Instead, they fall back steadily and by squads, laying down furious suppressing fire before launching fresh assaults.",
            "when": " Your Movement phase, just after a LEAGUES OF VOTANN unit from your army Falls Back.",
            "target": "That LEAGUES OF VOTANN unit.",
            "effect": "Until the end of the turn, your unit is eligible to shoot and declare a charge.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "blue"
        },
        {
            "name": "ancestral sentence",
            "subindex": "battle tactic stratagem",
            "lore": "Some foes are so loathed that the Ancestors themselves are said to pass sentence upon them, marking them for death.",
            "when": "Your Shooting phase.",
            "target": "One LEAGUES OF VOTANN unit from your army.",
            "effect": "Until the end of the phase, each time a model in your unit makes a ranged attack, that attack has the [SUSTAINED HITS 1] ability, and each time a model in your unit makes a ranged attack that targets a unit that has one or more Judgement tokens, that attack has the [SUSTAINED HITS 2] ability instead.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "blue"
        },
        {
            "name": "reactive reprisal",
            "subindex": "battle tactic stratagem",
            "lore": "Once an enemy target has been marked out by the Eye of the Ancestors, the Kin focus their efforts upon its destruction, redoubling their fury should it attempt to engage.",
            "when": "Your opponent’s Shooting phase, just after an enemy unit that has one or more Judgement tokens has resolved its attacks.",
            "target": "One LEAGUES OF VOTANN unit from your army that was selected as the target of one or more of the attacking unit’s attacks.",
            "effect": "Your LEAGUES OF VOTANN unit can shoot as if it were your Shooting phase, but it must target the enemy unit that just attacked it, and can only do so if that enemy unit is an eligible target.",
            "icon": [
                ""
            ],
            "cp": 2,
            "color": "red"
        },
        {
            "name": "newfound nemesis",
            "subindex": "strategic ploy stratagem",
            "lore": "To strike down Kin is to earn the immediate and murderous ire of all their warrior comrades.",
            "when": "Your opponent’s Shooting phase or the Fight phase, just after an enemy unit has resolved its attacks.",
            "target": "One LEAGUES OF VOTANN INFANTRY or LEAGUES OF VOTANN MOUNTED unit from your army that was reduced to Below Half-strength as a result of the attacking unit’s attacks",
            "effect": "The attacking unit gains 1 Judgement token, or up to 2 Judgement tokens instead if that LEAGUES OF VOTANN unit contained your WARLORD when it was targeted by those attacks.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "red"
        },
        {
            "name": "void armour",
            "subindex": "wargear stratagem",
            "lore": "Void armour comprises hardened, jointed segments hooked into the void suit beneath. It is fashioned from magnaferrite weave, and often reinforced with adamantine and enhanced with microfield generators.",
            "when": " Your opponent’s Shooting phase or the Fight phase, just after an enemy unit has selected its targets. ",
            "target": "One LEAGUES OF VOTANN unit from your army that was selected as the target of one or more of the attacking unit’s attacks.",
            "effect": "Until the end of the phase, each time an attack targets your LEAGUES OF VOTANN unit, worsen the Armour Penteration characteristic of that attack by 1.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "red"
        }
    ]
}