{
    "detachmentName": "oathband",
    "detachmentRule": [
        {
            "name": "ruthless efficiency",
            "lore": "Every warrior organism in the Tyranid race is fashioned by the ineffable alien will of the Hive Mind. Their flesh and chitin is endlessly mutable, honed into whatever form will prove most lethal to the prey.",
            "description": "At the start of the first battle round, select one of the following Hyper-adaptations to be active for TYRANIDS units from your army until the end of the battle:"
        }
    ],
    "enhacements": [
        {
            "name": "appraising glare",
            "points": 20,
            "lore": "Few Kin can cast the Eye of the Ancestors with the swiftness and grim efficiency of this venerable leader. Where their merciless gaze falls, the strengths and weaknesses of the enemy are laid bare, and there their warriors strike hardest.",
            "description": "LEAGUES OF VOTANN model only. In your Command phase, you can select one objective marker your opponent controls. Until the start of your next Command phase, while an enemy unit is within range of that objective marker, it counts as having one more Judgement token than it actually has (to a maximum of 2)."
        },
        {
            "name": "a long list",
            "points": 15,
            "lore": "This warrior holds the majority of the galaxy’s races in contempt, and seeks out their many nemeses with a keen and inescapable eye. No sooner have they settled a Grudge against one foe, than they move to the next name on their list.",
            "description": "LEAGUES OF VOTANN model only. Each time the bearer’s unit destroys an enemy unit, if that enemy unit has one or more Judgement tokens, you can select one other enemy unit that is visible to the bearer. That other unit gains one Judgement token."
        },
        {
            "name": "grim demeanour",
            "points": 20,
            "lore": "This warlord’s grim countenance is legendary, and they are rumoured to have never smiled. Such a demeanour is, of course, an outward sign of how seriously they undertake their solemn tasks, and under their stern gaze no Kin will be found wanting.",
            "description": "LEAGUES OF VOTANN model only. You can re-roll Battle-shock tests taken for the bearer’s unit, and models in that unit can ignore any or all modifiers to their characteristics and/or to any rolls or tests made for them (excluding modifiers to saving throws)."
        },
        {
            "name": "wayfarer's grace",
            "points": 25,
            "lore": "This one-of-a-kind void suit was crafted for the famed Hernkyn adventurer Sîmmka Farstryd as thanks for her saving the Hold world of Hyvôk’s Kindred. Incorporating ancient technological secrets interpreted from Votannic lore, Wayfarer’s Grace acts as a life-support system for its wearer. Monitoring their vital statistics constantly, the suit provides medical support and can even restart its wearer’s stopped heart in extremis.",
            "description": "model only. The first time the bearer is destroyed, after placing a Judgement token next to the unit that destroyed it, roll one D6 at the end of the phase. On a 2+, set the bearer back up on the battlefield as close as possible to where it was destroyed and not within Engagement Range of any enemy units, with its full wounds remaining."
        }
    ],
    "stratagems":[
        {
            "name": "rapid regeneration",
            "subindex": "battle tactic stratagem",
            "lore": "Prey stare in horror as chitinous armour regrows and flesh, muscle and sinew knots back together.",
            "when": "Your opponent’s Shooting phase or the Fight phase, just after an enemy unit has selected its targets.",
            "target": "One TYRANIDS unit from your army that was selected as the target of one or more of the attacking unit’s attacks.",
            "effect": "Until the end of the phase, models in your unit have the Feel No Pain 6+ ability. If your unit is within Synapse Range of your army, models in your unit have the Feel No Pain 5+ ability instead.",
            "icon" : [""],
            "cp":1,
            "color":"green"
        },
        {
            "name": "adrenal surge",
            "subindex": "battle tactic stratagem",
            "lore": "These warrior organisms destroy all as their adrenaline surges.",
            "when": "Fight phase.",
            "target": "Up to two TYRANIDS units from your army that are within Synapse Range of your army and are eligible to fight, or one other TYRANIDS unit from your army that is eligible to fight.",
            "effect": "Until the end of the phase, each time a model in any of those selected units makes an attack, an unmodified Hit roll of 5+ scores a Critical Hit.",
            "icon" : [""],
            "cp":2,
            "color":"green"
        },
        {
            "name": "death frenzy",
            "subindex": "strategic ploy stratagem",
            "lore": "Tyranids care nothing for self-preservation, lashing out even in death.",
            "when": "Fight phase, just after an enemy unit has selected its targets.",
            "target": "One TYRANIDS unit from your army that was selected as the target of one or more of the attacking unit’s attacks.",
            "effect": "Until the end of the phase, each time a model in your unit is destroyed, if that model has not fought this phase, roll one D6: on a 4+, do not remove it from play. The destroyed model can fight after the attacking model’s unit has finished making its attacks, and is then removed from play.",
            "icon" : [""],
            "cp":1,
            "color":"green"
        },
        {
            "name": "overrun",
            "subindex": "strategic ploy stratagem",
            "lore": "Tyranids in battle form an unstoppable avalanche of flesh and chitin that buries the foe alive.",
            "when": "Fight phase, just before a TYRANIDS unit from your army Consolidates.",
            "target": "That TYRANIDS unit.",
            "effect": "Until the end of the phase, each time your unit Consolidates, models in it can move an additional 3'' as long as your unit can end that move within Engagement Range of one or more enemy units. If your unit is within Synapse Range of your army and not within Engagement Range of any enemy units, instead of making that Consolidation move, it can make a Normal move of up to 6''",
            "icon" : [""],
            "cp":1,
            "color":"green"
        },
        {
            "name": "predatory imperative",
            "subindex": "strategic ploy stratagem",
            "lore": "Guided by the instincts of leader-beasts, the swarm can be tasked with focusing its hunting instincts.",
            "when": "Your Command phase.",
            "target": "Up to two TYRANIDS units from your army that are within Synapse Range of your army, or one other TYRANIDS unit from your army.",
            "effect": "Select one Hyper-adaptation. Until the start of your next Command phase, that Hyper-adaptation is active for those selected units in addition to any other that may be active for your army.",
            "restrictions":"You cannot select the same Hyper-adaptation you selected at the start of the first battle round.",
            "icon" : [""],
            "cp":1,
            "color":"blue"
        },
        {
            "name": "endless swarm",
            "subindex": "strategic ploy stratagem",
            "lore": "As the battle rages, more organisms pour in to bolster the swarms.",
            "when": "Your Command phase.",
            "target": "Up to two ENDLESS MULTITUDE units from your army that are within Synapse Range of your army, or one other ENDLESS MULTITUDE unit from your army.",
            "effect": "You can return up to D3+3 destroyed models to each of the selected units.",
            "icon" : [""],
            "cp":1,
            "color":"blue"
        }
    ]

}