{
    "symbol": "deathwatch-symbol",
    
    "detachments": [
        "black spear task force"
    ], "rules": [
        {
            "name": "Oath of moment",
            "lore": "In battle, Space Marines swear mighty oaths to destroy the enemies of the Emperor and uphold the honour of their Chapter, and such vows are sacrosanct. When the Angels of Death strike, they do so with the precision of a surgeon and the force of a thunderbolt. Experience and strategic expertise help them to read the shifting shape of the battle with post-human speed and clarity, directing their wrath towards one priority target after another. Command assets are annihilated, leaving the enemy reeling leaderless. Heavy armour, potent artillery and the vaunted elites of the foe’s forces are laid waste with horrifying speed, until the Emperor’s Angels of Death stand victorious over a field of smouldering wreckage and bolt-riddled corpses, and honour is finally satisfied.",
            "description": "If your Army Faction is ADEPTUS ASTARTES, at the start of your Command phase, select one unit from your opponent’s army. Until the start of your next Command phase, that enemy unit is your Oath of Moment target. Each time a model with this ability makes an attack that targets your Oath of Moment target, you can re-roll the Hit roll."
        },
        {
            "name": "space marines chapter",
            "lore": "",
            "description": "<li>If an <strong>ADEPTUS ASTARTES</strong> unit has a second Faction keyword on its datasheet, that Faction keyword is the name of that unit’s Chapter. For example, Marneus Calgar has both the <strong>ADEPTUS ASTARTES</strong> and <strong>ULTRAMARINES</strong> Faction keywords, and is therefore from the Ultramarines Chapter.</li> <li>You cannot include units from more than one Chapter in your army. </li>"
        }
    ],
    "description": "It is the task of the Deathwatch to defend the Imperium from the ravages of the xenos, countless species of which threaten Mankind in every corner of the galaxy. For thousands of years the Deathwatch have remained true to their endless task. Drawing their numbers from almost every Space Marine Chapter, each is an elite alien killer of proven skill in battle.",
    "units": [
        "Kill Team Cassius",
        "Watch Captain Artemis",
        "Watch Master",
        "Deathwatch Veterans",
        "Corvus Blackstar",
        "Deathwatch Terminator Squad",
        "Fortis Kill Team",
        "Indomitor Kill Team",
        "Proteus Kill Team",
        "Spectrus Kill Team",
        "Veteran Bike Squad"
    ]
}