{
    "detachmentName": "black spear task force",
    "detachmentRule": [
        {
            "name": "deeds worthy of saga",
            "lore": "Legendary deeds in the midst of battle are an intoxicating mead. Those who witness them are inspired to greater feats of daring and valour, determined to prove themselves worthy of their champions.",
            "description": "At the end of each player’s turn, you can select one of the Sagas listed below. If that Saga was completed by your army during that battle round, all ADEPTUS ASTARTES models from your army gain the associated benefit until the end of the battle. You can only select each Saga once per battle. "
        }
    ],
    "enhacements": [
        {
            "name": "the pelt of balewolf",
            "points": 10,
            "lore": "The pelts of wolves are plentiful trophies amongst the heroes of Fenris. However, some of these mantles are rare and steeped in legend, belonging to one of the near-mythical Blackmaned wolves. The Pelt of Balewolf came from a giant of its massive kind. Even now, when the name of its heroic slayer is barely recalled, Balewolf ’s raw spirit still permeates the long-dead creature’s pelt, a bestial aura that reaches into primitive fear centres. Even the mighty instinctively tremble before the wearer, sensing the presence of a terrifying alpha predator.",
            "description": "ADEPTUS ASTARTES model only. At the start of the Fight phase, each enemy unit within Engagement Range of the bearer must take a Battle-shock test."
        },
        {
            "name": "black death",
            "points": 25,
            "lore": "The sagas of Torvald Fangbreaker, of Gerd the Bloody and many others detail the sickening monsters and fell champions slain by Black Death. They tell of how the runic enchantments etched into the ebon weapon glow darkly in battle, transforming the bearer into a relentless killing machine.",
            "description": "ADEPTUS ASTARTES model only. The bearer’s melee weapons have the [ANTI-MONSTER 4+] and [ANTI-VEHICLE 4+] abilities."
        },
        {
            "name": "wold tail talisman",
            "points":20,
            "lore": "Although seen by the sons of Russ as tokens of luck and protection against evil, wolf tail talismans are regarded by most outside the Chapters of Russ’ genetic legacy as trinkets of mere superstition. Yet whether through the power of the bearer’s belief, some attribute inherent in the creatures they are taken from or some stranger reason, these talismans appear to bestow the warrior with a measure of protection against malicious attacks.",
            "description": "ADEPTUS ASTARTES model only. Each time an attack is allocated to the bearer, subtract 1 from the Damage characteristic of that attack."
        },
        {
            "name": "frost weapon",
            "points": 15,
            "lore": "Amongst the most prized weapons of the sons of Russ – himself the Lord of Winter and War – these blisteringly cold weapons are specially crafted by a master Iron Priest. Some are wrought from the razor-sharp fangs of the Ice Kraken, while others are shards of energised diamond, giving them the appearance of blades forged from purest ice.",
            "description": "ADEPTUS ASTARTES model only. The bearer’s melee weapons have the [PRECISION] ability, and the Strength and Armour Penetration characteristics of those weapons are improved by 1."
        }
    ],
    "stratagems": [
        
        {
            "name": "Armour of contempt",
            "subindex": "battle tactic stratagem",
            "lore": "The belligerency and transhuman physiologies of the Adeptus Astartes make them unyielding foes.",
            "when": " Your opponent’s Shooting phase or the Fight phase, just after an enemy unit has selected its targets.",
            "target": "One ADEPTUS ASTARTES unit from your army that was selected as the target of one or more of the attacking unit’s attacks.",
            "effect": "Until the end of the phase, each time an attack targets your unit, worsen the Armour Penetration characteristic of that attack by 1.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "green"
        },
        {
            "name": "go for the throat",
            "subindex": "battle tactic stratagem",
            "lore": "With the scent of blood in the air and the rushing joy of battle surging through every true warrior’s hearts, even the greatest quarry can be brought down.",
            "when": " Fight phase.",
            "target": "One ADEPTUS ASTARTES unit from your army that has not been selected to fight this phase.",
            "effect": "Until the end of the phase, improve the Armour Penetration characteristic of melee weapons equipped by models in your unit by 1. If the Saga of the Beastslayer has been completed by your army, until the end of the phase, such weapons have the [LANCE] ability as well.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "green"
        },
        {
            "name": "runic wards",
            "subindex": "wargear stratagem",
            "lore": "Imbued as they are with the cunning psychic might of the Rune Priests, shamanistic totems, tattoos and fetishes are a potent shield against baleful attacks and the foul sorcery of witches.",
            "when": "Your opponent’s Shooting phase or the Fight phase, just after an enemy unit has selected its targets.",
            "target": "One ADEPTUS ASTARTES unit from your army that was selected as the target of one or more of the attacking unit’s attacks.",
            "effect": "Until the end of the phase, models in your unit have the Feel No Pain 5+ ability against mortal wounds and Psychic Attacks. If the Saga of the Bear has been completed by your army, until the end of the phase, models in your unit have the Feel No Pain 4+ ability against mortal wounds and Psychic Attacks instead.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "green"
        },
        {
            "name": "red rampage",
            "subindex": "strategic ploy stratagem",
            "lore": "Having stalked their prey or run them to ground, all that remains is to go for the enemy’s weakest points, to rip them apart in a furious bloodletting. Onlookers are stricken with terror at the bloody spectacle, an instant before the sons of Russ pounce upon them.",
            "when": "Fight phase.",
            "target": "One ADEPTUS ASTARTES unit from your army that destroyed one or more enemy units this phase.",
            "effect": "Until the end of the phase, each time a model in your unit makes a Consolidation move, it can move up to 6'' instead of up to 3'', provided your unit ends that Consolidation move in Unit Coherency and within Engagement Range of one or more enemy units. In addition, if the Saga of Majesty has been completed by your army, each enemy unit within 6'' of your unit when it ends that Consolidation move must take a Battle-shock test",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "green"
        },
        {
            "name": "warrior pride",
            "subindex": "epic deed stratagem",
            "lore": "The greatest champions amongst the sons of Russ must take the fight to the enemy, leading by example to uphold the honour of their Chapter.",
            "when": "Your Command phase.",
            "target": "One ADEPTUS ASTARTES CHARACTER model from your army.",
            "effect": "Select one Saga that has not yet been completed by your army. Until the end of the turn, models in your CHARACTER’s unit have the benefit of the selected Saga as if it had been completed by your army.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "blue"
        },
        {
            "name": "relentless assault",
            "subindex": "strategic ploy stratagem",
            "lore": "Once their blades and claws run red with the enemy’s blood, nothing will hold the savage sons of Russ back from new prey.",
            "when": "Your Movement phase, just after an ADEPTUS ASTARTES unit from your army Falls Back.",
            "target": "That ADEPTUS ASTARTES unit.",
            "effect": "Until the end of the turn, your unit is eligible to shoot even though it Fell Back or Advanced this phase. If the Saga of the Warrior Born has been completed by your army, until the end of the turn, your unit is also eligible to declare a charge.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "blue"
        }
    ]
}