{
    "detachmentName": "stormlance task force",
    "detachmentRule": [
        {
            "name": "lighting assault",
            "lore": "The warriors of a Stormlance Task Force employ high-speed tactics and hit-and-run warfare. They do battle on the move, wrong-footing their enemies with breakneck manoeuvres and melting away one moment only to crash home like a thunderbolt the next.",
            "description": "<strong>ADEPTUS ASTARTES</strong> units from your army are eligible to declare a charge in a turn in which they Advanced or Fell Back."
        }
    ],
    "enhacements": [
        {
            "name": "Fury of the Storm",
            "points": 25,
            "lore": "This aggressive warrior channels their eagerness to kill into each and every strike. They hit the enemy’s lines with all the ferocity of a raging tempest.",
            "description": "ADEPTUS ASTARTES MOUNTED model only. Improve the Strength and Armour Penetration characteristics of the bearer’s melee weapons by 1. Each time the bearer ends a Charge move, until the end of the turn, improve the Strength and Armour Penetration characteristics of the bearers melee weapons by 2 instead."
        },
        {
            "name": "Portents of Wisdom",
            "points": 15,
            "lore": "This warrior has been made privy to omens of great threats in the wars to come. Armed with this knowledge, they and their battle-brothers enter battle with a boldness that some mistake for recklessness.",
            "description": "ADEPTUS ASTARTES model only. While the bearer is leading a unit, you can re-roll Advance rolls made for that unit."
        },
        {
            "name": "Feinting Withdrawal",
            "points": 20,
            "lore": "This living legend of the Chapter is known for their calm in the heat of battle. Ever-observant of the ebbs and flows of the engagement, they can withdraw their warriors from the fray in good order, ready to hammer home a torrent of fire.",
            "description": "ADEPTUS ASTARTES model only. While the bearer is leading a unit, that unit is eligible to shoot in a turn in which it Fell Back."
        },
        {
            "name": "Hunter’s Instincts",
            "points": 10,
            "lore": "This mounted huntsman espouses the value of circling the enemy and striking suddenly from an unexpected quarter upon their speeding steed, the better to land the killing blow.",
            "description": "ADEPTUS ASTARTES MOUNTED model only. If the bearer’s unit is in Strategic Reserves, for the purposes of setting up that unit on the battlefield, treat the current battle round number as being one higher than it actually is."
        }
    ],
    "stratagems": [
        {
            "name": "armour of contempt",
            "subindex": "Battle Tactic Stratagem",
            "lore": "The belligerence of the Adeptus Astartes combined with their post-human physiology makes them unyielding foes to face.",
            "when": "Your opponent’s Shooting phase or the Fight phase, just after an enemy unit has selected its targets.",
            "target": "One ADEPTUS ASTARTES unit from your army that was selected as the target of one or more of the attacking unit’s attacks.",
            "effect": "Until the end of the phase, each time an attack targets your unit, worsen the Armour Penetration characteristic of that attack by 1.",
            "cp": 1,
            "color": "green"
        },
        {
            "name": "blitzing fusillade",
            "subindex": "Battle Tactic Stratagem",
            "lore": "Warriors of Stormlance Task Forces can suddenly pour heavy and accurate fire into the enemy even as they race to finish off any survivors.",
            "when": "Your Shooting phase.",
            "target": "One ADEPTUS ASTARTES unit from your army that has not been selected to shoot this phase.",
            "effect": "Until the end of the phase, ranged weapons equipped by models in your unit have the [ASSAULT] ability. If such a weapon already has this ability, until the end of the phase, that weapon has the [SUSTAINED HITS 1] ability as well.",
            "cp": 1,
            "color": "blue"
        },
        {
            "name": "full throttle",
            "subindex": "Wargear Stratagem",
            "lore": "On the eve of riding down the most elusive prey, the task force's expert Techmarines will entreat the engine spirits of their vehicles, honing the iron steeds' performance to elicit even more speed from them.",
            "when": "Your Movement phase.",
            "target": "One ADEPTUS ASTARTES MOUNTED or ADEPTUS ASTARTES VEHICLE unit (excluding WALKERS) from your army.",
            "effect": "Until the end of the phase, if your unit Advances, do not make an Advance roll for it. Instead, until the end of the phase, add 6\" to the Move characteristic of models in your unit, or 9\" instead if your unit is MOUNTED.",
            "cp": 2,
            "color": "blue"
        },
        {
            "name": "shock assault",
            "subindex": "Battle Tactic Stratagem",
            "lore": "The Adeptus Astartes are elite troops who strike with all the speed and fury of a searing thunderbolt.",
            "when": "Your Charge phase.",
            "target": "One ADEPTUS ASTARTES MOUNTED unit from your army that has not declared a charge this phase.",
            "effect": "Until the end of the turn, you can re-roll Charge rolls made for your unit and melee weapons equipped by models in that unit have the [LANCE] ability.",
            "cp": 1,
            "color": "blue"
        },
        {
            "name": "ride hard, ride fast",
            "subindex": "Battle Tactic Stratagem",
            "lore": "Like zephyrs dancing across wide horizons, Space Marine riders and pilots can weave lithely around incoming fire with incredible skill.",
            "when": "Your opponent’s Shooting phase, just after an enemy unit has selected its targets.",
            "target": "One ADEPTUS ASTARTES MOUNTED or ADEPTUS ASTARTES FLY VEHICLE unit from your army that was selected as the target of one or more of the attacking unit’s attacks.",
            "effect": "Until the end of the phase, each time an attack targets your unit, subtract 1 from the Hit roll and subtract 1 from the Wound roll.",
            "cp": 1,
            "color": "red"
        },
        {
            "name": "wind-swift evasion",
            "subindex": "Strategic Ploy Stratagem",
            "lore": "Space Marines are loathe to be brought into combat on any others’ terms, especially the warriors of Stormlance Task Forces, whose battlefield tactics revolve around speed and precise, ferocious assaults.",
            "when": "Your opponent’s Movement phase, just after an enemy unit ends a Normal, Advance or Fall Back move.",
            "target": "One ADEPTUS ASTARTES unit from your army that is within 9\" of that enemy unit.",
            "effect": "Your unit can make a Normal move of up to 6\".",
            "restrictions": "You cannot select a unit that is within Engagement Range of one or more enemy units.",
            "cp": 1,
            "color": "red"
        }
    ]
}