{
    "detachmentName": "vanguard spearhead",
    "detachmentRule": [
        {
            "name": "shadow masters",
            "lore": "The warriors of a Vanguard Spearhead slip through the shadows, half-seen spectres barely visible to the foe. Enemies blaze away into the gloom with increasing panic, their shots flying wide as covert specialists encircle their victims and prepare to level the killing blow.",
            "description": "Each time a ranged attack targets an <strong>ADEPTUS ASTARTES </strong>unit from your army, unless the attacking model is within 12'', subtract 1 from the Hit roll and the target has the Benefit of Cover against that attack. "
        }
    ],
    "enhacements": [
        {
            "name": "perdition's edge",
            "points": 15,
            "lore": "With blades carved from noctilith, these axes separate the victim’s soul from the warp briefly as the death blow is delivered. What is only a moment in reality feels like an eternity of damnation to the departing spirit – punishment for their sins against the immortal Emperor.",
            "description": "ADEPTUS ASTARTES model only Improve the Strength and Armour Penetration characteristics of the bearer’s melee weapons by 1. If the Suffer Not the Unclean to Live vow is active for your army, add 1 to the Attacks characteristic of the bearer’s melee weapons as well."
        },
        {
            "name": "witchseeker bolts",
            "points": 10,
            "lore": "With casings forged from the blades of fallen battle-brothers and blessed by the devout priests of the Ministorum, these bolt rounds have an unerring habit of finding their way to the heart of the witch.",
            "description": "ADEPTUS ASTARTES model only. The bearer’s ranged weapons have the [PRECISION], [ANTI-PSYKER 4+] and [DEVASTATING WOUNDS] abilities.  If the Abhor the Witch, Destroy the Witch vow is active for your army, each time the bearer makes a ranged attack that targets a PSYKER unit, you can re-roll the Hit roll and you can re-roll the Wound roll."
        },
        {
            "name": "Sigismund's Seal",
            "points":20,
            "lore": "This sheet of paper-thin adamantine is inscribed with an oath of moment taken by Sigismund under the gaze of the Emperor himself. Such a relic is gifted only to a warrior displaying exemplary martial prowess, galvanising the battle-brothers around them to reach new heights of righteous ferocity.",
            "description": "ADEPTUS ASTARTES model only. Improve the Attacks characteristic of the bearer’s melee weapons by 1. While the bearer is leading a unit, if the Accept Any Challenge, No Matter the Odds vow is active for your army, each time a model in that unit makes a melee attack, a successful unmodified Hit roll of 5+ scores a Critical Hit."
        },
        {
            "name": "Tännhauser's bones",
            "points": 35,
            "lore": "Marshal Tännhauser was martyred at the hands of the Black Legion at the decisive battle of the Rutger’s Reach Crusade. His bones, encased in small reliquaries, were distributed amongst the warriors of that crusade during the victory sermon. Each is a potent reminder of duty and the expectations placed upon every Black Templar.",
            "description": "ADEPTUS ASTARTES model only. Each time an attack is allocated to the bearer, halve the Damage characteristic of that attack. While the bearer is leading a unit, if the Uphold the Honour of the Emperor vow is active for your army, models in that unit have the Feel No Pain 5+ ability."
        }
    ],
    "stratagems": [
        {
            "name": "no escape",
            "subindex": "strategic ploy stratagem",
            "lore": "Glowing blades and revving chainswords close off the foe’s every avenue of escape.",
            "when": "Your opponent’s Movement phase, when an enemy unit (excluding VEHICLES and MONSTERS) is selected to Fall Back.",
            "target": "One ADEPTUS ASTARTES unit from your army that is within Engagement Range of that enemy unit.",
            "effect": "Roll one D6, adding 1 to the result if the Accept Any Challenge, No Matter the Odds vow is active for your army. On a 4+, that enemy unit cannot Fall Back this phase and must Remain Stationary. Otherwise, that enemy unit can Fall Back this phase, but if it does, all models in that unit must take a Desperate Escape test.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "red"
        },
        {
            "name": "fervent acclamation",
            "subindex": "epic deed stratagem",
            "lore": "The magnetic force of this Black Templar’s oratory inspires his fellow warriors to swear great vows, even in the midst of the battle.",
            "when": "Your Command phase.",
            "target": "One ADEPTUS ASTARTES CHARACTER unit from your army.",
            "effect": "Select one Templar Vow that is not active for your army. Until the start of your next Command phase, while that Character is leading a unit, models in that unit gain the benefits of that vow in addition to the vow selected to be active for your army at the start of the battle.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "blue"
        },
        {
            "name": "vicious riposte",
            "subindex": "epic deed stratagem",
            "lore": "Every blow struck against a Black Templar is answered in kind. Even as they are laid low, their blades still lash out at the enemies of the divine Emperor.",
            "when": "Fight phase, just after an enemy unit has selected its targets.",
            "target": "One ADEPTUS ASTARTES unit from your army that was selected as the target of one or more of the attacking unit’s attacks.",
            "effect": "Until the end of the phase, each time a model in your unit is destroyed, if that model has not fought this phase, roll one D6, adding 1 to the result if the Uphold the Honour of the Emperor vow is active for your army. On a 4+, do not remove the destroyed model from play; it can fight after the attacking model’s unit has finished making its attacks, and is then removed from play.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "green"
        },
        {
            "name": "crusader's wrath",
            "subindex": "battle tactic stratagem",
            "lore": "The Black Templars channel their fervour into a hate-fuelled flurry of blows.",
            "when": "Fight phase.",
            "target": "One ADEPTUS ASTARTES unit from your army that has not been selected to fight this phase.",
            "effect": "Until the end of the phase, each time a model in your unit makes a melee attack, improve the Armour Penetration characteristic of that attack by 1. If the Suffer Not The Unclean to Live vow is active for your army, add 1 to the Strength characteristic of that attack as well.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "green"
        },
        {
            "name": "Armour of contempt",
            "subindex": "battle tactic stratagem",
            "lore": "The belligerency and transhuman physiologies of the Adeptus Astartes make them unyielding foes.",
            "when": " Your opponent’s Shooting phase or the Fight phase, just after an enemy unit has selected its targets.",
            "target": "One ADEPTUS ASTARTES unit from your army that was selected as the target of one or more of the attacking unit’s attacks.",
            "effect": "Until the end of the phase, each time an attack targets your unit, worsen the Armour Penetration characteristic of that attack by 1.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "green"
        },
        {
            "name": "devout push",
            "subindex": "strategic ploy stratagem",
            "lore": "With a zealous cry, the Black Templars press forward towards victory.",
            "when": "Your opponent’s Shooting phase, just after an enemy unit has shot.",
            "target": "One ADEPTUS ASTARTES unit from your army that had one or more of its models destroyed as a result of the attacking unit’s attacks.",
            "effect": "Your unit can make a Normal move of up to D6'', but it must end that move closer to the enemy unit that just shot. If the Abhor the Witch, Destroy the Witch vow is active for your army, your unit can make a Normal move of up to 6'' instead, but it must end that move either closer to the enemy unit that just shot, or closer to the closest enemy PSYKER unit.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "red"
        }
    ]
}