{
    "detachmentName": "realspace riders",
    "detachmentRule": [
        {
            "name": "realspace riders",
            "lore": "The three factions of the Drukhari are constantly vying for supremacy, each convinced beyond doubt of their own innate superiority. This struggle manifests during their realspace raids as a frenzy of murderously sadistic competition.",
            "description": "At the start of the battle, you gain an additional 1 Pain token for each of the following your army contains: <br/> <li>One or more <strong>ARCHON</strong> models </li> <li>One or more <strong>SUCCUBUS</strong> models</li> <li>One or more <strong>HAEMONCULUS</strong> models </li> <br/> <p><strong>Designer’s Note: </strong> <i>These are all cumulative, so if your army contains at least one Archon, at least one Succubus and at least one Haemonculus, you would start the battle with an additional 3 Pain tokens. </i></p>"
        }
    ],
    "enhacements": [
        {
            "name": "Crucible of Malediction",
            "points": 10,
            "lore": "When opened, the souls of tortured psykers spew outward, driving any nearby warp-wielders insane.",
            "description": "HAEMONCULUS model only. Once per battle, at the start of any Shooting phase, the bearer can use this Enhancement. When it does, every enemy unit within 12'' must take a Battle-shock test, subtracting 1 from that test if the bearer’s unit is currently Empowered. Each time a PSYKER unit fails this test, it suffers D3 mortal wounds."
        },
        {
            "name": "Labyrinthine Cunning",
            "points": 30,
            "lore": "This Archon has a mind like steel traps, assimilating every detail of a situation.",
            "description": "Archon model only. Each time you select the bearer’s unit as the target of a Stratagem, roll one D6, adding 3 to the result if the Stratagem being used is Alliance of Agony. On a 4+, you gain 1 Command Point."
        },
        {
            "name": "Blood Dancer",
            "points": 20,
            "lore": "This Succubus is renowned for their expertise at close-quarters combat within the arenas of Commorragh. The skills they display before the baying crowds on the blood-soaked sands are equally deadly on the battlefield.",
            "description": "SUCCUBUS model only. Improve the Attacks and Armour Penetration characteristics of the bearer’s melee weapons by 1. While the bearer is Empowered, improve the Attacks and Armour Penetration characteristics of the bearer’s melee weapons by 2 instead."
        },
        {
            "name": "The Art of Pain",
            "points": 25,
            "lore": "Some Drukhari elevate their battle plans to another level by creating a spectacle of torment that maims and cripples every foe in order to draw out the moment of the kill, heightening the pleasure they derive before the fatal blow falls.",
            "description": "DRUKHARI model only. In your Command phase, if the bearer is on the battlefield, you gain 1 Pain token."
        }
    ],
    "stratagems": [
        {
            "name": "prey on the weak",
            "subindex": "epic deed stratagem",
            "lore": "The scent of a foe in pain draws Drukhari to it like hungry predators to an injured beast, their senses sharpening at its tang.",
            "when": "Your Shooting phase.",
            "target": "One KABAL unit from your army and one enemy unit that is Below Half-strength.",
            "effect": "Until the end of the phase, each time a model in your unit makes an attack that targets that enemy unit, you can re-roll the Wound roll.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "blue"
        },
        {
            "name": "strike and fade",
            "subindex": "battle tactic stratagem",
            "lore": "The Drukhari are masters at using hit-and-run tactics, engaging a target with a flurry of shots before quickly manoeuvring into cover or out of sight.",
            "when": "End of your Shooting phase.",
            "target": "One DRUKHARI unit from your army (excluding AIRCRAFT).",
            "effect": "Your unit can immediately make a Normal move.",
            "restrictions":"Until the end of the turn, your unit is not eligible to declare a charge and that unit cannot embark within a TRANSPORT at the end of this move.",
            "icon": [
                ""
            ],
            "cp": 2,
            "color": "blue"
        },
        {
            "name": "acrobatic display",
            "subindex": "epic deed stratagem",
            "lore": "Many Wych Cults favour spectacular gymnastic displays. Their fighters are never still, springing from one foot to the other at blinding speed.",
            "when": "Your Charge phase.",
            "target": "One WYCH CULT unit from your army.",
            "effect": "Until the end of the phase, your unit is eligible to declare a charge even if it Fell Back or Advanced this turn.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "blue"
        },
        {
            "name": "alliance of agony",
            "subindex": "epic deed stratagem",
            "lore": "Even the most bloodthirsty Drukhari will veil their enmity to work together against a shared enemy for the same gruesome purpose.",
            "when": "Start of any phase.",
            "target": "One ARCHON, one SUCCUBUS and one HAEMONCULUS from your army.",
            "effect": "Discard one Pain token from your Pain token pool. Until the end of the phase, all three of those models’ units are Empowered.",
            "restrictions":"You can only use this Stratagem if you are able to select all three of the target models stated above.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "green"
        },
        {
            "name": "quicksilver reactions",
            "subindex": "battle tactic stratagem",
            "lore": "The hyper-fast reflexes of the Drukhari allow them to duck and weave to avoid all but the swiftest enemy strikes.",
            "when": "Your opponent’s Shooting phase or the Fight phase, just after an enemy unit has selected its targets.",
            "target": "One DRUKHARI unit from your army that was selected as the target of one or more of the attacking unit’s attacks.",
            "effect": "Until the end of the phase, each time an attack that targets your unit, subtract 1 from the Hit roll.",
            "restrictions":"You cannot target a HAEMONCULUS COVENS unit from your army for this Stratagem.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "green"
        },
        {
            "name": "insensible to pain",
            "subindex": "battle tactic stratagem",
            "lore": "The twisted creations of the Haemonculus Covens are insensible to all but the most mortal injuries.",
            "when": "Your opponent’s Shooting phase or the Fight phase, just after an enemy unit has selected its targets.",
            "target": "One HAEMONCULUS COVENS unit from your army that was selected as the target of one or more of the attacking unit’s attacks.",
            "effect": "Until the end of the phase, each time an attack targets your unit, subtract 1 from the Wound roll.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "green"
        }
    ]
}