{
    "symbol": "ck",
    
    "rules": [
        {
            "name": "harbingers of dread",
            "lore": "Where Chaos Knights tread, the skies grow unnaturally dark and the dread of the warp permeates the battlefield. None are immune to its shadowy touch, for those it does not paralyse with fear and despair are wracked with hallucinations and driven mad.",
            "description": "<p>If your Army Faction is <strong>CHAOS KNIGHTS</strong>, each model from your army with this ability gains a bonus depending on which Dread abilities are active for your army (see below). Once a Dread ability is active for your army, that ability applies until the end of the battle. </p>  </br>  <div class='bg-zinc-900 text-white py-3 px-3'> <p><strong> BATTLE ROUND 1 ONWARDS</strong>   </p></div> <br/> <p><strong> DESPAIR (AURA) </strong> <p><p>While an enemy unit is within 12'' of this model, each time that enemy unit takes a Battle-shock or Leadership test, subtract 1 from that test. </p>   </br>  <div class='bg-zinc-900 text-white py-3 px-3'> <p><strong> BATTLE ROUND 3 ONWARDS</strong>   </p></div> <br/> <p><strong> DOOM AND DARKNESS</strong> <p> <li>Each time this model makes an attack, if the target is Battle-shocked, add 1 to the Wound roll. </li>  <li>Each time an attack targets this model, if the attacking model’s unit is Battle-shocked, subtract 1 from the Hit roll. </li>  "
        },
        {
            "name": "super-heavy walker",
            "lore": "",
        "description": "Each time a model with this ability makes a Normal, Advance or Fall Back move, it can move over models (excluding <strong>TITANIC</strong> models) and terrain features that are 4'' or less in height as if they were not there."
        },
        {
            "name": "Dreadblades",
            "lore": "Dreadblades often wander the galaxy, carving a path of destruction and slaughtering foes alongside other forces of Chaos as and when they will.",
        "description": "If every model in your army has the <strong>CHAOS</strong> keyword, you can include either 1 <strong>TITANIC CHAOS KNIGHTS</strong> model or up to 3 WAR DOG models in your army, even if they do not have the Faction keyword you selected in the Select Army Faction step. None of these models can be your WARLORD, and they cannot be given Enhancements."
        }
    ],
    
    "detachments": [
        "traitoris lance"
    ],
    "background": "bg-tyranids",
    "description": "Drifting through the void come star-eclipsing shoals of immense creatures whose cephalopodic forms bristle with spines and feeder tendrils. Each of these living vessels is host to thousands upon thousands of dormant warrior-forms, ready to wake from their slumber when the hive fleet locates its next meal.",
    "units": [
        "Knight Abominant",
        "Knight Desecrator",
        "Knight Despoiler",
        "Knight Rampager",
        "Knight Tyrant",
        "War Dog Brigand",
        "War Dog Executioner",
        "War Dog Huntsman",
        "War Dog Karnivore",
        "War Dog Stalker"
    ],
    "characters": [
        {"unitName": "Knight Abominant", "basicPoints": 385},
        {"unitName": "Knight Desecrator", "basicPoints": 425},
        {"unitName": "Knight Despoiler", "basicPoints": 430},
        {"unitName": "Knight Rampager", "basicPoints": 380},
        {"unitName": "Knight Tyrant", "basicPoints": 510},
        {"unitName": "War Dog Stalker", "basicPoints": 150}
      ],
      "battleline": [
        {"unitName": "War Dog Brigand", "basicPoints": 170},
        {"unitName": "War Dog Executioner", "basicPoints": 140},
        {"unitName": "War Dog Huntsman", "basicPoints": 150},
        {"unitName": "War Dog Karnivore", "basicPoints": 140}
      ],
      "other": []
}