{
    "stratagems": [
        {
            "name": "final redemption",
            "subindex": "epic deed stratagem",
            "lore": "Those seeking absolution in the eyes of the Emperor will gladly give their last drop of blood to defy his enemies.",
            "when": "Any phase.",
            "target": "One PENITENT unit from your army that was just destroyed while it was within range of an objective marker you controlled. You can use this Stratagem on that unit even though it was just destroyed.",
            "effect": "That objective marker remains under your control, even if you have no models within range of it, until your opponent controls it at the start or end of any turn.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "green"
        },
        {
            "name": "lash of guilt",
            "subindex": "battle tactic stratagem",
            "lore": "Agony and guilt drive these sinners forward. Only by meeting the enemy in combat may they find repentance or, failing that, the comfort of death.",
            "when": "Your Movement phase, just before a PENITENT unit from your army Advances.",
            "target": "That PENITENT unit.",
            "effect": "Until the end of the turn, your unit is eligible to declare a charge in a turn in which it Advanced. If your unit has the PENITENT ENGINES keyword, do not make an Advance roll for it; instead, at the end of the phase, add 6\" to the Move characteristic of models in your unit.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "blue"
        },
        {
            "name": "purity of suffering",
            "subindex": "battle tactic stratagem",
            "lore": "Suffering is the penance by which the faithful affirm their devotions. To share in the agonies suffered by the God-Emperor and his saints without embracing death is the mark of fidelity to the Imperial Creed.",
            "when": "Your opponent's Shooting phase or the Fight phase, just after an enemy unit has selected its targets.",
            "target": "One PENITENT unit from your army that was selected as the target of one or more of the attacking unit's attacks.",
            "effect": "Until the end of the phase, PENITENT models in your unit have the Feel No Pain 4+ ability.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "green"
        },
        {
            "name": "passion of the penitent",
            "subindex": "battle tactic stratagem",
            "lore": "The penitent are full of a burning passion to inflict suffering upon the faithless.",
            "when": "Fight phase.",
            "target": "One PENITENT unit from your army that has not been selected to fight this phase.",
            "effect": "Until the end of the phase, each time a PENITENT model in your unit makes a melee attack, a successful unmodified Hit roll of 5+ scores a Critical Hit.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "green"
        },
        {
            "name": "boundless zeal",
            "subindex": "strategic ploy stratagem",
            "lore": "The urge to absolve their sins and destroy the enemy drives the penitents to push their tortured bodies beyond their mortal limits.",
            "when": "Your Movement phase, just after an ADEPTA SORORITAS unit from your army Falls Back.",
            "target": "That ADEPTA SORORITAS unit.",
            "effect": "Until the end of the turn, your unit is eligible to shoot or declare a charge in a turn in which it Fell Back. If your unit has the PENITENT keyword, it is eligible to shoot and declare a charge in a turn in which it Fell Back instead.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "green"
        },
        {
            "name": "devout fanaticism",
            "subindex": "strategic ploy stratagem",
            "lore": "The God-Emperor's faithful followers, heedless of incoming fire, leap forth to deliver his furious judgement in the press of melee.",
            "when": "Your opponent's Shooting phase, just after an enemy unit has selected its targets.",
            "target": "One PENITENT unit from your army that was selected as the target as one or more of the attacking unit's attacks.",
            "effect": "Roll one D6: your unit can be moved a distance in inches up to the result, but it must end that move as close as possible to the closest enemy unit (excluding AIRCRAFT). When doing so, models in your unit can be moved within Engagement Range of enemy units.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "red"
        }
    ]
}
