{
    "detachmentName": "Penitent Host",
    "detachmentRule": [
        {
            "name": "Desperate for Redemption",
            "lore": "The penitent masses vow to wash clean their dishonour with their foe's blood.",
            "description": "At the start of the battle round, select one of the following Vows of Atonement to be active for your army until the start of the next battle round. You may only select each Vow of Atonement once per battle.
            
            <div>
    <strong>The Path of the Penitent</strong>
    <p><em>With psalms on their lips, the faithful hurl themselves forward.</em></p>
    <p>Add 3'' to the Move characteristic of PENITENT models from your army.</p>
</div>
<div>
    <strong>Absolution in Battle</strong>
    <p><em>The penitents smite the Emperor's foes with unmatched zeal.</em></p>
    <p>Each time a unit from your army is selected to fight, if that unit made a Charge move this turn, until the end of the phase, add 1 to the Attacks and Strength characteristics of melee weapons equipped by PENITENT models in that unit.</p>
</div>
<div>
    <strong>Death Before Disgrace</strong>
    <p><em>Even the most grievous wound cannot stop a penitent warrior in their quest to earn redemption in the eyes of the Emperor.</em></p>
    <p>Each time a PENITENT model from your army is destroyed by a melee attack, if that model has not fought this phase, roll one D6. On a 2+, do not remove it from play: the destroyed model can fight after the attacking unit has finished making its attacks, and is then removed from play.</p>
</div>"
        }
    ],
    "enhacements": [
        {
            "name": "Psalm of Righteous Judgement",
            "points": 20,
            "lore": "Invoking the wrath of the God-Emperor, this warrior bellows psalms, which drown the din of battle. Incited by fire and brimstone recitations, the penitent warriors carve apart their enemies, every kill bringing them closer to redemption.",
            "description": "ADEPTA SORORITAS model only. While the bearer is on the battlefield, each time an enemy unit is destroyed by a PENITENT unit from your army, you can discard 1 Miracle dice then gain 1 Miracle dice showing a value of 6."
        },
        {
            "name": "Verse of Holy Piety",
            "points": 15,
            "lore": "As the sanctified verses of the Ecclesiarchy's holy psalms roar across the battlefield, divine might infuses the devout.",
            "description": "PENITENT model only. Once per battle, at the start of the battle round, select one Vow of Atonement (see left). Until the start of the next battle round, that Vow of Atonement is active for the bearer's unit in addition to any that is active for your army, even if you have already selected that Vow of Atonement this battle."
        },
        {
            "name": "Refrain of Enduring Faith",
            "points": 10,
            "lore": "Faith is the shield of the righteous. The passionate benedictions of the pious may bestow the blessings of the God-Emperor.",
            "description": "PENITENT model only. While the bearer is leading a unit, models in that unit have a 5+ invulnerable save."
        },
        {
            "name": "Catechism of Divine Penitence",
            "points": 5,
            "lore": "To share in the agonies of the penitent and guide them to redemption is a most holy undertaking. Thus do many of the Adepta Sororitas' commanders willingly fight by the side of those cast out by the Sisterhood.",
            "description": "CANONESS, PALATINE or MINISTORUM PRIEST model only. The bearer gains the PENITENT keyword and, during the Declare Battle Formations step, can be attached to a REPENTIA SQUAD unit."
        }
    ],
    "stratagems": [
        {
            "name": "final redemption",
            "subindex": "epic deed stratagem",
            "lore": "Those seeking absolution in the eyes of the Emperor will gladly give their last drop of blood to defy his enemies.",
            "when": "Any phase.",
            "target": "One PENITENT unit from your army that was just destroyed while it was within range of an objective marker you controlled. You can use this Stratagem on that unit even though it was just destroyed.",
            "effect": "That objective marker remains under your control, even if you have no models within range of it, until your opponent controls it at the start or end of any turn.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "green"
        },
        {
            "name": "lash of guilt",
            "subindex": "battle tactic stratagem",
            "lore": "Agony and guilt drive these sinners forward. Only by meeting the enemy in combat may they find repentance or, failing that, the comfort of death.",
            "when": "Your Movement phase, just before a PENITENT unit from your army Advances.",
            "target": "That PENITENT unit.",
            "effect": "Until the end of the turn, your unit is eligible to declare a charge in a turn in which it Advanced. If your unit has the PENITENT ENGINES keyword, do not make an Advance roll for it; instead, at the end of the phase, add 6\" to the Move characteristic of models in your unit.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "blue"
        },
        {
            "name": "purity of suffering",
            "subindex": "battle tactic stratagem",
            "lore": "Suffering is the penance by which the faithful affirm their devotions. To share in the agonies suffered by the God-Emperor and his saints without embracing death is the mark of fidelity to the Imperial Creed.",
            "when": "Your opponent's Shooting phase or the Fight phase, just after an enemy unit has selected its targets.",
            "target": "One PENITENT unit from your army that was selected as the target of one or more of the attacking unit's attacks.",
            "effect": "Until the end of the phase, PENITENT models in your unit have the Feel No Pain 4+ ability.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "green"
        },
        {
            "name": "passion of the penitent",
            "subindex": "battle tactic stratagem",
            "lore": "The penitent are full of a burning passion to inflict suffering upon the faithless.",
            "when": "Fight phase.",
            "target": "One PENITENT unit from your army that has not been selected to fight this phase.",
            "effect": "Until the end of the phase, each time a PENITENT model in your unit makes a melee attack, a successful unmodified Hit roll of 5+ scores a Critical Hit.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "green"
        },
        {
            "name": "boundless zeal",
            "subindex": "strategic ploy stratagem",
            "lore": "The urge to absolve their sins and destroy the enemy drives the penitents to push their tortured bodies beyond their mortal limits.",
            "when": "Your Movement phase, just after an ADEPTA SORORITAS unit from your army Falls Back.",
            "target": "That ADEPTA SORORITAS unit.",
            "effect": "Until the end of the turn, your unit is eligible to shoot or declare a charge in a turn in which it Fell Back. If your unit has the PENITENT keyword, it is eligible to shoot and declare a charge in a turn in which it Fell Back instead.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "blue"
        },
        {
            "name": "devout fanaticism",
            "subindex": "strategic ploy stratagem",
            "lore": "The God-Emperor's faithful followers, heedless of incoming fire, leap forth to deliver his furious judgement in the press of melee.",
            "when": "Your opponent's Shooting phase, just after an enemy unit has selected its targets.",
            "target": "One PENITENT unit from your army that was selected as the target as one or more of the attacking unit's attacks.",
            "effect": "Roll one D6: your unit can be moved a distance in inches up to the result, but it must end that move as close as possible to the closest enemy unit (excluding AIRCRAFT). When doing so, models in your unit can be moved within Engagement Range of enemy units.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "red"
        }
    ]
}
