{
    "detachmentName": "awakened dynasty",
    "detachmentRule": [
        {
            "name": "command protocols",
            "lore": "The Necron nobility and their high-ranking courtiers make war in a codified and relentless fashion. Their command protocols crackle out across multi-dimensional spectra from carrier-wave projectors, compelling their semi-sentient soldiery into battle one overriding directive at a time",
            "description": "While a <strong>NECRONS CHARACTER</strong> model is leading this unit, each time a model in this unit makes an attack, add 1 to the Hit roll."
        }
    ],
    "enhacements": [
        {
            "name": "Veil of Darkness",
            "points": 20,
            "lore": "With this device the bearer can twist space and time about them, enfolding them in a swirling darkness. When it fades, they have vanished, rematerialising elsewhere through a miracle of arcane science.",
            "description": "NECRONS model only. Once per battle, at the end of your opponent’s turn, if the bearer’s unit is not within Engagement Range of any enemy units, the bearer can use this Enhancement. If it does, remove that unit from the battlefield. Then, in the Reinforcements step of your next Movement phase, set up that unit anywhere on the battlefield that is more than 9'' horizontally away from all enemy models."
        },
        {
            "name": "Nether-realm Casket",
            "points": 20,
            "lore": "Clouds of hyper-dense particles billow from this small artefact, to obscure and shield the bearer from the foe.",
            "description": "NECRONS model only. While the bearer is leading a unit, models in that unit have the Stealth ability."
        },
        {
            "name": "Phasal Subjugator (Aura)",
            "points": 35,
            "lore": "This engraved sigil-circuitry transforms the fierce will of the bearer into a surging lash across every phasal state.",
            "description": "NECRONS model only. While a friendly NECRONS unit (excluding CHARACTER units) is within 6'' of the bearer, each time a model in that unit makes an attack, add 1 to the Hit roll."
        },
        {
            "name": "Enaegic Dermal Bond",
            "points": 15,
            "lore": "The bearers living metal mantle is bonded to mirror versions of itself across many dimensional thresholds.",
            "description": "NECRONS model only. The bearer has the Feel No Pain 4+ ability."
        }
    ],
    "stratagems": [
        {
            "name": "protocol of the eternal revenant",
            "subindex": "epic deed stratagem",
            "lore": "Necron rulers possess enhanced self-repair systems.",
            "when": "Any phase.",
            "target": "One NECRONS INFANTRY CHARACTER model from your army that was just destroyed. You can use this Stratagem on that model even though it was just destroyed.",
            "effect": "At the end of the phase, set your model back up on the battlefield as close as possible to where it was destroyed and not within Engagement Range of any enemy units, with half of its starting number of wounds remaining.",
            "restrictions":"Each model can only be targeted with this Stratagem once per battle.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "green"
        },
        {
            "name": "protocol of the undying legions",
            "subindex": "strategic ploy stratagem",
            "lore": "Nanoscarabs are released in boiling black clouds that whirl about the legions and effect rapid repairs",
            "when": "Your opponent’s Shooting phase or the Fight phase, just after an enemy unit has resolved its attacks.",
            "target": "One NECRONS unit from your army that had one or more of its models destroyed as a result of the attacking unit’s attacks",
            "effect": "Your unit activates its Reanimation Protocols and reanimates D3 wounds (or D3+1 wounds if a NECRONS CHARACTER is leading your unit].",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "green"
        },
        {
            "name": "protocol of the hungry void",
            "subindex": "battle tactic stratagem",
            "lore": "Necrons strike with data-augmented accuracy.",
            "when": " Fight phase.",
            "target": "One NECRONS unit from your army that has not been selected to fight this phase.",
            "effect": "Until the end of the phase, add 1 to the Strength characteristic of melee weapons equipped by models in your unit. In addition, If a NECRONS CHARACTER is leading your unit, until the end of the phase, improve the Armour Penetration characteristic of melee weapons equipped by models in your unit by 1. (this is not cumulative with any other modifiers that improve Armour Penetration].",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "green"
        },
        {
            "name": "protocol of the sudden storm",
            "subindex": "strategic ploy stratagem",
            "lore": "Arcing energies leap from one Necron to the next, lending them unnatural speed and surety",
            "when": " Your Movement phase.",
            "target": "One NECRONS unit from your army.",
            "effect": "Until the end of the turn, ranged weapons equipped by models in your unit have the [ASSAULT] ability. In addition, if a NECRONS CHARACTER is leading your unit, until the end of the phase, you can re-roll Advance rolls made for your unit.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "blue"
        },
        {
            "name": "protocol of the conquering tyrant",
            "subindex": "battle tactic stratagem",
            "lore": "The legions employ the strategies of their masters in perfect synchronicity, laying down hails of mechanically coordinated fire.",
            "when": "Your Shooting phase.",
            "target": "One NECRONS unit from your army that has not been selected to shoot this phase.",
            "effect": "Until the end of the phase, each time a model in your unit makes an attack that targets a unit within half range, re-roll a Hit roll of 1. If a NECRONS CHARACTER is leading your unit, until the end of the phase, you can re-roll the Hit roll for that attack instead.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "blue"
        },
        {
            "name": "protocol of the vengeful stars",
            "subindex": "strategic ploy stratagem",
            "lore": "Criss-crossfire leaps from the Necron ranks, forming a blazing corona of deadly energy to punish those who dare threaten the indignant nobility's legions.",
            "when": "Your opponent’s Shooting phase, just after an enemy unit destroys a NECRONS unit from your army.",
            "target": "One NECRONS CHARACTER unit from your army that was within 6'' of that NECRONS unit when it was destroyed.",
            "effect": "After the attacking unit has resolved its attacks, your unit can shoot as if it were your Shooting phase, but it must target only that enemy unit when doing so, and can only do so if that enemy unit is an eligible target.",
            "icon": [
                ""
            ],
            "cp": 2,
            "color": "red"
        }
    ]
}