{
    "detachmentName": "canoptek court",
    "detachmentRule": [
        {
            "name": "power matrix",
            "lore": "Countless worlds across the galaxy harbour quiescent Necron technology, buried beneath the surface or mistaken for mere xenoarchaeological ruins. Whether part of an awakening tomb world’s defences, phased beneath the crust of a planet to empower the Cryptek’s conquest or perhaps the very objects they seek, these strange engines can be roused to wakefulness. Linked in an interdimensional matrix, their ancient energy cores can be vampirically bled to empower the Crypteks’ arcane technologies as well as their artificial and servile constructs.",
            "description": "Certain areas of the battlefield are considered to be within your army’s Power Matrix, as follows: <br> <li>Your deployment zone is always within your army’s Power Matrix.</li> <li>At the start of any phase, if you control at least half of the objective markers within No Man’s Land, until the end of that phase, No Man’s Land is within your army’s Power Matrix</li> <li>At the start of any phase, if you control at least half of the objective markers within your opponent’s deployment zone, until the end of that phase, your opponent’s deployment zone is within your army’s Power Matrix</li> <br/>  Each time a model in a CRYPTEK or CANOPTEK unit from your army makes an attack, re-roll a Hit roll of 1. If such a unit is wholly within your army’s Power Matrix, you can re-roll the Hit roll instead."
        }
    ],
    "enhacements": [
        {
            "name": "Dimensional Sanctum",
            "points": 20,
            "lore": "This Cryptek has had a personal dimensional pocket reality crafted for them, from which they can emerge into battle at will.",
            "description": "CRYPTEK model only. Models in the bearer’s unit have the Infiltrators ability."
        },
        {
            "name": "Hyperphasic Fulcrum",
            "points": 15,
            "lore": "With this small orb, its surface shimmering in fractal hues and shifting in multidimensional facets, a Cryptek can bypass the ancient security protocols placed upon the areas dormant machineries. Esoteric data and unusual strands of energy can be accessed, the orb acting as a skeleton key to greater power.",
            "description": "CRYPTEK model only. While the bearer is leading a unit, if that unit is wholly within your army’s Power Matrix, each time a model in that unit makes an attack, re-roll a Wound roll of 1."
        },
        {
            "name": "Autodivinator",
            "points": 15,
            "lore": "This cryptogeometric puzzle box harbours a chronoscarab. The tiny construct creeps forward in time along temporal webs before hauling back a captured net of future moments. Its master can scry these wriggling futures to predict their foe’s strategies, using the knowledge to develop new counter-tactics to ambush the attackers.",
            "description": "CRYPTEK model only. Each time your opponent gains a CP as the result of an ability, roll one D6: on a 2+, you also gain 1CP."
        },
        {
            "name": "Metalodermal Tesla Weave",
            "points": 10,
            "lore": "This microsilicate weave generates a cyclical electrostatic overload that, providing its user triggers it in time, sends arcing lightning leaping out to roast onrushing attackers.",
            "description": "CRYPTEK model only. Once per phase, when an enemy unit selects the bearer’s unit as a target of a charge, roll one D6: on a 2-5, that enemy unit suffers D3 mortal wounds; on a 6, that enemy unit suffers 3 mortal wounds."
        }
    ],
    "stratagems": [
        {
            "name": "curse of the cryptek",
            "subindex": "battle tactic stratagem",
            "lore": "Vindictive Crypteks often hardwire vengeance sub protocols into the ancient cores of their unliving servants, by which a last act of reprisal is assured.",
            "when": "Your opponent’s Shooting phase or the Fight phase, just after an enemy unit has shot or fought.",
            "target": "One CRYPTEK model from your army that was destroyed by one of the attacking unit’s attacks. You can use this Stratagem on that model even though it was just destroyed.",
            "effect": "Until the end of the battle, each time a friendly CANOPTEK model makes an attack that targets the attacking unit, add 1 to the Hit roll and add 1 to the Wound roll.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "green"
        },
        {
            "name": "cynosure of eradication",
            "subindex": "battle tactic stratagem",
            "lore": "Only the foolish tread where a Cryptek has set their sights, for these arcane scientists will suffer no threat to their works.",
            "when": " The start of your Shooting phase or the start of the Fight phase.",
            "target": "One CRYPTEK or CANOPTEK unit from your army that is wholly within your army’s Power Matrix.",
            "effect": "Until the end of the phase, weapons equipped by CRYPTEK or CANOPTEK models in your unit have the [DEVASTATING WOUNDS] ability.",
            "icon": [
                ""
            ],
            "cp": 2,
            "color": "green"
        },
        {
            "name": "solar pulse",
            "subindex": "strategic ploy stratagem",
            "lore": "By remotely accessing a hidden engine's most illuminating protocols, a Cryptek can release the awesome power of a caged solar flare.",
            "when": "Start of your Shooting phase.",
            "target": " One CRYPTEK model from your army.",
            "effect": "Select one objective marker within 18'' of your CRYPTEK model. Until the end of the phase, weapons equipped by friendly NECRONS models have the [IGNORES COVER] ability while targeting units within range of that objective marker.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "blue"
        },
        {
            "name": "reactive subroutines",
            "subindex": "strategic ploy stratagem",
            "lore": "Canoptek constructs spent the long Great Sleep in watchful vigilance. Triggering a surge of power, they are capable of responsive manoeuvres to outwit the swiftest of attackers.",
            "when": "Your opponent’s Movement phase, just after an enemy unit ends a Normal, Advance or Fall Back move.",
            "target": "One CANOPTEK unit from your army that is within 9'' of that enemy unit.",
            "effect": "Your unit can make a Normal move of up to 6''",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "red"
        },
        {
            "name": "countertermporal shift",
            "subindex": "strategic ploy stratagem",
            "lore": "With a twist to the fabric of time, a bubble of another moment enshrouds these constructs. Strange emissions from long-dead elder stars or utter darkness from a nighttime far in the future occludes them from their master’s foes.",
            "when": "Your opponent’s Shooting phase, just after an enemy unit has selected its targets.",
            "target": "One CANOPTEK unit from your army that was selected as the target of one or more of the attacking unit’s attacks.",
            "effect": "Until the end of the phase, your unit can only be selected as the target of a ranged attack if the attacking model is within 12''.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "red"
        },
        {
            "name": "suboptimal facade",
            "subindex": "strategic ploy stratagem",
            "lore": "Canoptek constructs use sophisticated metalogic to craft sinister ambushes. Luring the foe in by appearing at suboptimal operation, a surge of reanimation protocols suddenly swells their numbers.",
            "when": "Your opponent’s Charge phase, just after an enemy unit has declared a charge.",
            "target": "One CANOPTEK unit from your army that was selected as a target of that charge and is wholly within your army’s Power Matrix.",
            "effect": "Your unit’s Reanimation Protocols activate.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "red"
        }
    ]
}