{
    "detachmentName": "hypercrypt legion",
    "detachmentRule": [
        {
            "name": "hyperphasing",
            "lore": "Employing fractal corridors, dolmen gates and ancient translocation science, the Necrons are able to phase in and out of existence. Nowhere is safe for the terrified foe as mechanoid hunters appear from unfolding planar lattices to slaughter or escape retribution into gulfs of darkness, only to materialise elsewhere to kill anew.",
            "description": "At the end of your opponents turn, you can select a number of <strong>NECRONS</strong> units from your army (excluding units that are within Engagement Range of one or more enemy units). The maximum number of units you can select depends on the battle size, as follows:   <p>Once you have made your selections, remove those units from the battlefield and place them into Strategic Reserves. </p>"
        }
    ],
    "enhacements": [
        {
            "name": "Dimensional Overseer",
            "points": 25,
            "lore": "With a mind as labyrinthine as the multi-dimensional tomb itself, this commander directs their servants in complex forays through the tomb’s hyperspatial architecture, catching the witless enemy off guard.",
            "description": "NECRONS model only. While the bearer is on the battlefield or in Strategic Reserves, add one to the number of units from your army that you can select for the Hyperphasing rule."
        },
        {
            "name": "Arisen Tyrant",
            "points": 25,
            "lore": "This ancient being will suffer no threats to their rule, stepping imperiously from twisting nightmare dimensions to annihilate any who dare to oppose them.",
            "description": "NECRONS model only. Each time a model in the bearer’s unit makes an attack, re-roll a Hit roll of 1. If the bearer’s unit was set up on the battlefield this turn, you can re-roll the Hit roll instead."
        },
        {
            "name": "Hyperspatial Transfer Node",
            "points": 15,
            "lore": "Wound with filaments of temporal circuitry, this amulet enables the bearer to accelerate themselves and their closest guardians in stuttering bursts of compressed time.",
            "description": "NECRONS model only. Each time the bearer’s unit Advances, do not make an Advance roll for it. Instead, until the end of the phase, add 6'' to the Move characteristic of models in the bearer’s unit."
        },
        {
            "name": "Osteoclave Fulcrum",
            "points": 20,
            "lore": "This hypermaterial key unlocks portals between transpatial dimensions embedded into a tomb’s architecture. Through such limitless doorways, the Necrons can pursue their quarry wherever they hide.",
            "description": "NECRONS model only. Models in the bearer’s unit have the Deep Strike ability."
        }
    ],
    "stratagems": [
        {
            "name": "hyperphasic recall",
            "subindex": "strategic ploy stratagem",
            "lore": "Obeying recall protocols, threatened tomb defenders will phase out of existence, only to be relocated to a more advantageous position by the tomb's hulking Monoliths.",
            "when": "Your opponent’s Shooting phase or the Fight phase, just after an enemy unit has shot or fought.",
            "target": "One NECRONS INFANTRY unit from your army that had one or more of its models destroyed as a result of the attacking unit’s attacks and one friendly MONOLITH model.",
            "effect": "Remove your INFANTRY unit from the battlefield and then set it back up anywhere on the battlefield that is wholly within 6'' of your MONOLITH model and not within Engagement Range of one or more enemy units..",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "green"
        },
        {
            "name": "quantom deflection",
            "subindex": "wargear stratagem",
            "lore": "Necron quantum shielding is a true marvel of techno-arcana. Channelled with energy reserves from the rising tomb structures, the shielding is capable of adaptive remodulation to diffuse and deflect the most powerful enemy attacks.",
            "when": "Your opponent’s Shooting phase or the Fight phase, just after an enemy unit has selected its targets.",
            "target": "One NECRONS VEHICLE unit from your army that was selected as the target of one or more of the attacking unit’s attacks.",
            "effect": "Until the end of the phase, models in your unit have a 4+ invulnerable save.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "green"
        },
        {
            "name": "reanimation crypts",
            "subindex": "strategic ploy stratagem",
            "lore": "There is no rest for Necrons who fall in the service of their master. In dark crypts, their bodies are repaired and they are dispatched once more to war.",
            "when": "Your Command phase.",
            "target": "Your NECRONS WARLORD",
            "effect": "For each of your NECRONS units in Reserves, that Reserves unit’s Reanimation Protocols activate.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "blue"
        },
        {
            "name": "cosmic precision",
            "subindex": "strategic ploy stratagem",
            "lore": "With a sanity-defying mechanism at the heart of the tomb, dynastic astromancers divine the pre-aligned point in space and time where a crucial role can be played in the wider battle plan.",
            "when": "Your Movement phase.",
            "target": "One NECRONS unit from your army that is arriving using the Deep Strike or Hyperphasing abilities this phase.",
            "effect": "Your unit can be set up anywhere on the battlefield that is more than 3'' horizontally away from all enemy models.",
            "restrictions":"A unit targeted with this Stratagem is not eligible to declare a charge in the same turn.",
            "icon": [
                ""
            ],
            "cp": 2,
            "color": "green"
        },
        {
            "name": "dimensional corridor",
            "subindex": "strategic ploy stratagem",
            "lore": "As the tomb's warriors pass through a dimensional displacement corridor, the passage’s surface is lit with data-glyphs providing hyperlogical tactical information. When they step from an eternity gate, they are already prepared for the hunt.",
            "when": "Your Charge phase.",
            "target": "One NECRONS unit from your army that was set up on the battlefield this turn using the Eternity Gate ability of a MONOLITH model that started the turn on the battlefield.",
            "effect": "Your unit is eligible to charge this phase.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "blue"
        },
        {
            "name": "entropic damping",
            "subindex": "wargear stratagem",
            "lore": "Towering war engines rise from an erupting tomb in its defence, directing entropic energies to weaken and fracture the enemies' own weapons and turning them into dangerous tools only the desperate would use.",
            "when": "Your opponent’s Shooting phase, just after an enemy unit has selected its targets.",
            "target": " One TITANIC model from your army that was selected as the target of one or more of the attacking unit’s attacks and is within 18'' of the attacking unit.",
            "effect": "Until the end of the phase, weapons equipped by models in the attacking unit have the [HAZARDOUS] ability.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "red"
        }
    ]
}