{
    "detachmentName": "obeisance phalanx",
    "detachmentRule": [
        {
            "name": "worthy foes",
            "lore": "With a command transmitted by regal carrier wave, signalled by a glowing glyph or via a haughty gesture with their blade, the ruling nobles mark their chosen enemy. With this declaration are the Triarchal Codes observed, and the ignorant foe doomed. The nobles’ powerful servants and the Triarch’s guardians of tradition march to war obediently, driven to best the mightiest of foes on the battlefield as a demonstration of the dynasty’s honour and a warning to the rest of their enemies’ foolish kind.",
            "description": "In your Command phase, select one enemy unit. Until the start of your next Command phase, each time an <strong>OVERLORD</strong>, <strong>LYCHGUARD</strong> or <strong>TRIARCH</strong> unit from your army makes an attack that targets that unit, add 1 to the Wound roll."
        }
    ],
    "enhacements": [
        {
            "name": "Honourable Combatant",
            "points": 10,
            "lore": "A strict adherent to the ancient codes, this noble reserves their greatest displays of power to execute the enemy's leaders. Such champions are brought low in ostentatious manner, the inspiration or strategy they once provided severed at a stroke.",
            "description": "OVERLORD model only. Each time the bearer’s unit destroys an enemy CHARACTER unit, your opponent loses 1CP if they have any."
        },
        {
            "name": "Unflinching Will",
            "points": 20,
            "lore": "With sheer will this noble drives their warriors into battle against the most malevolent foes. Not from pretenders to nobility, nor marauding beasts, nor titanic machineries will this noble turn; they have faced greater horrors during their long existence.",
            "description": "OVERLORD model only. The bearer’s melee weapons have the [PRECISION] and [ANTI-INFANTRY 5+] abilities."
        },
        {
            "name": "Warrior Noble",
            "points": 15,
            "lore": "This dynastic scion is an expert in the arts of martial excellence, and their living metal form has been enhanced by their Crypteks. With effortless arrogance, they and their guardians parry or contemptuously swat aside the strikes of those they see as their lessers.",
            "description": "OVERLORD model only. Each time a melee attack targets the bearer’s unit, subtract 1 from the Hit roll."
        },
        {
            "name": "Eternal Conqueror",
            "points": 25,
            "lore": "This insatiable subjugator sees all before them as theirs for the taking by ancient right of conquest. They wield their legion like an iron gauntlet, using it to seize the battlefield in a demonstration of their power and strength, daring others to try taking it from them.",
            "description": "OVERLORD model only. Each time a model in the bearer’s unit makes an attack that targets an enemy unit within range of an objective marker, you can re-roll the Hit roll."
        }
    ],
    "stratagems": [
        {
            "name": "your time is nigh",
            "subindex": "epic deed stratagem",
            "lore": "With a pulse of necroneural energy that erodes the foe’s will, the Necron commander declares the fall of the enemy general, promising their remaining forces that it is only a matter of time until they join their master in ignoble death.",
            "when": "Any phase, just after your opponent’s WARLORD is destroyed.",
            "target": "Your NECRONS WARLORD.",
            "effect": "Until the end of the battle, each time a friendly TYRANIDS model makes an attack that targets the enemy unit that just destroyed your HARVESTER unit, add 1 to the Wound roll.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "green"
        },
        {
            "name": "enslaved artifice",
            "subindex": "battle tactic stratagem",
            "lore": "It is not only android soldiery that be compelled to serve. With a command, prized war engines and ornate weapons are empowered to hyperlethality.",
            "when": "Your Shooting phase or the Fight phase.",
            "target": "One NECRONS unit from your army (excluding TITANIC units) that has not been selected to shoot or fight this phase.",
            "effect": "Until the end of the phase, each time a model in your unit makes an attack, an unmodified Hit roll of 5+ scores a Critical Hit.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "green"
        },
        {
            "name": "nanoassembly protocols",
            "subindex": "battle tactic stratagem",
            "lore": "A tomb world’s war engines are the pride of its nobility and they will suffer no affront to them, demanding the reassembly of slablike armour atom by atom even as the foe seek to sunder the vehicles.",
            "when": "Your opponent’s Shooting phase or the Fight phase, just after an enemy unit has selected its targets.",
            "target": "One NECRONS VEHICLE unit from your army that was selected as the target of one or more of the attacking unit’s attacks.",
            "effect": "Until the end of the phase, each time an attack is allocated to a model in your unit, subtract 1 from the Damage characteristic of that attack.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "green"
        },
        {
            "name": "sentinels of eternity",
            "subindex": "epic deed stratagem",
            "lore": "Lychguard never tire, nor give a thought to their own safety over that of their master. With parrying blows and blocking shots they protect their liege even as they continue to strike down their opponents.",
            "when": "Fight phase, just after an enemy unit has selected its targets.",
            "target": "One LYCHGUARD or TRIARCH PRAETORIANS unit from your army that was selected as the target of one or more of the attacking unit’s attacks.",
            "effect": "Until the end of the phase, each time a model in your unit is destroyed, if that model has not fought this phase, roll one D6: on a 4+, do not remove it from play. The destroyed model can fight after the attacking model’s unit has finished making attacks, and is then removed from play.",
            "icon": [
                ""
            ],
            "cp": 2,
            "color": "green"
        },
        {
            "name": "suffer no rival",
            "subindex": "battle tactic stratagem",
            "lore": "Few enemy are worthy of a duel. What dangerous vermin are encountered are prioritised for execution to safeguard the nobles' honour.",
            "when": "Fight phase.",
            "target": "One LYCHGUARD or TRIARCH unit from your army that has not been selected to fight this phase.",
            "effect": "Until the end of the phase, melee weapons equipped by models in your unit have the [PRECISION] ability.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "green"
        },
        {
            "name": "territorial obsession",
            "subindex": "strategic ploy stratagem",
            "lore": "The ancient and arrogant will of the nobility drives their powerful servants to stand their ground defiantly as they claim the dynasty's rightful lands.",
            "when": "Your Command phase.",
            "target": "One LYCHGUARD or TRIARCH unit from your army",
            "effect": "Until the start of your next Command phase, add 1 to the Objective Control characteristic of models in your unit. If your unit has the VEHICLE keyword, add 3 to the Objective Control characteristic instead.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "blue"
        }
    ]
}