{
    "detachmentName": "shield host",
    "detachmentRule": [
        {
            "name": "martial mastery",
            "lore": "The Custodians have perfected countless ways of making war, be it on a personal, tactical or strategic scale",
            "description": "<p>Once per battle, at the start of the battle round, you can use Martial Mastery. If you do, until the start of the next battle round:</p> <br/> <li>Each time an <strong>ADEPTUS CUSTODES</strong> model from your army with the Martial Kata'h ability makes a melee attack, a successful unmodified Hit roll of 5+ scores a Critical Hit.</li><li>Improve the Armour Penetration characteristic of melee weapons equipped by <strong>ADEPTUS CUSTODES</strong> models from your army with the Martial Kata'h ability by 1.</li>"
        }
    ],
    "enhacements": [
        {
            "name": "From the Hall of Armouries",
            "points": 25,
            "lore": "The racks of the Adeptus Custodes' armouries yield up some of the most finely crafted close-quarter weapons borne by any soldiers of the Imperium.",
            "description": "SHIELD-CAPTAIN model only. Add 1 to the Strength and Damage characteristics of the bearer's melee weapons."
        },
        {
            "name": "Castellan's Mark",
            "points": 30,
            "lore": "This finely worked pauldron is awarded to whichever living Custodian currently holds the greatest tally of victories in the Blood Games. The one who has the Castellan's Mark is guaranteed to be a superlative strategic genius.",
            "description": "SHIELD-CAPTAIN model only. After both players have deployed their armies and determined who has the first turn, you can select up to two ADEPTUS CUSTODES units from your army (excluding ANATHEMA PSYKANA units) and redeploy all of those units. When doing so, any of those units can be placed into Strategic Reserves, regardless of how many units are already in Strategic Reserves."
        },
        {
            "name": "Auric Mantle",
            "points": 15,
            "lore": "This auramite weave garment is draped about a wearer's shoulders before they don their battle armour. It forms a final, incredibly resilient layer of protection.",
            "description": "SHIELD-CAPTAIN or BLADE CHAMPION model only. Add 2 to the bearer's Wounds characteristic."
        },
        {
            "name": "Panoptispex",
            "points": 5,
            "lore": "This incredibly advanced precursor to Imperial auspicators is able to see through solid objects and the etheric spectra, meaning no miscreant can hide from its bearer's gaze.",
            "description": "SHIELD-CAPTAIN or BLADE CHAMPION model only. While the bearer is leading a unit, ranged weapons used by models in that unit have the [IGNORES COVER] ability."
        }
    ],
   
        "stratagems": [
            {
                "name": "Arcane Genetic Alchemy",
                "subindex": "battle tactic stratagem",
                "lore": "The Adeptus Custodes are individually engineered on a molecular level using secrets of genetic alchemy that render them virtually demigods in battle.",
                "when": "Your opponent’s Shooting phase or the Fight phase, just after an enemy unit has selected its targets.",
                "target": "One ADEPTUS CUSTODES INFANTRY unit from your army (excluding ANATHEMA PSYKANA units) that was selected as the target of one or more of the attacking unit’s attacks.",
                "effect": "Until the end of the phase, each time an attack is allocated to a model in your unit, subtract 1 from the Damage characteristic of that attack (to a minimum of 1).",
                "cp": 1,
                "color": "green"
            },
            {
                "name": "Avenge the Fallen",
                "subindex": "battle tactic stratagem",
                "lore": "The loss of a single Custodian is commemorated by the tolling of the Bell of Lost Souls on Terra, and by their comrades' bloody vengeance on the battlefield.",
                "when": "Start of the Fight phase.",
                "target": "One ADEPTUS CUSTODES unit from your army (excluding ANATHEMA PSYKANA units) that is below its Starting Strength.",
                "effect": "Until the end of the phase, add 1 to the Attacks characteristic of melee weapons equipped by models in your unit. If your unit is Below Half-strength, until the end of the phase, add 2 to the Attacks characteristic of those melee weapons instead.",
                "cp": 1,
                "color": "green"
            },
            {
                "name": "Unwavering Sentinels",
                "subindex": "strategic ploy stratagem",
                "lore": "Custodians will not be moved from their objective.",
                "when": "Start of the Fight phase.",
                "target": "One ADEPTUS CUSTODES INFANTRY unit from your army (excluding ANATHEMA PSYKANA units) that is within range of an objective marker.",
                "effect": "Until the end of the phase, each time a model in the unit is attacked, subtract 1 from the Hit roll.",
                "cp": 1,
                "color": "green"
            },
            {
                "name": "Multipotentaility",
                "subindex": "epic deed stratagem",
                "lore": "Shield-hosts study and drill until the Custodians do whatever movement phase is to prevail.",
                "when": "Your Movement phase.",
                "target": "One ADEPTUS CUSTODES unit from your army that Fell Back this phase.",
                "effect": "Until the end of your turn, that unit is eligible to shoot and declare a charge in a turn in which it Fell Back.",
                "cp": 1,
                "color": "blue"
            },
            {
                "name": "Vigilance Eternal",
                "subindex": "strategic ploy stratagem",
                "lore": "Simply because the Adeptus Custodes do not stand sentinel over a strategic location or asset, does not mean their gaze – or gun – would threaten it escapes their notice.",
                "when": "Your Movement phase.",
                "target": "One ADEPTUS CUSTODES BATTLELINE unit from your army (excluding ANATHEMA PSYKANA units) within range of an objective marker.",
                "effect": "Until the objective marker remains under your control, even if you have no models within range of it, until your opponent controls it at the start or end of any turn.",
                "cp": 1,
                "color": "blue"
            },
            {
                "name": "Archeotech Munitions",
                "subindex": "war gear stratagem",
                "lore": "The Shield Hosts have access to stockpiles of ancient and incredibly rare weaponry, which they mount accordingly.",
                "when": "Your Shooting phase.",
                "target": "One ADEPTUS CUSTODES unit from your army (excluding ANATHEMA PSYKANA units) that has not been selected to shoot this phase.",
                "effect": "Select either the [LETHAL HITS] or [SUSTAINED HITS] 1 ability. Until the end of the phase, ranged weapons equipped by models in your unit have the selected ability.",
                "cp": 1,
                "color": "blue"
            }
        ]
        
    
}