{
    "detachmentName": "talons of the emperor",
    "detachmentRule": [
        {
            "name": "revered companions",
            "lore": "The Custodians and the Silent Sisters often fought as one during the earliest days od the Imperium. Ten thousand years on, they have lost none of the unity of doctrine and purpose that makes them such a deadly combination",
            "description": "<strong>ANATHEMA PSYKANA</strong> units from your army gain the following abilities: <br/> <li> <strong>Null Aegis (Aura):</strong> While an <strong>ADEPTUS CUSTODES</strong> unit is within 6'' of this unit, models in that unit have the Feel No Pain 5+ ability against Psychic Attacks and mortal wounds. </li><br/>   All other <strong>ADEPTUS CUSTODES</strong> units from your army gain the following ability: <br/> <li><strong>Deadly Unity (Aura):</strong> While an <strong>ANATHEMA PSYKANA</strong> unit is within 6'' of this unit, each time a model in that <strong>ANATHEMA PSYKANA</strong> unit makes an attack, add 1 to the Hit roll.</li>"
        }
    ],
    "enhacements": [
        {
            "name": "Radiant Mantle",
            "points": 30,
            "lore": "The golden glory of the Emperor himself glows around this magnificent warrior like Sol's own fire. Enemies are blinded by its light, forced to recoil in pain and terror.",
            "description": "ADEPTUS CUSTODES model only. Each time an attack targets the bearer's unit, if the attacking model is within 12\", subtract 1 from the Hit roll."
        },
        {
            "name": "Gift of Terran Artifice",
            "points": 15,
            "lore": "This warrior wields a close-quarters weapon crafted by the finest noble artisans of Terra, the workmanship of which is magnificent in its lethality.",
            "description": "ADEPTUS CUSTODES model only. Each time the bearer makes a melee attack, add 1 to the Wound roll."
        },
        {
            "name": "Champion of the Imperium",
            "points": 25,
            "lore": "This leader is amongst the finest martial champions in all the Emperor’s realm, and their mere presence inspires their followers to remarkable efforts.",
            "description": "ADEPTUS CUSTODES model only. The range of the bearer’s Null Aegis or Deadly Units ability (see left) is increased to 9\"."
        },
        {
            "name": "Aegis Projector",
            "points": 20,
            "lore": "This archaeotech field projector triggers in response to autoproemionetary danger input. It pulse-casts a temporary force field that can stave off even the most powerful attacks, before charging ready for another use.",
            "description": "ADEPTUS CUSTODES model only. Once per turn, the first time a saving throw is failed for the bearer’s unit, increase the Damage characteristic of that attack to 0."
        }
    ],
    "stratagems": [
        {
            "name": "Hunt as One",
            "subindex": "strategic ploy stratagem",
            "lore": "Talons of the Emperor – In unison, the Null Maidens cover one another with shields and silence to corner their prey, seamlessly.",
            "when": "Start of your Movement phase.",
            "target": "Up to two ADEPTUS CUSTODES units from your army.",
            "effect": "Until the end of the turn, units are eligible to shoot and/or declare a charge in a turn in which they Fall Back.",
            "restrictions": "You can only select two units if one (and only one) of them is an ANATHEMA PSYKANA unit and both are within 6\" of each other.",
            "cp": 1,
            "color": "blue"
        },
        {
            "name": "Talons Interlocked",
            "subindex": "battle tactic stratagem",
            "lore": "Talons of the Emperor – With practiced ease, the Talons of the Emperor establish vicious crossfires to cut the foe apart.",
            "when": "Your Shooting phase.",
            "target": "Up to two ADEPTUS CUSTODES INFANTRY units from your army, and one enemy unit that is an eligible target for all of those units.",
            "effect": "Until the end of the phase, your units can only target that enemy unit, but each time a model in one of your units makes a ranged attack, improve the Strength and Armour Penetration characteristics of that attack by 1.",
            "restrictions": "You can only select two units if one (and only one) of them is an ANATHEMA PSYKANA unit and both are within 6\" of each other.",
            "cp": 1,
            "color": "blue"
        },
        {
            "name": "Empyric Severance",
            "subindex": "battle tactic stratagem",
            "lore": "Talons of the Emperor – Null Maidens quash the manifestations of witches.",
            "when": "Your opponent's Shooting phase or the Fight phase, just after an enemy unit has selected its targets.",
            "target": "One ADEPTUS CUSTODES unit from your army that was selected as the target of one or more of the attacking unit's attacks, and one friendly ANATHEMA PSYKANA unit within 6\" of that ADEPTUS CUSTODES unit.",
            "effect": "Until the end of the phase, your unit has the No Pain 4+ ability against Psychic attacks and mortal wounds.",
            "cp": 1,
            "color": "green"
        },
        {
            "name": "Emperor's Executioners",
            "subindex": "battle tactic stratagem",
            "lore": "Talons of the Emperor – The Talons of the Emperor cut through traitor, xenos, and heretic with merciless efficiency.",
            "when": "Start of the Fight phase.",
            "target": "Up to two ADEPTUS CUSTODES units from your army.",
            "effect": "Until the end of the phase, each time a model in one of your units targets an enemy unit that is below Starting Strength, add 1 to the Wound roll.",
            "restrictions": "You can only select two units if one (and only one) of them is an ANATHEMA PSYKANA unit and both are within 6\" of each other.",
            "cp": 2,
            "color": "green"
        },
        {
            "name": "Taloned Pincer",
            "subindex": "battle tactic stratagem",
            "lore": "Talons of the Emperor – Every move the enemy makes only sees them fall further into the Golden Legion’s orchestrated ambush.",
            "when": "When your opponent's Movement phase has just ended.",
            "target": "Up to two ADEPTUS CUSTODES units from your army that are within 6\" of a friendly unit.",
            "effect": "Your units can make a Normal move of up to 3\". If your unit is within Engagement Range of one or more enemy units, you can only select two units if one (and only one) of them is an ANATHEMA PSYKANA unit and both are within 6\" of each other.",
            "cp": 1,
            "color": "red"
        },
        {
            "name": "Shield of Honour",
            "subindex": "epic deed stratagem",
            "lore": "Talons of the Emperor – It is second nature for Custodes to place themselves in harm's way to protect their charge.",
            "when": "When your opponent's Shooting phase has just ended after an enemy unit has selected its targets.",
            "target": "One ANATHEMA PSYKANA INFANTRY unit from your army that was selected as the target of one or more of the attacking unit's attacks, and one other friendly ADEPTUS CUSTODES unit (excluding ANATHEMA PSYKANA units) within 6\" of that ANATHEMA PSYKANA unit.",
            "effect": "Until the end of the phase, any attack that targets your ANATHEMA PSYKANA unit must instead target your other ADEPTUS CUSTODES unit (unless it is not an eligible target).",
            "cp": 1,
            "color": "red"
        }
    ]
}