{
    "detachmentName": "company of hunters",
    "detachmentRule": [
        {
            "name": "masters of manoeuvre",
            "lore": "The Ravenwing are fearsome and daring hunters, relentless in pursuit and furious on the assault When they lead the Dark Angels to war they inspire their battle-brothers with their strategic and tactical mastery of high-speed warfare, knightly bike-mounted venators leading every charge and rapidly outmanoeuvring the foe.",
            "description": "ADEPTUS ASTARTES units from your army are eligible to shoot in a turn in which they Advanced or Fell Back. Your army can include DARK ANGELS units, but it cannot include any ADEPTUS ASTARTES units drawn from any other Chapter. OUTRIDER units from your army gain the BATTLELINE keyword. "
        }
    ],
    "enhacements": [
        {
            "name": "Master-Crafted Weapon",
            "points": 10,
            "lore": "Those who command the Ravenwing on their hunts are often honoured with a masterwork blade, mace or other deadly close-quarters weapon. Such implements are fashioned by the Chapters artificers and weighted perfectly to be wielded from the saddle of a speeding armoured steed.",
            "description": "RAVENWING model only. Melee weapons equipped by the bearer have the [PRECISION] ability."
        },
        {
            "name": "Mounted Strategist",
            "points": 30,
            "lore": "This warrior has mastered the art of such advanced ploys as feigning flight only to turn swiftly upon overextended foes and launch a devastating counter-offensive to shatter their lines.",
            "description": "RAVENWING model only. The bearer’s unit is eligible to declare a charge in a turn in which it Advanced or Fell Back."
        },
        {
            "name": "Master Of Manoeuvre",
            "points":15,
            "lore": "Daring and audacious, this commander favours breakneck outflanking manoeuvres that allow them to plunge into the enemy's midst from unexpected quarters.",
            "description": "RAVENWING model only. If the bearer’s unit starts the battle in Strategic Reserves, its points value does not count towards the combined points limit for units from your army that are in Strategic Reserve, and for the purposes of setting up that unit on the battlefield, treat the current battle round number as being one higher than it actually is."
        },
        {
            "name": "Recon Hunter",
            "points": 20,
            "lore": "This commander is an expert scout as well as hunter, and takes advantage of these skills to seize the most advantageous position before battle begins.",
            "description": "RAVENWING model only. Models in the bearer’s unit have the Scouts 9'' ability."
        }
    ],
    "stratagems": [
        
        {
            "name": "Armour of contempt",
            "subindex": "battle tactic stratagem",
            "lore": "The belligerency and transhuman physiologies of the Adeptus Astartes make them unyielding foes.",
            "when": " Your opponent’s Shooting phase or the Fight phase, just after an enemy unit has selected its targets.",
            "target": "One ADEPTUS ASTARTES unit from your army that was selected as the target of one or more of the attacking unit’s attacks.",
            "effect": "Until the end of the phase, each time an attack targets your unit, worsen the Armour Penetration characteristic of that attack by 1.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "green"
        },
        {
            "name": "go for the throat",
            "subindex": "battle tactic stratagem",
            "lore": "With the scent of blood in the air and the rushing joy of battle surging through every true warrior’s hearts, even the greatest quarry can be brought down.",
            "when": " Fight phase.",
            "target": "One ADEPTUS ASTARTES unit from your army that has not been selected to fight this phase.",
            "effect": "Until the end of the phase, improve the Armour Penetration characteristic of melee weapons equipped by models in your unit by 1. If the Saga of the Beastslayer has been completed by your army, until the end of the phase, such weapons have the [LANCE] ability as well.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "green"
        },
        {
            "name": "runic wards",
            "subindex": "wargear stratagem",
            "lore": "Imbued as they are with the cunning psychic might of the Rune Priests, shamanistic totems, tattoos and fetishes are a potent shield against baleful attacks and the foul sorcery of witches.",
            "when": "Your opponent’s Shooting phase or the Fight phase, just after an enemy unit has selected its targets.",
            "target": "One ADEPTUS ASTARTES unit from your army that was selected as the target of one or more of the attacking unit’s attacks.",
            "effect": "Until the end of the phase, models in your unit have the Feel No Pain 5+ ability against mortal wounds and Psychic Attacks. If the Saga of the Bear has been completed by your army, until the end of the phase, models in your unit have the Feel No Pain 4+ ability against mortal wounds and Psychic Attacks instead.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "green"
        },
        {
            "name": "red rampage",
            "subindex": "strategic ploy stratagem",
            "lore": "Having stalked their prey or run them to ground, all that remains is to go for the enemy’s weakest points, to rip them apart in a furious bloodletting. Onlookers are stricken with terror at the bloody spectacle, an instant before the sons of Russ pounce upon them.",
            "when": "Fight phase.",
            "target": "One ADEPTUS ASTARTES unit from your army that destroyed one or more enemy units this phase.",
            "effect": "Until the end of the phase, each time a model in your unit makes a Consolidation move, it can move up to 6'' instead of up to 3'', provided your unit ends that Consolidation move in Unit Coherency and within Engagement Range of one or more enemy units. In addition, if the Saga of Majesty has been completed by your army, each enemy unit within 6'' of your unit when it ends that Consolidation move must take a Battle-shock test",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "green"
        },
        {
            "name": "warrior pride",
            "subindex": "epic deed stratagem",
            "lore": "The greatest champions amongst the sons of Russ must take the fight to the enemy, leading by example to uphold the honour of their Chapter.",
            "when": "Your Command phase.",
            "target": "One ADEPTUS ASTARTES CHARACTER model from your army.",
            "effect": "Select one Saga that has not yet been completed by your army. Until the end of the turn, models in your CHARACTER’s unit have the benefit of the selected Saga as if it had been completed by your army.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "blue"
        },
        {
            "name": "relentless assault",
            "subindex": "strategic ploy stratagem",
            "lore": "Once their blades and claws run red with the enemy’s blood, nothing will hold the savage sons of Russ back from new prey.",
            "when": "Your Movement phase, just after an ADEPTUS ASTARTES unit from your army Falls Back.",
            "target": "That ADEPTUS ASTARTES unit.",
            "effect": "Until the end of the turn, your unit is eligible to shoot even though it Fell Back or Advanced this phase. If the Saga of the Warrior Born has been completed by your army, until the end of the turn, your unit is also eligible to declare a charge.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "blue"
        }
    ]
}