{
    "detachmentName": "company of hunters",
    "detachmentRule": [
        {
            "name": "masters of manoeuvre",
            "lore": "The Ravenwing are fearsome and daring hunters, relentless in pursuit and furious on the assault When they lead the Dark Angels to war they inspire their battle-brothers with their strategic and tactical mastery of high-speed warfare, knightly bike-mounted venators leading every charge and rapidly outmanoeuvring the foe.",
            "description": "ADEPTUS ASTARTES units from your army are eligible to shoot in a turn in which they Advanced or Fell Back. Your army can include DARK ANGELS units, but it cannot include any ADEPTUS ASTARTES units drawn from any other Chapter. OUTRIDER units from your army gain the BATTLELINE keyword. "
        }
    ],
    "enhacements": [
        {
            "name": "Master-Crafted Weapon",
            "points": 10,
            "lore": "Those who command the Ravenwing on their hunts are often honoured with a masterwork blade, mace or other deadly close-quarters weapon. Such implements are fashioned by the Chapters artificers and weighted perfectly to be wielded from the saddle of a speeding armoured steed.",
            "description": "RAVENWING model only. Melee weapons equipped by the bearer have the [PRECISION] ability."
        },
        {
            "name": "Mounted Strategist",
            "points": 30,
            "lore": "This warrior has mastered the art of such advanced ploys as feigning flight only to turn swiftly upon overextended foes and launch a devastating counter-offensive to shatter their lines.",
            "description": "RAVENWING model only. The bearer’s unit is eligible to declare a charge in a turn in which it Advanced or Fell Back."
        },
        {
            "name": "Master Of Manoeuvre",
            "points":15,
            "lore": "Daring and audacious, this commander favours breakneck outflanking manoeuvres that allow them to plunge into the enemy's midst from unexpected quarters.",
            "description": "RAVENWING model only. If the bearer’s unit starts the battle in Strategic Reserves, its points value does not count towards the combined points limit for units from your army that are in Strategic Reserve, and for the purposes of setting up that unit on the battlefield, treat the current battle round number as being one higher than it actually is."
        },
        {
            "name": "Recon Hunter",
            "points": 20,
            "lore": "This commander is an expert scout as well as hunter, and takes advantage of these skills to seize the most advantageous position before battle begins.",
            "description": "RAVENWING model only. Models in the bearer’s unit have the Scouts 9'' ability."
        }
    ],
    "stratagems": [
        
        {
            "name": "Armour of contempt",
            "subindex": "battle tactic stratagem",
            "lore": "The belligerency and transhuman physiologies of the Adeptus Astartes make them unyielding foes.",
            "when": " Your opponent’s Shooting phase or the Fight phase, just after an enemy unit has selected its targets.",
            "target": "One ADEPTUS ASTARTES unit from your army that was selected as the target of one or more of the attacking unit’s attacks.",
            "effect": "Until the end of the phase, each time an attack targets your unit, worsen the Armour Penetration characteristic of that attack by 1.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "green"
        },
        {
            "name": "hunter's trail",
            "subindex": "strategic ploy stratagem",
            "lore": "Using augur beacons, servo-skulls and the like, the Ravenwing mark locations they have passed through and cleansed of foes, laying a trial their fellows can follow on the hunt.",
            "when": "Your opponent’s Shooting phase or the Fight phase, just after an enemy unit has selected its targets.",
            "target": "One ADEPTUS ASTARTES unit from your army that was selected as the target of one or more of the attacking unit’s attacks.",
            "effect": "Until the end of the phase, each time an attack targets your unit, worsen the Armour Penetration characteristic of that attack by 1.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "green"
        },
        {
            "name": "talon strike",
            "subindex": "strategic ploy stratagem",
            "lore": "Be it their true quarry or simply one who possesses knowledge that will lead them to their apprehension, when the Ravenwing strike at a priority target they do so with unmerciful surety.",
            "when": "Your Shooting phase or the Fight phase.",
            "target": "One RAVENWING MOUNTED unit from your army that has not been selected to shoot or fight this phase.",
            "effect": "Until the end of the phase, each time a model in your unit makes an attack that targets an INFANTRY CHARACTER or MOUNTED CHARACTER unit, add 1 to the Wound roll.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "green"
        },
        {
            "name": "death on the wind",
            "subindex": "battle tactic stratagem",
            "lore": "The Ravenwing employ shock tactics and focussed firepower to tear bloody paths through the enemy ranks, shattering resistance and clearing the way to their true quarry.",
            "when": "Your Shooting phase.",
            "target": "One RAVENWING unit from your army that has just shot.",
            "effect": "Select one enemy unit that was hit by one or more of those attacks. That unit must take a Battle-shock test. When doing so, if one or more RAVENWING units from your army are within 6'' of that enemy unit, subtract 1 from the test.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "blue"
        },
        {
            "name": "high-speed focus",
            "subindex": "battle tactic stratagem",
            "lore": "Even when travelling at breakneck pace, the Ravenwing control their vehicles with consummate skill and are able to jink and dodge around incoming enemy fire.",
            "when": "Your opponent’s Shooting phase, just after an enemy unit has selected its targets.",
            "target": "One RAVENWING unit from your army that was selected as the target of one or more of the attacking unit’s attacks.",
            "effect": "Until the end of the phase, each time an attack targets your unit, subtract 1 from the Hit roll.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "red"
        },
        {
            "name": "relentless assault",
            "subindex": "battle tactic stratagem",
            "lore": "The Ravenwing scan and analyse their foes’ strategic dispositions constantly, augury and aerial surveillance helping to watch that no quarry slips their closing net. They are quick to redirect combat assets should such a risk present itself",
            "when": "End of your opponent’s Fight phase.",
            "target": "One RAVENWING unit from your army that is not within Engagement Range of one or more enemy units.",
            "effect": "Remove your unit from the battlefield and place it into Strategic Reserves.",
            "icon": [
                ""
            ],
            "cp": 2,
            "color": "red"
        }
    ]
}