{
    "detachmentName": "unforgiven task force",
    "detachmentRule": [
        {
            "name": "grim resolve",
            "lore": "The Dark Angels are renowned for their unshakeable resolve, enduring tenacity and strict discipline in battle. They are tactically astute, able to prosecute their wars on any front. On the offence, they strike with all the martial pride of the Lion, while in defence they are stalwart, determined to accomplish their mission no matter the cost.",
            "description": "While an ADEPTUS ASTARTES unit from your army is Battle-shocked, change the Objective Control characteristic of models in that unit to 1, instead of 0. Your army can include DARK ANGELS units, but it cannot include any ADEPTUS ASTARTES units drawn from any other Chapter. "
        }
    ],
    "enhacements": [
        {
            "name": "Shroud Of Heroes",
            "points": 25,
            "lore": "Formed from the death shrouds of some of the Chapters greatest warriors, this robe inspires its wearer with the might and selflessness of those who came before.",
            "description": "ADEPTUS ASTARTES model only. The first time the bearer is destroyed, roll one D6 at the end of the phase. On a 2+, set the bearer back up on the battlefield as close as possible to where it was destroyed and not within Engagement Range of any enemy units, with 3 wounds remaining (if the bearer was Battle-shocked when it was destroyed, it is instead returned with its full wounds remaining)."
        },
        {
            "name": "Stubborn Tenacity",
            "points": 15,
            "lore": "Even for a Chapter as famously stubborn as the Dark Angels, this warrior is known for their intractable nature.",
            "description": "ADEPTUS ASTARTES model only. While the bearer is leading a unit, each time a model in that unit makes an attack, add 1 to the Hit roll if that unit is below its Starting Strength, and add 1 to the Wound roll as well if that unit is Battle-shocked and below its Starting Strength."
        },
        {
            "name": "Weapons Of The First Legion",
            "points":15,
            "lore": "Beneath the surface of the Rock lie vaults within which weapons of antiquity and terrible power are stored.",
            "description": "ADEPTUS ASTARTES model only. Add 1 to the Attacks, Strength and Damage characteristics of the bearer’s melee weapons. While the bearer is Battle-shocked, add 2 to the Attacks, Strength and Damage characteristics of the bearer s melee weapons instead."
        },
        {
            "name": "Pennant Of Remembrance",
            "points": 10,
            "lore": "This hallowed banner records the names and deeds of legendary members of the Deathwing, stoking still firmer resolve in those who fight beneath it.",
            "description": "ANCIENT model only. While the bearer is leading a unit, models in that unit have the Feel No Pain 6+ ability. While that unit is Battle-shocked, models in that unit have the Feel No Pain 4+ ability instead."
        }
    ],
    "stratagems": [
        
        {
            "name": "Armour of contempt",
            "subindex": "battle tactic stratagem",
            "lore": "The belligerency and transhuman physiologies of the Adeptus Astartes make them unyielding foes.",
            "when": " Your opponent’s Shooting phase or the Fight phase, just after an enemy unit has selected its targets.",
            "target": "One ADEPTUS ASTARTES unit from your army that was selected as the target of one or more of the attacking unit’s attacks.",
            "effect": "Until the end of the phase, each time an attack targets your unit, worsen the Armour Penetration characteristic of that attack by 1.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "green"
        },
        {
            "name": "unforgiven fury",
            "subindex": "battle tactic stratagem",
            "lore": "With the scent of blood in the air and the rushing joy of battle surging through every true warrior’s hearts, even the greatest quarry can be brought down.",
            "when": " Fight phase.",
            "target": "One ADEPTUS ASTARTES unit from your army that has not been selected to fight this phase.",
            "effect": "Until the end of the phase, improve the Armour Penetration characteristic of melee weapons equipped by models in your unit by 1. If the Saga of the Beastslayer has been completed by your army, until the end of the phase, such weapons have the [LANCE] ability as well.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "green"
        },
        {
            "name": "intractable",
            "subindex": "strategic ploy stratagem",
            "lore": "Imbued as they are with the cunning psychic might of the Rune Priests, shamanistic totems, tattoos and fetishes are a potent shield against baleful attacks and the foul sorcery of witches.",
            "when": "Your opponent’s Shooting phase or the Fight phase, just after an enemy unit has selected its targets.",
            "target": "One ADEPTUS ASTARTES unit from your army that was selected as the target of one or more of the attacking unit’s attacks.",
            "effect": "Until the end of the phase, models in your unit have the Feel No Pain 5+ ability against mortal wounds and Psychic Attacks. If the Saga of the Bear has been completed by your army, until the end of the phase, models in your unit have the Feel No Pain 4+ ability against mortal wounds and Psychic Attacks instead.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "blue"
        },
        {
            "name": "fire discipline",
            "subindex": "battle tactic stratagem",
            "lore": "Having stalked their prey or run them to ground, all that remains is to go for the enemy’s weakest points, to rip them apart in a furious bloodletting. Onlookers are stricken with terror at the bloody spectacle, an instant before the sons of Russ pounce upon them.",
            "when": "Fight phase.",
            "target": "One ADEPTUS ASTARTES unit from your army that destroyed one or more enemy units this phase.",
            "effect": "Until the end of the phase, each time a model in your unit makes a Consolidation move, it can move up to 6'' instead of up to 3'', provided your unit ends that Consolidation move in Unit Coherency and within Engagement Range of one or more enemy units. In addition, if the Saga of Majesty has been completed by your army, each enemy unit within 6'' of your unit when it ends that Consolidation move must take a Battle-shock test",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "blue"
        },
        {
            "name": "grim retribution",
            "subindex": "strategic ploy stratagem",
            "lore": "The greatest champions amongst the sons of Russ must take the fight to the enemy, leading by example to uphold the honour of their Chapter.",
            "when": "Your Command phase.",
            "target": "One ADEPTUS ASTARTES CHARACTER model from your army.",
            "effect": "Select one Saga that has not yet been completed by your army. Until the end of the turn, models in your CHARACTER’s unit have the benefit of the selected Saga as if it had been completed by your army.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "red"
        },
        {
            "name": "unbreakable lines",
            "subindex": "battle tactic stratagem",
            "lore": "Once their blades and claws run red with the enemy’s blood, nothing will hold the savage sons of Russ back from new prey.",
            "when": "Your Movement phase, just after an ADEPTUS ASTARTES unit from your army Falls Back.",
            "target": "That ADEPTUS ASTARTES unit.",
            "effect": "Until the end of the turn, your unit is eligible to shoot even though it Fell Back or Advanced this phase. If the Saga of the Warrior Born has been completed by your army, until the end of the turn, your unit is also eligible to declare a charge.",
            "icon": [
                ""
            ],
            "cp": 2,
            "color": "red"
        }
    ]
}