{
  "parentUnit": "Belisarius Cawl",
  "factionKeywords": [
    "adeptus mechanicusadeptus mechanicusadeptus mechanicusadeptus mechanicusadeptus mechanicusadeptus mechanicus"
  ],
  "damaged": {},
  "supremeCommander": true,
  "lore": "Belisarius Cawl’s war form is a multi-limbed, biomechanical hybrid. Advanced bionics grant him immense strength and resilience, while snaking tendrils rapidly repair his cybernetic body. For ten thousand years, Cawl has eradicated the Imperium’s enemies, and he leads the Machine God’s devotees in holy acquisition still.",
  "keywords": [
    "monster",
    "character",
    "epic hero",
    "imperium",
    "tech-priest",
    "cult mechanicus",
    "belisarius cawl"
  ],
  "attributes": [{
    "movement": 6,
    "toughness": 8,
    "salvation": 2,
    "wounds": 10,
    "leadership": 6,
    "objectiveControl": 3,
    "invulnerableSave": 4
  }],
  "leader": [],
  "rangedWeapons": [
    {
      "name": "Solar atomiser",
      "modifiers": [
        "blast",
        "melta d3"
      ],
      "range": 18,
      "strength": 14,
      "attacks": "d3",
      "ballistic-skills": 2,
      "armor-penetration": 4,
      "damage": 3,
      "singleChoice": false
    }
  ],
  "abilities": {
    "core": [
      "Canticles of the Omnissiah: At the start of the battle round",
      "select one of the abilities in the Canticles of the Omnissiah section (see left). Until the start of the next battle round",
      "this model has that ability.Mechanicus Bodyguard: While this model is within 3\" of one or more other friendly ADEPTUS MECHANICUSADEPTUS MECHANICUSADEPTUS MECHANICUSADEPTUS MECHANICUSADEPTUS MECHANICUSADEPTUS MECHANICUS units",
      "this model has the Lone Operative ability.Self-repair Mechanisms: At the start of your Command phase",
      "this model regains up to D3 lost wounds."
    ],
    "faction": [],
    "otherAbilities": [
      {
        "name": "Shroudpsalm (Aura):",
        "description": "While a friendly ADEPTUS MECHANICUS ADEPTUS MECHANICUS ADEPTUS MECHANICUS ADEPTUS MECHANICUS ADEPTUS MECHANICUS ADEPTUS MECHANICUS unit is within 6\" of this model, each time a ranged attack targets that unit, that unit has the Benefit of Cover against that attack."
      }
    ]
  }
}