{
    "parentUnit": "Cybernetica Datasmith",
    "factionKeyword": [
        "adeptus mechanicus"
    ],
    "damaged": {},
    "supremeCommander": false,
    "lore": "Datasmiths optimise the programming of their robotic charges. These Tech-Priests employ rituals and binharic hymns to bless the doctrina wafers through which they alter the robots’ protocols, all the while laying waste to the enemies of the Omnissiah with blasts of ionising radiation from their archeotech pistols.",
    "keywords": [
        "infantry",
        "character",
        "imperium",
        "legio cybernetica",
        "tech-priest",
        "cybernetica datasmith"
    ],
    "attributes": [
        {
            "movement": 6,
            "toughness": 4,
            "save": 2,
            "wounds": 3,
            "leadership": 7,
            "objetiveControl": 1,
            "invulnerableSave": 5
        }
    ],
    "leader": [
        "Kastelan Robots"
    ],
    "leaderInfo":"You must attach this model to a KASTELAN ROBOTS unit, even if one or more other CYBERNETICA DATASMITH models have already been attached to it. In such cases, if that Bodyguard unit is destroyed, the Leader units attached to it become separate units with their original Starting Strengths. If you cannot attach this model to a KASTELAN ROBOTS unit, this model cannot be deployed and counts as having been destroyed during the first battle round. While attached to a KASTELAN ROBOTS unit, this model loses the INFANTRY keyword.",
    "rangedWeapons": [
        {
            "name": "Mechanicus pistol",
            "modifiers": [
                "devastating wounds",
                "pistol"
            ],
            "range": 12,
            "strength": 6,
            "attacks": 1,
            "ballistic-skills": 3,
            "armor-penetration": 1,
            "damage": 1,
            "singleChoice": false
        }
    ],
    "abilities": {
        "core": [
            "Leader"
        ],
        "faction": [],
        "otherAbilities": [
            {
                "name": "Battle Protocols",
                "description": "At the start of the battle, if this model is leading a <strong>KASTELAN ROBOTS</strong> unit, that unit enters Aegis Protocols (see below). In your Command phase, if this model is leading a <strong>KASTELAN ROBOTS</strong> unit, you can select one protocol from those listed below for that unit to enter. Once a unit enters a protocol, it remains in that protocol until it enters a different one.</p> <li><strong>Protector Protocol:</strong> Add 2 to the Attacks characteristic of ranged weapons equipped by <strong>KASTELAN ROBOT</strong> models in that unit.</li> <li><strong>Conqueror Protocol:</strong> Add 2 to the Attacks characteristic of melee weapons equipped by <strong>KASTELAN ROBOT</strong> models in that unit.</li> <li><strong>Aegis Protocol:</strong> Add 1 to the Toughness characteristic of <strong>KASTELAN ROBOT</strong> models in that unit.</li>"
            }
        ]
    },
    "options": [
        {
            "count": [
                1
            ],
            "points": 35
        }
    ],
    "unitComposition": [
        {
            "unitType": "Cybernetica Datasmith",
            "minQuantity": 1,
            "maxQuantity": 1,
            "equipment": [
                "Mechanicus pistol",
                "power fist"
            ]
        }
    ],
    "additionalParameter": {},
    "wargear": [],
    "meleeWeapons": [
        {
            "name": "Power fist",
            "attacks": 2,
            "weapons-skills": 3,
            "strength": 8,
            "armor-penetration": 2,
            "damage": 2,
            "modifiers": []
        }
    ]
}