{
    "detachmentName": "Chaos Cult",
    "detachmentRule": [
        {
            "name": "Desperate Devotion",
            "lore": "Utterly dedicated to the worship and dark rituals of the Ruinous Powers, these cultists throw themselves into battle with reckless abandon, driven by the hope of earning their dark gods' favor.",
            "description": "<p>Each time a DAMNED unit from your army makes an attack, re-roll a Wound roll of 1.<br>Each time a model in a DAMNED unit from your army would lose a wound as a result of a mortal wound, roll one D6: on a 5+, that wound is not lost.</p>"
        }
    ],
    "enhacements": [
        {
            "name": "Cultist's Brand",
            "lore": "The masters of heretic cults are given to branding their underlings with arcane sigils of command.",
            "description": "DARK APOSTLE or DAMNED model only. If every other model in the bearer’s unit (excluding Dark Disciples) is DAMNED, you can re-roll Advance and Charge rolls made for the bearer’s unit.",
            "points":20
        },
        {
            "name": "Amulet of Tainted Vigour",
            "lore": "Continuing the noisome energy of Human sacrifices, this icon grants new life to the fallen.",
            "description": "DARK APOSTLE model only. In your Command phase, you can return up to D3 destroyed DAMNED models (excluding CHARACTER models) to the bearer’s unit.",
            "points":20
        },
        {
            "name": "Incendiary Goad",
            "lore": "The bearer of this balefire-wreathed implement may use its burning wrath to incite their followers to acts of unholy aggression.",
            "description": "DARK APOSTLE or DAMNED model only. While the bearer is within range of an objective marker, melee weapons equipped by DAMNED models in the bearer’s unit have the [DEVASTATING WOUNDS] ability.",
            "points":15
        },
        {
            "name": "Warped Foresight",
            "lore": "The priesthood of the Chaos pantheon use their sorcerous gifts to reveal the future and position their followers accordingly.",
            "description": "DARK APOSTLE or DAMNED model only. The bearer has the Scouts 6\" ability.",
            "points":10
        }
    ],
    "stratagems": [
        [
            {
                "name": "Chosen for Glory",
                "subindex": "Battle Tactic Stratagem",
                "lore": "Within the massed ranks of a heretic cult, only a few are marked for greatness.",
                "when": "Your Shooting phase or the Fight phase.",
                "target": "One DAMNED unit from your army that has not been selected to shoot or fight this phase.",
                "effect": "Your unit can make a Desperate Pact. If it does, until the end of the phase, each time a model in your unit makes an attack, you can re-roll the Hit roll, and if your unit did not fail the resulting Leadership test when making that Desperate Pact, you can re-roll the Wound roll as well.",
                "cp": 1,
                "color": "green"
            },
            {
                "name": "Crazed Focus",
                "subindex": "Battle Tactic Stratagem",
                "lore": "Even in the grip of frothing madness, these heretics are murderous in the extreme.",
                "when": "Your Shooting phase.",
                "target": "One DAMNED unit from your army that has not been selected to shoot this phase.",
                "effect": "Your unit can make a Desperate Pact. If it does, until the end of the phase, each time a model in your unit makes an attack, improve the Armour Penetration characteristic of that attack by 1, and if your unit did not fail the resulting Leadership test when making that Desperate Pact, improve the Strength characteristic of that attack by 1 as well.",
                "cp": 1,
                "color": "blue"
            },
            {
                "name": "Selfless Demise",
                "subindex": "Strategic Ploy Stratagem",
                "lore": "The zealous followers of the Dark Gods are devoted to the last. As death comes they strike a desperate final blow in hope of reward.",
                "when": "Fight phase, just after an enemy unit has selected its targets.",
                "target": "One DAMNED unit from your army that was selected as the target of one or more of the attacking unit's attacks.",
                "effect": "Until the attacking unit has resolved all of its attacks, each time a model in your unit is destroyed, roll one D6: on a 6, the attacking unit suffers 1 mortal wound after all of its attacks have been resolved.",
                "cp": 1,
                "color": "green"
            },
            {
                "name": "Reckless Haste",
                "subindex": "Strategic Ploy Stratagem",
                "lore": "Consumed by a desire to spill blood, these fanatical heretics hurl themselves towards the foe.",
                "when": "Your Charge phase.",
                "target": "One DAMNED unit from your army.",
                "effect": "Until the end of the turn, your unit is eligible to declare a charge in a turn in which it Advanced.",
                "cp": 1,
                "color": "blue"
            },
            {
                "name": "Infernal Sacrifice",
                "subindex": "Battle Tactic Stratagem",
                "lore": "Those in thrall to the Dark Gods will gladly sacrifice their lives to draw the eye of their darkling patrons.",
                "when": "Fight phase.",
                "target": "One DAMNED unit from your army that has not been selected to fight this phase.",
                "effect": "Your unit can make a Desperate Pact. If it does, your unit suffers D3 mortal wounds (in addition to any suffered for failing the resulting Leadership test), and until the end of the phase, add 1 to the Attacks characteristic of the melee weapons equipped by models in your unit, and if your unit did not fail the resulting Leadership test when making that Desperate Pact, until the end of the phase, improve the Strength characteristic of those weapons by 1 as well.",
                "cp": 1,
                "color": "green"
            },
            {
                "name": "Mortal Thralls",
                "subindex": "Strategic Ploy Stratagem",
                "lore": "Disciples of the Chaos Gods think nothing of sacrificing their lesser thralls to protect those of greater worth.",
                "when": "Your opponent's Shooting phase, just after an enemy unit has selected its targets.",
                "target": "One Heretic Astartes unit from your army that was selected as the target of one or more of the attacking unit's attacks, and one friendly DAMNED unit within 3\" of your unit and visible to both your unit and the attacking unit.",
                "effect": "Until the end of the phase, while your DAMNED unit is on the battlefield, each time your opponent would make a Wound roll for an attack that targets your Heretic Astartes unit, if your DAMNED unit is visible to the attacking model and is an eligible target for that attack, roll D6; on a 4+, instead, your DAMNED unit suffers a number of mortal wounds equal to the Damage characteristic of that attack.",
                "cp": 1,
                "color": "red"
            }
        ]
        
    ]
}
