{
    "detachmentName": "Deceptors",
    "detachmentRule": [
        {
            "name": "Masters of Misdirection",
            "lore": "These are those warbands that number amongst their ranks liars, schemers and infiltrators of rare and prodigious skill. They wage war through the shadows and the warp, misleading their enemies and forewarning their allies of impending threats. Such warriors are masters of sabotage and ambush, spreading disinformation and feeding misdirection to their foes and allies.",
            "description": "<p>In the Declare Battle Formations step, you can select a number of LEGIONARIES and CULTIST MOBS units from your army: until the end of the battle, those units and any CHARACTER units attached to them (excluding EPIC HEROES), have the Infiltrators ability. The maximum number of units you can select in this way depends on the battle size, as shown below.</p> <br/> <table class='min-w-full divide-y divide-gray-200'><thead class='bg-gray-50'><tr><th>Battle Size</th><th>Number of Units</th></tr></thead><tbody class='bg-white divide-y divide-gray-200'><tr><td>Incursion</td><td>Up to 2 units</td></tr><tr><td>Strike Force</td><td>Up to 3 units</td></tr><tr><td>Onslaught</td><td>Up to 4 units</td></tr></tbody></table>"
        }
    ],
    "enhacements": [
        {
            "name": "Falsehood",
            "lore": "This leader conceals their presence upon the battlefield.",
            "description": "CHAOS LORD model only (excluding TERMINATOR and JUMP PACK models). In the Declare Battle Formations step, you can set the bearer up in Reserves instead of setting it up on the battlefield. If you do, in the Reinforcement step at the end of your Movement phase, you can select one model in a friendly LEGIONARIES or CHOSEN unit that is on the battlefield (excluding Attached units). The selected model is destroyed (ignoring any rules that are triggered when a model is destroyed) and the bearer is set up as close as possible to where the model was destroyed and only within Engagement Range of any enemy units if the destroyed model was within Engagement Range of those units. The bearer now attaches to that unit as its Leader.",
            "points":10
        },
        {
            "name": "Cursed Fang",
            "lore": "This xenos weapon is perfect in the hands of assassins.",
            "description": "HERETIC ASTARTES INFANTRY model only. Improve the Armour Penetration characteristic of the bearer’s melee weapons by 1, and the bearer’s melee weapons have the [PRECISION] ability.",
            "points":10
        },
        {
            "name": "Shroud of Obfuscation",
            "lore": "Made from warp-beast skin, this cloak obscures all.",
            "description": "HERETIC ASTARTES INFANTRY model only. The bearer has the Stealth and Lone Operative abilities.",
            "points":15
        },
        {
            "name": "Soul Link",
            "lore": "With a whispered incantation this champion projects their consciousness into the body of a willing ally.",
            "description": "HERETIC ASTARTES INFANTRY model only. At the start of your Command phase, you can select one other HERETIC ASTARTES INFANTRY CHARACTER model from your army (excluding EPIC HEROES). Until the start of your next Command phase, the bearer gains that PSYKER keyword, and replace the bearer’s datasheet abilities with the datasheet abilities of the CHARACTER you selected.",
            "points":5
        }
    ]
    ,
    
    "stratagems": [
        {
            "name": "Detonator",
            "subindex": "Wargear Stratagem",
            "lore": "These warriors employ expert saboteurs who utilize melta charges and improvised explosives to sow devastation.",
            "when": "Fight phase, just after an enemy model with the Deadly Demise ability (excluding TITANIC units) is destroyed.",
            "target": "One HERETIC ASTARTES CHARACTER unit from your army that was within 18\" of that enemy model when it was destroyed.",
            "effect": "Your opponent does not roll to determine whether mortal wounds are inflicted by their model’s Deadly Demise ability. Instead, the number of mortal wounds automatically inflicted (if that ability inflicts a random number of mortal wounds, your opponent rolls to determine that number as normal).",
            "cp": 1
        },
        {
            "name": "From All Sides",
            "subindex": "Battle Tactic Stratagem",
            "lore": "When the assault comes, it does so swiftly and without warning.",
            "when": "Start of your Charge phase.",
            "target": "One HERETIC ASTARTES unit from your army.",
            "effect": "Until the end of the phase, add 1 to Charge rolls made for your unit for each other HERETIC ASTARTES unit from your army that made a Charge move this phase (to a maximum of +3).",
            "cp": 1
        },
        {
            "name": "Pick Them Off",
            "subindex": "Battle Tactic Stratagem",
            "lore": "The Heretic Astartes are pitiless reavers, slaughtering the enemy line with ruthless efficiency.",
            "when": "Your Shooting phase.",
            "target": "One HERETIC ASTARTES unit from your army that has not been selected to shoot this phase.",
            "effect": "Until the end of the phase, each time a model in your unit makes an attack that targets a unit below its Starting Strength, you can re-roll the Hit roll. If the target is below Half-strength, you can re-roll the Wound roll as well.",
            "cp": 1
        },
        {
            "name": "Coils of Deception",
            "subindex": "Strategic Ploy Stratagem",
            "lore": "Some Heretic Astartes are masters of deceit, often feigning retreat only to open fire as the foe gives chase.",
            "when": "Movement phase, just after a HERETIC ASTARTES unit from your army Falls Back.",
            "target": "One HERETIC ASTARTES unit from your army that Fell Back.",
            "effect": "Until the end of the turn, your unit is eligible to shoot in a turn in which it Fell Back.",
            "cp": 1
        },
        {
            "name": "Relentless Pursuit",
            "subindex": "Strategic Ploy Stratagem",
            "lore": "These warriors stalk their assigned target with unwavering focus, moving at speed with every move.",
            "when": "Your opponent’s Movement phase, just after an enemy unit ends a Normal, Advance or Fall Back move.",
            "target": "One HERETIC ASTARTES INFANTRY or HERETIC ASTARTES MOUNTED unit from your army that is within 9\" of that enemy unit and not within Engagement Range of one or more enemy units.",
            "effect": "Your unit can make a Normal move of up to 6\".",
            "cp": 1
        },
        {
            "name": "Scrambled Coordinates",
            "subindex": "Strategic Ploy Stratagem",
            "lore": "Employing fell techno-sorcery, the Heretic Astartes disrupt enemy navigational cogitators and scramble teleport beacons.",
            "when": "Start of the Reinforcements step of your opponent’s Movement phase.",
            "target": "One HERETIC ASTARTES unit from your army.",
            "effect": "Until the end of the phase, enemy units that are set up on the battlefield as Reinforcements cannot be set up within 12\" horizontally of your unit.",
            "cp": 1
        }
    ]
    }
    
