{
    "detachmentName": "Fellhammer Siege-Host",
    "detachmentRule": [
        {
            "name": "Iron Fortitude",
            "lore": "Implacable and resilient, the Heretic Astartes of the Fellhammer Siege-Host are known for their determination and unyielding defense. Their warriors withstand the fiercest of assaults, standing firm against the enemy’s most determined efforts.",
            "description": "<p>Each time a ranged attack targets a HERETIC ASTARTES unit from your army, if that attack’s Strength characteristic is greater than the Toughness characteristic of your unit, subtract 1 from the Wound roll.</p>"
        }
    ],
    "enhacements": [
        {
            "name": "Bastion Plate",
            "lore": "Despite the pits and dents that mar its surface, this suit of relic armor is as resilient as the walls of any grand fortress.",
            "description": "CHAOS LORD model only (excluding JUMP PACK models). Once per battle round, when a saving throw is failed for the bearer’s unit, you can change the Damage characteristic of that attack to 0.",
            "points":10
        },
        {
            "name": "Warp Tracer",
            "lore": "Crafted by the feared Warpsmith Kraalax, these shells leave a trail of warped reality, allowing a warp trace to be made through the strongest systems of Heretic Astartes.",
            "description": "HERETIC ASTARTES model only. In your Shooting phase, select one enemy unit hit by one or more of the bearer’s attacks. Until the end of the turn, those enemy units cannot have the Benefit of Cover.",
            "points":20
        },
        {
            "name": "Ironbound Enmity",
            "lore": "A reflection of his ironclad determination and pitiless hatred, the Heretic Astartes' wrath will not be abated by any fear or retreat from ironclad and rampant foes.",
            "description": "HERETIC ASTARTES model only. Each time the bearer makes an attack while within range of an objective marker, add 1 to the Wound roll.",
            "points":15
        },
        {
            "name": "Iron Artifice",
            "lore": "Forged by a Hellforge and wielded by a veteran of countless battles, the bearer’s weapons are particularly suited to breaching the toughest armor.",
            "description": "HERETIC ASTARTES INFANTRY model only. The bearer’s weapons have the [ANTI-INFANTRY 4+] and [ANTI-FORTIFICATION 4+] abilities.",
            "points":10
        }
    ],
    "stratagems": [
        {
            "name": "Persistent Assailants",
            "subindex": "Battle Tactic Stratagem",
            "lore": "These iron-willed warriors refuse to retreat, even in the face of overwhelming odds. Mounting losses serve only to drive them forward.",
            "when": "Fight phase.",
            "target": "One Heretic Astartes unit from your army that was selected as the target of one or more attacks this phase and has not been selected to fight this phase.",
            "effect": "Until the end of the phase, each time a model in your unit makes an attack, you can re-roll the Hit roll, and if your unit is Below Half-strength you can re-roll the Wound roll as well.",
            "cp": 1,
            "color": "green"
        },
        {
            "name": "Point-Blank Destruction",
            "subindex": "Battle Tactic Stratagem",
            "lore": "Even in the press of combat, the Heretic Astartes bring heavy weapons to bear, shattering fortifications and obliterating enemy infantry.",
            "when": "Your Shooting phase.",
            "target": "One Heretic Astartes unit from your army that is within Engagement Range of one or more enemy units and has not been selected to shoot this phase.",
            "effect": "Until the end of the phase, your unit's ranged weapons (excluding Blast weapons) have the [PISTOL] ability.",
            "cp": 1,
            "color": "blue"
        },
        {
            "name": "Brutal Attrition",
            "subindex": "Epic Deed Stratagem",
            "lore": "These implacable soldiers weather the enemy's fury before striking back in kind, to devastating effect.",
            "when": "Fight phase, just after an enemy unit has selected its targets.",
            "target": "One Heretic Astartes Infantry unit from your army (excluding DAMNED units) that was selected as the target of one or more of the attacking unit's attacks.",
            "effect": "Until the end of the phase, each time a melee attack is allocated to your unit, after the attacking unit has finished making its attacks, roll one D6 (to a maximum of six D6 per attacking unit); for each 4+, the attacking unit suffers 1 mortal wound.",
            "cp": 1,
            "color": "green"
        },
        {
            "name": "Steadfast Determination",
            "subindex": "Strategic Ploy Stratagem",
            "lore": "These warriors possess endless endurance and are capable of weathering untold hardships in order to destroy their foes.",
            "when": "Your opponent's Shooting phase, just after an enemy unit has selected its targets.",
            "target": "One Heretic Astartes unit from your army (excluding DAMNED units) that was selected as the target of one or more of the attacking unit's attacks.",
            "effect": "Until the end of the phase, models in your unit have the Feel No Pain 5+ ability.",
            "cp": 1,
            "color": "red"
        },
        {
            "name": "Pitiless Cannonade",
            "subindex": "Battle Tactic Stratagem",
            "lore": "These warriors focus their ire upon a wounded foe, combining fire to fell their target in a cavalcade of destructive force.",
            "when": "Your Shooting phase.",
            "target": "One Heretic Astartes unit from your army that has been selected to shoot this phase.",
            "effect": "Until the end of the phase, each time a model in your unit makes an attack that targets a unit that is Below Half-strength, a successful unmodified Hit roll of 5+ scores a Critical Hit.",
            "cp": 1,
            "color": "blue"
        },
        {
            "name": "Siegecraft",
            "subindex": "Strategic Ploy Stratagem",
            "lore": "Veterans of countless grinding sieges, these Heretic Astartes repel and pin down wave after wave of foes with rapid bolter fire and accurate artillery.",
            "when": "Start of your opponent's Charge phase.",
            "target": "One Heretic Astartes unit from your army.",
            "effect": "Until the end of the phase, each time an enemy unit selects your unit as a target of a charge, subtract 2 from the Charge roll (this is not cumulative with any other negative modifiers to that Charge roll).",
            "cp": 1,
            "color": "red"
        }
    ]
}
