{
    "detachmentName": "Pactbound Zealots",
    "detachmentRule": [
        {
            "name": "Marks of Chaos",
            "lore": "When mustering your army, when you select a HERETIC ASTARTES unit to include in your army, if that unit is not an EPIC HERO and does not already have one or more of the keywords listed below, you must select one of the keywords listed below for that unit to gain (note which units gain which keywords in this way on your Army Roster). Each time a unit with one of these keywords makes a Dark Pact, it gains the associated ability below until the end of the phase.",
            "description": "<p><strong>Khorne:</strong> Each time a model in this unit makes a melee attack, an unmodified Hit roll of 5+ scores a Critical Hit.<br><strong>Tzeentch:</strong> Each time a model in this unit makes a ranged attack, an unmodified Hit roll of 5+ scores a Critical Hit.<br><strong>Nurgle:</strong> Each time a model in this unit makes an attack, an unmodified Hit roll of 5+ scores a Critical Wound.<br><strong>Slaanesh:</strong> Each time a model in this unit makes an attack, you can re-roll the Hit roll.<br><strong>Chaos Undivided:</strong> Each time a model in this unit makes an attack, re-roll a Hit roll of 1.</p>"
        }
    ],
    "enhacements": [
        {
            "name": "Talisman of Burning Blood",
            "lore": "This crimson amulet radiates malice, granting its bearer but a sliver of Khorne’s boundless fury.",
            "description": "HERETIC ASTARTES KHORNE model only. Add 1 to the Attacks and Strength characteristics of the bearer’s melee weapons. Each time the bearer makes a melee attack, you can re-roll the resulting Leadership test. Roll one D3: until the end of the phase, add the result to the Attacks and Strength characteristics of the bearer’s melee weapons.",
            "points":15
        },
        {
            "name": "Eye of Tzeentch",
            "lore": "No secret is safe from Tzeentch’s searching gaze. To those who have his favour, priceless knowledge may be revealed.",
            "description": "HERETIC ASTARTES TZEENTCH model only. Each time the bearer’s unit makes a Dark Pact and does not fail the resulting Leadership test, if the result of that test was 8 or more, you gain 1CP.",
            "points":15
        },
        {
            "name": "Orbs of Unlife",
            "lore": "Nurgle’s malignance fortifies his chosen and bestows upon them the gift of terrible contagion.",
            "description": "HERETIC ASTARTES NURGLE model only. At the end of the Fight phase, roll one D6 for every enemy unit within 6\" of the bearer, adding 1 to the result if the bearer’s unit made a Dark Pact that phase and did not fail the resulting Leadership test: on a 4+, that enemy unit suffers D3 mortal wounds.",
            "points":15
        },
        {
            "name": "Intoxicating Elixir",
            "lore": "This intoxicating potion fortifies the imbiber and causes them to emit a toxic stench that drives foes to madness.",
            "description": "HERETIC ASTARTES SLAANESH model only. The bearer has the Feel No Pain 5+ ability. Each time the bearer shoots or fights, if the bearer’s unit made a Dark Pact this phase and did not fail the resulting Leadership test, after the bearer has resolved those attacks, select one enemy unit that was hit by one or more of those attacks; that enemy unit must take a Battle-shock test.",
            "points":15
        }
    ],
    "stratagems": [
        {
            "name": "Eye of the Gods",
            "subindex": "Epic Deed Stratagem",
            "lore": "The eyes of the Dark Gods fall upon those who slaughter in their name.",
            "when": "Fight phase, just after a Heretic Astartes Character unit from your army (excluding Damned, Daemon and Epic Hero units) destroys an enemy unit.",
            "target": "One Heretic Astartes Character model in that unit.",
            "effect": "Until the end of the battle, add 1 to the Move, Toughness and Wounds characteristics of that Character model, and add 1 to the Attacks, Strength and Damage characteristics of that Character model's melee weapons.",
            "cp": 1,
            "color": "green"
        },
        {
            "name": "Skinshift",
            "subindex": "Epic Deed Stratagem",
            "lore": "Those who offer praise to the God of Change may gain the benefits of his mutagenic powers.",
            "when": "Your Command phase.",
            "target": "One Heretic Astartes unit from your army.",
            "effect": "One model in your unit regains up to 3 lost wounds. In addition, if your unit is a Tzeentch unit and below its Starting Strength, one destroyed model (excluding Character models) is returned to your unit with its full wounds remaining.",
            "cp": 1,
            "color": "blue"
        },
        {
            "name": "Eternal Hate",
            "subindex": "Strategic Ploy Stratagem",
            "lore": "The Blood God's thirst can never be slaked.",
            "when": "Fight phase, just after an enemy unit has selected its targets.",
            "target": "One Heretic Astartes unit from your army that was selected as the target of one or more of the attacking unit's attacks.",
            "effect": "Until the end of the phase, each time a model in your unit is destroyed, if that model has not fought in this phase, roll one D6, adding 1 to the result if it is a Khorne unit: on a 4+, do not remove it from play. That destroyed model can fight after the attacking model's unit has finished making its attacks, and is then removed from play.",
            "cp": 1,
            "color": "green"
        },
        {
            "name": "Torpefying Refrain",
            "subindex": "Strategic Ploy Stratagem",
            "lore": "As these warriors traverse the battlefield, an unnatural symphony of hypnotic music accompanies their every move, stupefying their enemies.",
            "when": "Your Movement phase.",
            "target": "One Heretic Astartes unit from your army.",
            "effect": "Until the end of the turn, your unit is eligible to declare a charge in a turn in which it Fell Back. If your unit is a Slaanesh unit, until the end of the turn, your unit is eligible to shoot and declare a charge in a turn in which it Advanced or Fell Back.",
            "cp": 1,
            "color": "blue"
        },
        {
            "name": "Profane Zeal",
            "subindex": "Battle Tactic Stratagem",
            "lore": "Those Heretic Astartes sworn to the service of the Dark Gods display zeal through violence.",
            "when": "Your Shooting phase or the Fight phase.",
            "target": "One Heretic Astartes Chaos Undivided unit from your army that has not been selected to shoot or fight this phase.",
            "effect": "Until the end of the phase, each time a model in your unit makes an attack, you can re-roll the Wound roll.",
            "cp": 1,
            "color": "blue"
        },
        {
            "name": "Festering Miasma",
            "subindex": "Strategic Ploy Stratagem",
            "lore": "A roiling storm of warp energy obscures the Heretic Astartes, leaving their foes shooting at indistinct shadows.",
            "when": "Your opponent's Shooting phase, just after an enemy unit has selected its targets.",
            "target": "One Heretic Astartes unit from your army that was selected as the target of one or more of the attacking unit's attacks.",
            "effect": "Until the end of the phase, your unit has the Stealth ability. In addition, if your unit is a Nurgle unit, it can only be selected as the target of a ranged attack if the attacking model is within 18\".",
            "cp": 1,
            "color": "red"
        }
    ]
}
