{
    "detachmentName": "Renegade Raiders",
    "detachmentRule": [
        {
            "name": "Raiders and Reavers",
            "lore": "Some Heretic Astartes warbands are known for their swift, brutal assaults. These warriors strike from the shadows, employing guerrilla tactics and hit-and-run strategies to outmaneuver their enemies. With a focus on mobility and surprise, they can overwhelm even the most prepared foes.",
            "description": "<p>Ranged weapons equipped by HERETIC ASTARTES models from your army have the [ASSAULT] ability. In addition, each time a model in your army makes an attack that targets an enemy unit within range of an objective marker, improve the Armour Penetration characteristic of that attack by 1.</p>"
        }
    ],
    "enhacements": [
        {
            "name": "Despot's Claim",
            "lore": "This champion is a conqueror of worlds and will not rest until they have claimed their prize.",
            "description": "HERETIC ASTARTES model only. At the start of your Command phase, if the bearer is on the battlefield, roll one D6: adding 1 to the result if the bearer is wholly within 12\" of your opponent’s deployment zone: on a 5+, you gain 1CP.",
            "points":15
        },
        {
            "name": "Dread Reaver",
            "lore": "A crazed and violent fighter of great renown, this champion of Chaos is pitiless in the pursuit of plunder and infamy.",
            "description": "HERETIC ASTARTES model only. Each time the bearer makes a melee attack, if the bearer is wholly within 12\" of your opponent’s deployment zone, you can re-roll the Hit roll and you can re-roll the Wound roll.",
            "points":15
        },
        {
            "name": "Mark of the Hound",
            "lore": "This unit of warriors act as their master’s eyes and ears, seeking out targets of opportunity.",
            "description": "HERETIC ASTARTES model only. Models in the bearer’s unit have the [SCOUT 6\"] ability.",
            "points":25
        },
        {
            "name": "Tyrant's Lash",
            "lore": "Pain provides excellent motivation. The crack of this tyrant’s whip spurs his bond, driving the hesitant forwards with a vigour borne of anguish.",
            "description": "HERETIC ASTARTES model only. You can re-roll Advance rolls made for the bearer’s unit, and the bearer’s unit is eligible to shoot in a turn in which it Fell Back.",
            "points":20
        }
    ],
    "stratagems": [
        {
            "name": "unfailingly obdurate",
            "subindex": "battle tactic stratagem",
            "lore": "Such is their determination to claim their due that these warriors will gladly weather a storm of fire.",
            "when": "Your opponent's Shooting phase or the Fight phase, just after an enemy unit has selected its targets.",
            "target": "One HERETIC ASTARTES unit from your army (excluding DAMNED units) that was selected as the target of one or more of the attacking unit's attacks.",
            "effect": "Until the end of the phase, each time an attack targets your unit, worsen the Armour Penetration characteristic of that attack by 1.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "green"
        },
        {
            "name": "warpcharged engines",
            "subindex": "wargear stratagem",
            "lore": "The engines of this vehicle or construct crackle with the raw energies of the immaterium, propelling it forward at incredible speed.",
            "when": "Your Movement phase.",
            "target": "One HERETIC ASTARTES TRANSPORT or HERETIC ASTARTES MOUNTED unit from your army that has not been selected to move this phase.",
            "effect": "Until the end of the phase, if your unit Advances, do not make an Advance roll for it. Instead, until the end of the phase, add 6\" to the Move characteristic of models in your unit.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "blue"
        },
        {
            "name": "scour and seize",
            "subindex": "battle tactic stratagem",
            "lore": "If the bounty is to be claimed, the foe must first be purged.",
            "when": "Fight phase.",
            "target": "One HERETIC ASTARTES unit from your army that has not been selected to fight this phase.",
            "effect": "Until the end of the phase, each time a model in your unit makes an attack that targets a unit within range of an objective marker, that attack has the [PRECISION] ability.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "green"
        },
        {
            "name": "ruinous raid",
            "subindex": "battle tactic stratagem",
            "lore": "Utilising their swift transports, these ravagers plunge through the enemy lines to assault key positions.",
            "when": "Your Shooting phase or your Fight phase.",
            "target": "One HERETIC ASTARTES unit from your army that disembarked from a TRANSPORT this turn and has not been selected to shoot or fight this phase.",
            "effect": "Until the end of the phase, each time a model in your unit makes an attack, if the target of that attack is within range of an objective marker, you can re-roll the Hit roll and you can re-roll the Wound roll.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "blue"
        },
        {
            "name": "opportunistic raiders",
            "subindex": "strategic ploy stratagem",
            "lore": "Mobility is the key to victory. These Heretic Astartes ride outmaneuver and outflank the foe in order to achieve victory.",
            "when": "End of the Fight phase.",
            "target": "One HERETIC ASTARTES unit from your army that was eligible to fight this phase.",
            "effect": "If your unit is not within Engagement Range of one or more enemy units, it can make a Normal move of up to 6\", or up to 12\" if it is a MOUNTED unit. Otherwise, your unit can make a Fall Back move. It cannot embark within a TRANSPORT at the end of this move if it disembarked from a TRANSPORT this turn.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "blue"
        },
        {
            "name": "reavers' haste",
            "subindex": "strategic ploy stratagem",
            "lore": "The prospect of riches spurs these renegade warriors forwards. Woe betide any in their path.",
            "when": "Your Charge phase.",
            "target": "One HERETIC ASTARTES INFANTRY or HERETIC ASTARTES MOUNTED unit from your army.",
            "effect": "Until the end of the phase, your unit is eligible to declare a charge in a turn in which it Advanced. If you select one or more units within range of an objective marker as a target of that charge, add 1 to the Charge roll.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "blue"
        }
    ]
}
