{
    "detachmentName": "slaves to darkness",
    "detachmentRule": [
        {
            "name": "marks of chaos",
            "lore": "",
            "description": "<p>When mustering your army, each time you select a <strong>HERETIC ASTARTES</strong> unit to include in your army, if that unit is not an <strong>EPIC HERO</strong> and does not already have one or more of the keywords listed below, you must select one of the keywords listed below for that unit to gain (note which units gain which keywords in this way on your Army Roster). Each time a unit with one of these keywords makes a Dark Pact, it gains the associated ability below until the end of the phase.</p> <br/>                                                                       <div class= 'grid grid-cols-3'>  <div class='bg-zinc-200 border-solid border-2 my-2 border-white flex justify-center col-span-1'> <strong> Khorne </strong> </div> <div class='flex justify-center my-2  col-span-2 pl-2'><p> <strong>Blood Fury: </strong>In the Fight phase, if this unit’s weapons gained the [LETHAL HITS] ability this phase as the result of a Dark Pact, each time a model in this unit makes an attack, an unmodified Hit roll of 5+ scores a Critical Hit.</p> </div>                <div class='bg-zinc-200 border-solid border-2 my-2 border-white flex justify-center col-span-1'> <strong> Tzeentch  </strong> </div> <div class='flex justify-center my-2  col-span-2 pl-2'> <p><strong>Warpfire: </strong> In the Shooting phase, if this unit’s weapons gained the [LETHAL HITS] ability this phase as the result of a Dark Pact, each time a model in this unit makes an attack, an unmodified Hit roll of 5+ scores a Critical Hit.</p> </div>                             <div class='bg-zinc-200 border-solid border-2 my-2 border-white flex justify-center col-span-1'> <strong> Nurgle  </strong> </div> <div class='flex justify-center my-2  col-span-2 pl-2'> <p><strong> Spreading Sickness: </strong>In the Shooting phase, if this unit’s weapons gained the [SUSTAINED HITS 1] ability this phase as the result of a Dark Pact, each time a model in this unit makes an attack, an unmodified Hit roll of 5+ scores a Critical Hit. </p>   </div>   <div class='bg-zinc-200 border-solid border-2 my-2 border-white flex justify-center col-span-1'> <strong> Slaanesh  </strong> </div> <div class='flex justify-center my-2  col-span-2 pl-2'> <span><strong> Excessive Cruelty:</strong> In the Fight phase, if this unit’s weapons gained the [SUSTAINED HITS 1] ability this phase as the result of a Dark Pact, each time a model in this unit makes an attack, an unmodified Hit roll of 5+ scores a Critical Hit. </div>    <div class='bg-zinc-200 border-solid border-2 my-2 border-white flex justify-center col-span-1'> <strong> Chaos Undivided  </strong> </div> <div class=' my-2  col-span-2 pl-2'>  <p><strong>Glory to Chaos:</strong> Each time a model in this unit makes an attack, re-roll a Hit roll of 1.</p> </div>      </div>   "
        }
    ],
    "enhacements": [
        {
            "name": "Eye of Tzeentch",
            "points": 40,
            "lore": "The Eye of Tzeentch is a relic that has been exposed to wild psychic energies for ten millennia. Champions who stare into the artefact’s unblinking depths can glean the secrets of the warp.",
            "description": "HERETIC ASTARTES TZEENTCH model only. Each time the bearer’s unit makes a Dark Pact, take a Leadership test for the bearer: if that test is passed, you gain 1CP."
        },
        {
            "name": "Intoxicating Elixir",
            "points": 15,
            "lore": "This dispenser is filled with a self-replenishing liquid that is pumped into the bearer’s bloodstream by the pint. Some say the liquid, which grants those that partake of it unholy physical power, is a nectar distilled from Slaanesh’s own pleasure gardens, for while it heightens the bearer’s abilities, foes caught in its soporific fumes are paralysed with terror and ecstasy.",
            "description": "HERETIC ASTARTES SLAANESH model only. The bearer has the Feel No Pain 5+ ability. Each time the bearer shoots or fights, if the bearer’s unit made a Dark Pact this phase, after the bearer has resolved those attacks, select one enemy unit that was hit by one or more of those attacks; that enemy unit must take a Battle-shock test."
        },
        {
            "name": "Liber Hereticus",
            "points": 40,
            "lore": "This cursed tome contains forbidden lore said to have been absorbed while the artefact consumed the minds of those who risked reading it. One with the strength to tame it can use it to empower their rituals.",
            "description": "HERETIC ASTARTES CHAOS UNDIVIDED model only. Each time the bearer’s unit makes a Dark Pact, that unit’s weapons gain the [LETHAL HITS] and [SUSTAINED HITS 1] ability until the end of the phase, instead of just gaining one of those abilities."
        },
        {
            "name": "Orbs of Unlife",
            "points": 25,
            "lore": "Within these glassy spheres lurks a diluted life-eater virus. Although quick to burn out when the sphere is broken, everything nearby not touched by Nurgle’s bountiful blessings – flesh, armour and bone – finds itself consumed by the ravaging viral strain...",
            "description": "HERETIC ASTARTES NURGLE model only. At the end of the Fight phase, roll one D6 for every enemy unit within 6\" of the bearer, adding 1 to the result if the bearer’s unit made a Dark Pact that phase: on a 4+, that enemy unit suffers D3 mortal wounds."
        },
        {
            "name": "Talisman of Burning Blood",
            "points": 20,
            "lore": "This talisman constantly drips with thick, bubbling gore. The air around it is so heavy with the charnel stench of the slaughterhouse that it imbues the bearer’s limbs with supernatural ferocity and strength – a welcome boon to those eager to claim the worthiest skulls for Khorne.",
            "description": "HERETIC ASTARTES KHORNE model only. Add 1 to the Attacks and Strength characteristics of the bearer’s melee weapons. Each time the bearer’s unit makes a Dark Pact, until the end of the phase, add D3 to the Attacks and Strength characteristics of the bearer’s melee weapons instead."
        }
    ]
    ,
    
        "stratagems": [
            {
                "name": "infernal rites",
                "subindex": "Battle Tactic Stratagem",
                "lore": "With gruesome offerings and ritualised promises, the Chaos Space Marines seek the protection of their infernal masters.",
                "when": "Your opponent’s Shooting phase or the Fight phase, just after an enemy unit has selected its targets.",
                "target": "One HERETIC ASTARTES unit from your army that was selected as the target of one or more of the attacking unit’s attacks.",
                "effect": "Until the end of the phase, each time an attack targets your unit, worsen the Armour Penetration characteristic of that attack by 1.",
                "cp": 2,
                "color": "green"
            },
            {
                "name": "profane zeal",
                "subindex": "Battle Tactic Stratagem",
                "lore": "Fervent mortal followers flock to the champions of Chaos, damning their souls seeking promises of dark power.",
                "when": "Your Shooting phase or the Fight phase.",
                "target": "One HERETIC ASTARTES CHAOS UNDIVIDED unit from your army that has not been selected to shoot or fight this phase.",
                "effect": "Until the end of the phase, each time a model in your unit makes an attack, you can re-roll the Wound roll.",
                "cp": 1,
                "color": "green"
            },
            {
                "name": "eternal hate",
                "subindex": "Strategic Ploy Stratagem",
                "lore": "Heretic Astartes are fuelled by hate, a searing spite that burns fiercely within them unto the very moment of death. Even as their life force pours from terrible wounds, this loathing can drive them to fight on in a second wind of wrath. Those Heretic Astartes in thrall to the Blood God feel this enmity to an even greater extent than others, exploding with violence just as the enemy think they have finally ended them.",
                "when": "Fight phase, just after an enemy unit has selected its targets.",
                "target": "One HERETIC ASTARTES unit from your army that was selected as the target of one or more of the attacking unit’s attacks.",
                "effect": "Until the end of the phase, each time a model in your unit is destroyed, if that model has not fought this phase, roll one D6, adding 1 to the result if it is a KHORNE unit: on a 4+, do not remove it from play. That destroyed model can fight after the attacking model’s unit has finished making its attacks, and is then removed from play.",
                "cp": 1,
                "color": "green"
            },
            {
                "name": "skinshift",
                "subindex": "Epic Deed Stratagem",
                "lore": "With the Dark Gods and the powers of the warp on their side, Chaos Space Marines can cheat death altogether. Their foes look on in horror as killing wounds knit themselves together in a cacophony of hideous cracks and squelches and shattered armour reforms. After such a blessing, the Heretic Astartes are both something far greater, and far less, than what they once were.",
                "when": "Your Command phase.",
                "target": "One HERETIC ASTARTES unit from your army.",
                "effect": "One model in your unit regains up to 3 lost wounds. In addition, if your unit is a TZEENTCH unit below its Starting Strength, one destroyed model (excluding CHARACTER models) is returned to your unit with its full wounds remaining.",
                "cp": 1,
                "color": "blue"
            },
            {
                "name": "unnatural swiftness",
                "subindex": "Strategic Ploy Stratagem",
                "lore": "Some Heretic Astartes appear to move with a speed that should be impossible, weapons and bodies seemingly moving from one place to another in the blink of an eye.",
                "when": "Your Movement phase.",
                "target": "One HERETIC ASTARTES unit from your army.",
                "effect": "Until the end of the turn, your unit is eligible to shoot and declare a charge in a turn in which it Fell Back. In addition, if your unit is a SLAANESH unit, until the end of the turn, your unit is eligible to shoot and declare a charge in a turn in which it Advanced.",
                "cp": 1,
                "color": "blue"
            },
            {
                "name": "dark obscuration",
                "subindex": "Strategic Ploy Stratagem",
                "lore": "Choking fogs echoing with the screams of tortured souls; dense clouds of bloated flies; deluges of bloody rain; whirlwinds of coruscating flames blazing in a thousand hues. Such warp-born phenomena can appear on the battlefield in an instant, and disappear just as quickly. All serve to obscure the Heretic Astartes from their terrified foes.",
                "when": "Your opponent’s Shooting phase, just after an enemy unit has selected its targets.",
                "target": "One HERETIC ASTARTES unit from your army that was selected as the target of one or more of the attacking unit’s attacks.",
                "effect": "Until the end of the phase, your unit has the Stealth ability. In addition, if your unit is a NURGLE unit, until the end of the phase, your unit can only be selected as the target of a ranged attack if the attacking model is within 18\".",
                "cp": 1,
                "color": "red"
            }
        ]
    }
    
