{
    "detachmentName": "Soulforged Warpack",
    "detachmentRule": [
        {
            "name": "Debt to the Soul Forge",
            "lore": "Many are the Heretic Astartes who have forged pacts with the infernal forges of the Dark Mechanicum. Once bound, these warriors and their war engines fight with unholy strength, their souls driven to annihilate all with the desperation of the damned.",
            "description": "<p>Each time a HERETIC ASTARTES DAEMON VEHICLE model from your army makes a Dark Pact, if it is within Engagement Range of one or more enemy units, it does not suffer mortal wounds from that Dark Pact, and each time it makes an attack, add 1 to the Hit roll. <br> Each time a model in that unit makes a melee attack, add 1 to the Wound roll.<br> Add 2 to the Attacks characteristics of melee weapons equipped by models in that unit.</p>"
        }
    ],
    "enhacements": [
        {
            "name": "Invigorated Mechadendrills",
            "lore": "Suffused with warp power, the bearer’s mechadendrills undulate with unsettling certainty, propelling them forwards with unnatural speed.",
            "description": "WARPSMITH model only. Add 1\" to the bearer’s Move characteristic."
        },
        {
            "name": "Tempting Addendum",
            "lore": "The Arkifane’s contracts are malleable by design. More power can be offered should the supplicant be willing to bear the debt in souls.",
            "description": "HERETIC ASTARTES model only. Each time a HERETIC ASTARTES DAEMON VEHICLE unit from your army invokes its Oath twice within 3\" of the bearer:<br> If it suffers one or more mortal wounds as a result of that Dark Pact, add 1 to the number of mortal wounds it suffers.<br> Until the end of the phase, each time a model in that unit makes an attack, you can re-roll the Hit roll."
        },
        {
            "name": "Forge's Blessing",
            "lore": "Such is this warrior’s mastery of techno-sorcery, that they may temper armour with but a gesture.",
            "description": "HERETIC ASTARTES model only. In your Command phase, select one friendly HERETIC ASTARTES VEHICLE unit within 12\" of the bearer. Until the start of your next Command phase, that unit has the Feel No Pain 6+ ability."
        },
        {
            "name": "Soul Harvester",
            "lore": "To stoke the fires of a daemonic forge requires a bounty of souls. Thus do the Warpsmiths and their allies undertake a never-ending harvest.",
            "description": "HERETIC ASTARTES model only. While the bearer is on the battlefield, each time an enemy unit within 12\" of the bearer is destroyed, roll one D6: on a 5+, you gain 1CP."
        }
    ],
    "stratagems": [
        {
            "name": "Desperate Pledge",
            "subindex": "Battle Tactic Stratagem",
            "lore": "A daemonic pact may beseech the Arkifane for further aid, though the cost is often far greater than anticipated.",
            "when": "Shooting phase.",
            "target": "One HERETIC ASTARTES DAEMON VEHICLE unit from your army that has not been selected to shoot or fight this phase.",
            "effect": "Until the end of the phase, if your unit invokes its Oath twice this phase, improve the Armour Penetration characteristic of that attack by 1.",
            "cp": 1
        },
        {
            "name": "Glut of Souls",
            "subindex": "Strategic Ploy Stratagem",
            "lore": "With each soul harvested the bound daemon comes closer to exerting its control, and exerting freedom.",
            "when": "Fight phase.",
            "target": "One HERETIC ASTARTES DAEMON VEHICLE unit from your army that has not been selected to fight this phase.",
            "effect": "Until the end of the phase, if your unit invokes its Oath twice this phase, roll one D6: on a 5+, until the end of the phase, improve the Armour Penetration characteristic of that attack by 1 and add 1 to the Damage characteristic of that attack (to a maximum of +3).",
            "cp": 1
        },
        {
            "name": "Daemonic Possession",
            "subindex": "Epic Deed Stratagem",
            "lore": "Those steeped in techno-sorcery may torment the imprisoned daemon within the mechanical constructs to bring forth great rage.",
            "when": "Your Command phase.",
            "target": "One HERETIC ASTARTES VEHICLE unit from your army (excluding DAMNED units).",
            "effect": "Until the end of the battle, your unit has the DAEMON keyword.",
            "cp": 1
        },
        {
            "name": "Unstoppable Rampage",
            "subindex": "Strategic Ploy Stratagem",
            "lore": "When possessed by a bound daemon, the Heretic Astartes' war machines can be driven to bouts of unholy fury, crushing everything in their path.",
            "when": "Fight phase.",
            "target": "One HERETIC ASTARTES DAEMON VEHICLE unit from your army.",
            "effect": "Until the end of the phase, each time a model in your unit makes an attack, add 1 to the Hit roll and improve the Armour Penetration characteristic of that attack by 1.",
            "cp": 1
        },
        {
            "name": "Predatory Pursuit",
            "subindex": "Strategic Ploy Stratagem",
            "lore": "Compelled forwards, Heretic Astartes war engines pursue their prey with relentless determination, never resting until their foes are torn apart.",
            "when": "Your Movement phase.",
            "target": "One HERETIC ASTARTES VEHICLE unit from your army.",
            "effect": "Your unit can make a Normal move of up to 6\", but must end that move as close as possible to the nearest enemy unit.",
            "cp": 1
        },
        {
            "name": "Feeding Frenzy",
            "subindex": "Strategic Ploy Stratagem",
            "lore": "Soulforged war engines that prey upon their foes seek to devour and shred, fueled by the unholy powers within them.",
            "when": "Fight phase.",
            "target": "One HERETIC ASTARTES DAEMON VEHICLE unit from your army that has not been selected to fight this phase.",
            "effect": "Until the end of the phase, each time a model in your unit makes an attack that targets an enemy unit below its Starting Strength, you can re-roll the Hit roll. If the target is below Half-strength, you can re-roll the Wound roll as well.",
            "cp": 1
        }
    ]
}
