{
    "detachmentName": "crusher stampede",
    "detachmentRule": [
        {
            "name": "enraged behemoths",
            "lore": "In their efforts to lay the monstrous beasts of a Crusher Stampede low, the prey only succeed in further enraging the rampaging monsters. The surviving beasts are driven to fight with greater fury the more of their number that fall.",
            "description": "Each time a TYRANIDS MONSTER model from your army makes an attack, add 1 to the Hit roll if that model’s unit is below its Starting Strength, and add 1 to the Wound roll as well if that model’s unit is Below Half-strength."
        }
    ],
    "enhacements": [
        {
            "name": "Ominous Presence",
            "points": 15,
            "lore": "The crushing menace of the Hive Mind rolls off this monstrous creature in waves, causing it to loom even larger in the minds of its quailing prey and lending it absolute dominance of the battlefield.",
            "description": "TYRANIDS MONSTER model only. Add 3 to the bearer’s Objective Control characteristic."
        },
        {
            "name": "Enraged Reserves",
            "points": 20,
            "lore": "Contained deep within this organism’s body is a pulsating sac filled with a cocktail of adrenostimulant fluids linked to a ring of vascular-pneumatic sphincters, allowing them one last-ditch strike.",
            "description": "TYRANIDS MONSTER model only. If the bearer is destroyed by a melee attack, if it has not fought this phase, roll one D6: on a 3+, do not remove it from play. It can fight after the attacking model’s unit has finished making its attacks, and is then removed from play."
        },
        {
            "name": "Null Nodules",
            "points": 10,
            "lore": "A contraganglion knot in this creature’s cranium channels and amplifies the smothering power of the Shadow in the Warp to nullify its prey’s psychic abilities.",
            "description": "TYRANIDS MONSTER model only. Once per battle, when a Psychic Attack is allocated to the bearer, it can use this ability. If it does, until the end of the phase, the bearer has the Feel No Pain 5+ ability against Psychic Attacks."
        },
        {
            "name": "Monstrous Nemesis",
            "points": 25,
            "lore": "With its basic logic centres and instinctive drivers augmented, this warrior organism is capable of singling out and hunting down valuable prey without direct synaptic oversight.",
            "description": "TYRANIDS MONSTER model only. Each time the bearer makes a melee attack that targets a MONSTER or VEHICLE unit, add 1 to the Wound roll."
        }
    ],
    "stratagems":[
        {
            "name": "corrosive viscera",
            "subindex": "strategic ploy stratagem",
            "lore": "Highly acidic fluids spray from the creature’s wounds, lethal to those nearby.",
            "when": "Your opponent’s Shooting phase or the Fight phase, just after a TYRANIDS MONSTER model from your army with the Deadly Demise ability that cannot FLY is destroyed.",
            "target": "That TYRANIDS MONSTER model. You can use this Stratagem on that model even though it was just destroyed.",
            "effect": "Do not roll one D6 to determine whether mortal wounds are inflicted by your model’s Deadly Demise ability. Instead, mortal wounds are automatically inflicted.",
            "icon" : [""],
            "cp":1,
            "color":"green"
        },
        {
            "name": "rampaging monstrosities",
            "subindex": "battle tactic stratagem",
            "lore": "Tyranid monsters have reserves of energy that they unleash in waves of devastating fury.",
            "when": "Fight phase.",
            "target": "One TYRANIDS MONSTER unit from your army that has not been selected to fight this phase.",
            "effect": "Until the end of the phase, each time a model in your unit makes an attack, you can re-roll the Hit roll.",
            "icon" : [""],
            "cp":1,
            "color":"green"
        },
        {
            "name": "savage roar",
            "subindex": "battle tactic stratagem",
            "lore": "This monster is even more terrifying to behold than other bioforms of its kind.",
            "when": "Fight phase, just after an enemy unit has selected its targets.",
            "target": "One TYRANIDS MONSTER unit from your army that was selected as the target of one or more of the attacking unit’s attacks.",
            "effect": "That enemy unit must take a Battle-shock test and, until the end of the phase, each time a model in that enemy unit makes an attack that targets your unit, subtract 1 from the Hit roll. If that Battle-shock test was failed, subtract 1 from the Wound roll as well.",
            "icon" : [""],
            "cp":1,
            "color":"green"
        },
        {
            "name": "untrammelled ferocity",
            "subindex": "strategic ploy stratagem",
            "lore": "Encircling and entrapping such physically powerful and fearless beasts is nigh on impossible.",
            "when": "Your Movement phase.",
            "target": "One TYRANIDS MONSTER unit from your army that has not been selected to move this phase.",
            "effect": "Until the end of the phase, models in your unit can move through enemy models as if they were friendly models, and until the end of the phase any Desperate Escape tests those models must take are automatically passed.",
            "icon" : [""],
            "cp":1,
            "color":"blue"
        },
        {
            "name": "swarm-guided salvoes",
            "subindex": "battle tactic stratagem",
            "lore": "One cannot hide from a gestalt entity with a million eyes, even in the densest cover.",
            "when": "Your Shooting phase.",
            "target": "One TYRANIDS MONSTER unit from your army that has not been selected to shoot this phase.",
            "effect": "Until the end of the phase, ranged weapons equipped by models in your unit have the [IGNORES COVER] ability, and until the end of the phase each time a model in your unit makes an attack, you can ignore any or all modifiers to that model’s Ballistic Skill characteristic and any or all modifiers to the Hit roll.",
            
            "icon" : [""],
            "cp":1,
            "color":"blue"
        },
        {
            "name": "massive impact",
            "subindex": "epic deed stratagem",
            "lore": "Employing their sheer bulk and vicious chitinous horns and spikes, the largest Tyranids crash headlong through the foe, often with devastating results.",
            "when": "Your Charge phase, just after a TYRANIDS MONSTER model from your army ends a Charge move.",
            "target": "That TYRANIDS MONSTER model.",
            "effect": "Select one enemy unit within Engagement Range of your model and roll six D6: for each 4+, that enemy unit suffers 1 mortal wound.",
            "icon" : [""],
            "cp":1,
            "color":"blue"
        }
    ]

}