{
    "detachmentName": "assimilation swarm",
    "detachmentRule": [
        {
            "name": "feed the swarm",
            "lore": "Even as the beasts of the Assimilation Swarm stalk across the battlefield they make use of the abundant biomass yielded up by the prey worlds slow demise. Warrior organisms heal even the most grievous wounds in moments, or stagger upright and return to the fight after they seemed slain. A strain of revolting vitality flows through the Tyranid broods as though leeched direct from their dismayed victims.",
            "description": "In your Command phase, each HARVESTER unit from your army that is within range of an objective marker you control can Regenerate one friendly TYRANIDS unit that is within 6'' of it. A unit can only be regenerated once per phase. Each time a unit regenerates, do one of the following:"
        }
    ],
    "enhacements": [
        {
            "name": "Regenerating Monstrosity",
            "points": 20,
            "lore": "This nightmarish creature seems virtually unkillable, its every hurt healing in moments as it guzzles down the hunks of bubbling biomatter that were once foes.",
            "description": "TYRANIDS model only (excluding MONSTERS models). The bearer’s unit can be regenerated up to twice per phase, instead of once."
        },
        {
            "name": "Instinctive defence",
            "points": 15,
            "lore": "The swarm’s warrior organisms fight with instinctive and single-minded ferocity to protect the all-devouring organisms in their midst.",
            "description": "TYRANIDS model only. While the bearer is within 6'' of one or more friendly HARVESTER units, you can target the bearer’s unit with the Heroic Intervention Stratagem for 0CP. In addition, while the bearer is within 6'' of one or more friendly HARVESTER units, models in the bearer’s unit have the Fights First ability."
        },
        {
            "name": "Biophagic Flow (Aura)",
            "points": 10,
            "lore": "Parasitised biomass and revivifying fluids flow through the Assimilation Swarm like lifeblood.",
            "description": "TYRANIDS model only. While a friendly HARVESTER model is within 12'' of the bearer, when using the Feed the Swarm ability, that HARVESTER model can Regenerate one friendly TYRANIDS unit that is within 9'' of it, instead of one within 6''."
        },
        {
            "name": "Parasitic Biomorphology",
            "points": 25,
            "lore": "These warrior organisms boast additional fanged maws, jabbing probosci and haemophagic membranes that consume the fluids of their prey.",
            "description": "TYRANIDS model only. Add 1 to the Strength characteristic of melee weapons equipped by models in the bearer’s unit. The first time the bearer’s unit destroys an enemy unit in the Fight phase while the bearer is within 6'' of one or more friendly HARVESTER units, until the end of the battle, add 1 to the Attacks characteristic of melee weapons equipped by models in the bearer’s unit."
        }
    ],
    "stratagems":[
        {
            "name": "bloodguard impulse",
            "subindex": "epic deed stratagem",
            "lore": "Should a foe successfully slay one of the swarm’s assimilation organisms, they only mark themselves as a priority for predation and consumption in turn..",
            "when": "Any phase.",
            "target": "One HARVESTER unit from your army that was just destroyed. You can use this Stratagem on that unit even though it was just destroyed.",
            "effect": "Until the end of the battle, each time a friendly TYRANIDS model makes an attack that targets the enemy unit that just destroyed your HARVESTER unit, add 1 to the Wound roll.",
            "icon" : [""],
            "cp":1,
            "color":"green"
        },
        {
            "name": "reclaim biomass",
            "subindex": "strategic ploy stratagem",
            "lore": "Dead Tyranids are consumed and reconstituted by the swarm just as readily as the lifeless carcasses of their prey.",
            "when": "Any phase, when a TYRANIDS unit from your army is destroyed, before the last model in it is removed from play.",
            "target": "One HARVESTER unit from your army that is within 6'' of that destroyed unit.",
            "effect": "Regenerate one friendly TYRANIDS unit within 6'' of your HARVESTER unit (See Feed the Swarm).",
            "icon" : [""],
            "cp":1,
            "color":"green"
        },
        {
            "name": "tyrannoformed",
            "subindex": "strategic ploy stratagem",
            "lore": "Swarms of diminutive Tyranid phage organisms carpet even the most vital strategic assets, steadily breaking them down for assimilation.",
            "when": " Command phase.",
            "target": "One HARVESTER unit from your army that is within range of an objective marker you control.",
            "effect": "That objective marker remains under your control, even if you have no models within range of it, until your opponent controls it at the start or end of any turn.",
            "icon" : [""],
            "cp":1,
            "color":"green"
        },
        {
            "name": "ablative carapace",
            "subindex": "epic deed stratagem",
            "lore": "Your opponent’s Shooting phase or the Fight phase, just after an enemy unit has selected its targets.",
            "when": "Your Movement phase.",
            "target": "One HARVESTER unit from your army that was selected as the target of one or more of the attacking unit’s attacks.",
            "effect": "Until the end of the phase, models in your unit have the Feel No Pain 5+ ability. If your unit is within range of an objective marker you control, until the end of the phase models in your unit have the Feel No Pain 4+ ability instead.",
            "icon" : [""],
            "cp":2,
            "color":"blue"
        },
        {
            "name": "secure biomass",
            "subindex": "strategic ploy stratagem",
            "lore": "When rich sources of biomass are identified the warrior organisms of this swarm will stop at nothing to destroy resistance and claim them.",
            "when": "Fight phase.",
            "target": "One TYRANIDS unit from your army that has not been selected to fight this phase.",
            "effect": "Until the end of the phase, melee weapons equipped by models in your unit have the [LETHAL HITS] ability. If your unit is a HARVESTER unit, each time a model in that unit makes a melee attack, a successful unmodified Hit roll of 5+ scores a Critical Hit as well.",
            
            "icon" : [""],
            "cp":1,
            "color":"blue"
        },
        {
            "name": "rapacious hunger",
            "subindex": "battle tactic stratagem",
            "lore": "The hunger of the Tyranids can never be satiated.",
            "when": "Your Fight phase.",
            "target": "One TYRANIDS unit from your army that just destroyed an enemy unit.",
            "effect": "Your unit immediately Regenerates (See Feed the Swarm). When doing so, if your unit is a HARVESTER unit and you choose for one model to regain up to D3 lost wounds, that model regains up to 3 lost wounds instead.",
            "icon" : [""],
            "cp":1,
            "color":"blue"
        }
    ]

}