{
    "detachmentName": "synaptic nexus",
    "detachmentRule": [
        {
            "name": "synaptic imperatives",
            "lore": "The leader-beasts of these swarms act as conduits to the will of the Hive Mind. Irresistible imperatives lash out from them like whips that drive lesser bioforms to hurl themselves at the prey, to fight on through fatal wounds or to attack with redoubled savagery.",
            "description": "At the start of the battle round, you can select one of the Synaptic Imperatives shown below. Until the end of the battle round, that Synaptic Imperative is active for your army and while a TYRANIDS unit from your army is within Synapse Range of your army, it will benefit from it. Each Synaptic Imperative can only be selected once per battle. <br/> <br/> <strong>Synaptic Augmentation </strong><br/>  <p> While this unit is within Synapse Range of your army, models in this unit have a 5+ invulnerable save </p>    <br/> <strong> Surging Vitality </strong><br/>  <p> While this unit is within Synapse Range of your army, add 1 to Advance and Charge rolls made for this unit. </p>   <br/> <strong> Goaded to Slaughter </strong><br/>  <p> While this unit is within Synapse Range of your army, each time a model in this unit makes a melee attack, add 1 to the Hit roll. </p>  "
        }
    ],
    "enhacements": [
        {
            "name": "Power of the Hive Mind",
            "points": 10,
            "lore": "The Hive Mind channels lethal energy through its synaptic bioforms.",
            "description": "TYRANIDS PSYKER model only. Improve the Strength and Armour Penetration characteristics of psychic weapons equipped by the bearer by 1."
        },
        {
            "name": "Psychostatic Disruption",
            "points": 30,
            "lore": "A maelstrom of psychostatic disruption boils about this bioform. It degrades artificial and biological cognition alike, causing teleport signals to fluctuate, geopositioning cogitators to spew contradictory data, and onrushing enemy warriors to reel in confusion.",
            "description": "TYRANIDS SYNAPSE model only. Enemy units that arrive on the battlefield from Reserves cannot be set up within 12'' of the bearer. In addition, once per battle, during the first or second battle round, when your opponent declares that a unit will arrive on the battlefield from Strategic Reserves, the bearer can use this Enhancement. If it does, roll one D6: on a 4+, that enemy unit cannot arrive on the battlefield this turn."
        },
        {
            "name": "Synaptic Control",
            "points": 20,
            "lore": "The Hive Mind’s synaptic network is so strong that even the mangled remains of mortally wounded beasts can be compelled to fight on.",
            "description": "TYRANIDS SYNAPSE model only. Each time an attack is allocated to the bearer, subtract 1 from the Damage characteristic of that attack."
        },
        {
            "name": "The Dirgeheart of Kharis (Aura)",
            "points": 15,
            "lore": "This grotesque biomorphic symbiote buries itself in its hosts thorax and emits a droning psychic note. The longer prey are exposed to the sound, the worse their atavistic terror response becomes...",
            "description": "TYRANIDS SYNAPSE model only. While an enemy unit is within 9'' of the bearer, worsen that units Leadership characteristic by 1."
        }
    ],
    "stratagems": [
        {
            "name": "the smothering shadow",
            "subindex": "strategic ploy stratagem",
            "lore": "In the heart of the swarms, the Shadow in the Warp can literally kill with its smothering power.",
            "when": "Any phase, just after an enemy unit fails a Battle-shock test.",
            "target": " One SYNAPSE unit from your army within 12'' of that enemy unit.",
            "effect": "Roll six D6: for each 3+, that enemy unit suffers 1 mortal wound.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "green"
        },
        {
            "name": "synaptic channelling",
            "subindex": "battle tactic stratagem",
            "lore": "Tyranids are one with the Hive Mind; individuality is a disadvantage that they surpass.",
            "when": "Command phase.",
            "target": "One SYNAPSE unit from your army.",
            "effect": "Until the end of the turn, while a friendly TYRANIDS unit is within 9'' of the selected unit, that unit is within Synapse Range of your army.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "green"
        },
        {
            "name": "irrestible will",
            "subindex": "battle tactic stratagem",
            "lore": "Whether paralysing its prey or forcing them to stumble out of cover with its force of will, or else puppeteering nearby warrior organisms, the leader-beast ensures the prey targets are struck down.",
            "when": "Your Shooting phase or the Fight phase.",
            "target": "One SYNAPSE unit from your army that has not been selected to shoot or fight this phase, and one enemy unit within 24'' of and visible to the SYNAPSE unit.",
            "effect": "Until the end of the phase, each time a friendly TYRANIDS model makes an attack that targets that enemy unit, if the attacking model’s unit is within 6'' of your SYNAPSE unit, re-roll a Hit roll of 1 and re-roll a Wound roll of 1.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "green"
        },
        {
            "name": "reinforced hive node",
            "subindex": "battle tactic stratagem",
            "lore": "Psionic shielding crackles around these leader-beasts, helping to ensure their survival.",
            "when": "Your opponent’s Shooting phase or the Fight phase, just after an enemy unit has selected its targets.",
            "target": "One SYNAPSE unit from your army that was selected as the target of one or more of the attacking unit’s attacks.",
            "effect": "Until the end of the phase, each time an attack targets your unit, worsen the Armour Penetration characteristic of that attack by 1.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "green"
        },
        {
            "name": "imperative dominance",
            "subindex": "strategic ploy stratagem",
            "lore": "At need, the focused will of the Tyranid leader-beasts can goad warrior organisms to exhibit strategically beneficial behaviours at the instant they are needed most.",
            "when": "Your Command phase.",
            "target": "One TYRANIDS unit from your army that is within Synapse Range of your army.",
            "effect": "Select one Synaptic Imperative, even if you have already selected that imperative this battle. Until the start of your next Command phase, that Synaptic Imperative is active for your unit instead of any other Synaptic Imperative that is active for your army.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "blue"
        },
        {
            "name": "override instincts",
            "subindex": "strategic ploy stratagem",
            "lore": "The seemingly omniscient Hive Mind processes the sensory input of its swarms at an impossible rate, and compels its broods to react accordingly.",
            "when": "Your Movement phase.",
            "target": "That TYRANIDS MONSTER model.",
            "effect": "Your unit is eligible to shoot and declare a charge this turn.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "blue"
        }
    ]
}