{
    "detachmentName": "vanguard onslaught",
    "detachmentRule": [
        {
            "name": "questing tendrils",
            "lore": "In the early stages of an invasion, the Hive Mind harries and unbalances its foes with lightning-fast flanking attacks, before encircling them for the final, bloody slaughter.",
            "description": "TYRANIDS units with this ability are eligible to charge in a turn in which they Fell Back. VANGUARD INVADER units with this ability are eligible to charge in a turn in which they Advanced."
        },
        {
            "name": "vanguard prime",
            "lore": "During the earliest stages of a Tyranid invasion, the rare bioform Imperial observers have named Deathleaper has been seen fulfilling a leadership and coordination role amongst the swarms. Employing pheromone trails and goading imperatives, the creature provides guidance to other warrior organisms that is the localised equivalent of synaptic control.",
            "description": "DEATHLEAPER loses the Hunter Organism rule and can be your WARLORD."
        }
    ],
    "enhacements": [
        {
            "name": "Hunting Grounds",
            "points": 20,
            "lore": "This warrior organism has identified installations and routes of communication and supply vital to the prey. As the Tyranid invasion commences so the beast orchestrates ambushes and terror raids against these priority targets, ensuring that those enemy reinforcements who do reach the battlefield do so in bloodied disarray.",
            "description": "TYRANIDS model only. While the bearer is on the battlefield, each time your opponent sets up a Reserves unit on the battlefield, roll one D6: on a 2+, that unit must take a Battle-shock test."
        },
        {
            "name": "Chameleonic",
            "points": 15,
            "lore": "Subdermal crystals in this organisms carapace capture and redirect light, helping to conceal it.",
            "description": "VANGUARD INVADER model only. The bearer has the Stealth ability and each time a ranged attack targets the bearer’s unit, models in that unit have the Benefit of Cover against that attack."
        },
        {
            "name": "Stalker",
            "points": 10,
            "lore": "This hunter seeks vital priority prey that has been pheromonally marked for swift slaughter.",
            "description": "VANGUARD INVADER model only. At the start of the battle, select one enemy unit. Each time the bearer makes an attack that targets that enemy unit, add 1 to the Hit roll and add 1 to the Wound roll."
        },
        {
            "name": "Neuronode",
            "points": 30,
            "lore": "While no true synapse beast, this bioform has been grafted with a limited synaptic symbiote, the influence of which increases its host’s ability to formulate and enforce large-scale predatory strategies.",
            "description": "TYRANIDS model only. After both players have deployed their armies and determined who has the first turn, you can select up to three VANGUARD INVADER units from your army and redeploy all of those units. When doing so, any of those units can be placed into Strategic Reserves, regardless of how many units are already in Strategic Reserves."
        }
    ],
    "stratagems":[
        {
            "name": "surprise assault",
            "subindex": "battle tactic stratagem",
            "lore": "Vanguard organisms strike from unexpected quarters with calculated and emotionless alien savagery that is appalling to behold.",
            "when": "Your Shooting phase or the Fight phase.",
            "target": "One VANGUARD INVADER unit from your army that has not been selected to shoot or fight this phase, and one enemy unit.",
            "effect": "That enemy unit must take a Battle-shock test. Until the end of the phase, each time a model in your unit makes an attack that targets that enemy unit, add 1 to the Hit roll. If the Battle-shock test was failed, add 1 to the Wound roll as well.",
            "icon" : [""],
            "cp":1,
            "color":"green"
        },
        {
            "name": "assasin beasts",
            "subindex": "battle tactic stratagem",
            "lore": "These bioforms have been adapted to strike with pinpoint precision at the pre-assessed weak points of selected prey that require elimination.",
            "when": "Fight phase.",
            "target": "One VANGUARD INVADER INFANTRY unit from your army that has not been selected to fight this phase.",
            "effect": "Until the end of the phase, melee weapons equipped by models in your unit have the [PRECISION] ability.",
            "icon" : [""],
            "cp":1,
            "color":"green"
        },
        {
            "name": "seeded broods",
            "subindex": "strategic ploy stratagem",
            "lore": "Warrior organisms erupt from concealment straight into advanced positions.",
            "when": "Your Movement phase.",
            "target": "One TYRANIDS unit from your army that is in Reserves, or up to two VANGUARD INVADER units from your army that are in Reserves.",
            "effect": "Until the end of the phase, for the purposes of setting up those selected units on the battlefield, treat the current battle round number as being one higher than it actually is.",
            "icon" : [""],
            "cp":1,
            "color":"blue"
        },
        {
            "name": "hypersensory scillia",
            "subindex": "strategic ploy stratagem",
            "lore": "Hissing clusters of scillia warn of the slightest prey movements, allowing the Tyranids to react.",
            "when": "Your opponent’s Movement phase, just after an enemy unit ends a Normal, Advance or Fall Back move.",
            "target": "Up to two VANGUARD INVADER units from your army that are within 9'' of that enemy unit, or one other TYRANIDS INFANTRY unit from your army that is within 9'' of that enemy unit.",
            "effect": "Those selected units can each make a Normal move of up to 6''.",
            "icon" : [""],
            "cp":1,
            "color":"red"
        },
        {
            "name": "unseen lurkers",
            "subindex": "strategic ploy stratagem",
            "lore": "Hyper-attuned senses warn vanguard organisms when they are being targeted by the prey.",
            "when": "Your opponent’s Shooting phase, just after an enemy unit has selected its targets.",
            "target": "One VANGUARD INVADER unit from your army that was selected as the target of one or more of the attacking unit’s attacks.",
            "effect": "Until the end of the phase, your unit can only be selected as the target of a ranged attack if the attacking model is within 12'' or, if your unit has the Lone Operative ability, if the attacking model is within 6''. Your opponent can select new targets for the attacking unit’s attacks.",
            
            "icon" : [""],
            "cp":1,
            "color":"red"
        },
        {
            "name": "invisible hunter",
            "subindex": "strategic ploy stratagem",
            "lore": "Hunter-slayer organisms can melt away before the eyes of their foes, only to strike from a new direction.",
            "when": "End of your opponent’s Fight phase.",
            "target": "Up to two VANGUARD INVADER units from your army, or one TYRANIDS INFANTRY unit from your army.",
            "effect": "Remove the targeted units from the battlefield and place them into Strategic Reserves.",
            "icon" : [""],
            "cp":1,
            "color":"red"
        }
    ]

}