{
    "detachmentName": "retaliation cadre",
    "detachmentRule": [
        {
            "name": "bonded heroes",
            "lore": "Cadres of T’au Battlesuit pilots fight in a manner inspired by the dynamism and determination of famous and beloved war leaders. Indeed, some of the specialist piloting manoeuvres they employ are named after such icons, in a few rare – and sometimes unofficial – cases even after those who have since fallen far from favour with the Ethereal Council. Either way, these bonded veterans are experts in the deadly art of engaging the enemy in close confines. They plunge into the heart of the enemy army where the fighting is fiercest, and prevail in the name of the Greater Good.",
            "description": "Each time a T’AU EMPIRE BATTLESUIT model from your army makes a ranged attack that targets a unit within 12”, improve the Strength characteristic of that attack by 1. If that attack targets a unit within 6”, improve the Armour Penetration characteristic of that attack by 1 as well."
        }
    ],
    "enhacements": [
        {
            "name": "Internal Grenade Racks",
            "points": 20,
            "lore": "These thigh plates house deployment rails of high-explosive bomblets. As the pilot jets over the foe, the racks can be triggered to dispense a rain of death.",
            "description": "T’AU EMPIRE BATTLESUIT model only. The bearer has the Grenades keyword, and each time the bearer ends a Normal move, you can select one enemy unit that it moved over during that move. If you do, roll six D6: for each 4+, that enemy unit suffers 1 mortal wound."
        },
        {
            "name": "Prototype Weapon System",
            "points": 15,
            "lore": "Famed battlesuit pilots are often more than willing to assist Earth caste scientists infield-testing the latest in experimental weapons technology.",
            "description": "T’AU EMPIRE BATTLESUIT model only. Each time the bearer is selected to shoot, select either the [LETHAL HITS] or [SUSTAINED HITS 1] ability. Until those attacks are resolved, ranged weapons equipped by the bearer have the selected ability."
        },
        {
            "name": "Puretide Engram Neurochip",
            "points": 25,
            "lore": "Commander Puretide was the most gifted T’au war leader of all time. Upon his death, his memories were stored in a neurochip. When implanted into the brain, the bearer can access much of this wisdom.",
            "description": "T’AU EMPIRE BATTLESUIT model only. Once per turn, you can target the bearer’s unit with a Stratagem even if you have already targeted a different unit with that Stratagem this phase."
        },
        {
            "name": "Starflare Ignition System",
            "points": 20,
            "lore": "The ignition thrusters on selected battlesuits are augmented with optional feed-selectors, allowing the pilot to release a jet of enriched accelerant upon take-off and sending the pilots streaking skywards.",
            "description": "T’AU EMPIRE BATTLESUIT model only. At the end of your opponent’s turn, if the bearer’s unit is not within Engagement Range of one or more enemy units, you can remove that unit from the battlefield and place it into Strategic Reserves."
        }
    ],
    "stratagems": [
        {
            "name": "fail-safe detonator",
            "subindex": "epic deed stratagem",
            "lore": "Devices are incorporated into some battlesuits either to prevent high-ranking pilots being taken alive for interrogation or to prevent just such fatal explosions.",
            "when": "Any phase, just after a T’AU EMPIRE BATTLESUIT model from your army is destroyed.",
            "target": "That destroyed model’s unit. You can use this Stratagem on that unit even if that unit was just destroyed.",
            "effect": "Before removing your model from play, if it has the Deadly Demise ability, do not roll for that ability; instead, you can choose whether the result of that roll is a 1 or a 6. If your model does not have the Deadly Demise ability, roll one D6 for each unit within 6” of it: on a 4+, that unit suffers D3 mortal wounds.",
            "icon": [
                ""
            ],
            "cp": 2,
            "color": "blue"
        },
        {
            "name": "the arro'kon protocol",
            "subindex": "battle tactic stratagem",
            "lore": "Commander Arro’kon’s teachings are considered pre-eminent in the art of engaging and eliminating numerically overwhelming enemy formations.",
            "when": "Your Shooting phase.",
            "target": "One T’AU EMPIRE BATTLESUIT unit from your army that has not been selected to shoot this phase.",
            "effect": "Until the end of the phase, each time a model in your unit makes an attack that targets an enemy unit that contains 6 or more models, that attack has the [SUSTAINED HITS 1] ability. If that attack targets an enemy unit that contains 11 or more models, it has the [SUSTAINED HITS 2] ability instead.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "blue"
        },
        {
            "name": "stimm injectors",
            "subindex": "wargear stratagem",
            "lore": "On-board hypodermics shunt pain-blockers and chemical stimulants into the pilot’s system.",
            "when": "Your opponent’s Shooting phase or the Fight phase, just after an enemy unit has selected its targets.",
            "target": "One T’AU EMPIRE BATTLESUIT unit from your army that was selected as the target of one or more of the attacking unit’s attacks.",
            "effect": "Until the end of the phase, models in your unit have the Feel No Pain 6+ ability.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "blue"
        },
        {
            "name": "the torchstar gambit",
            "subindex": "strategic ploy stratagem",
            "lore": "Though now disgraced by association with O’Shovah, Sub-Commander Torchstar’s strike-and-fade tactics are still taught - albeit officially under other names - in many Fire caste academies.",
            "when": "Your Shooting phase.",
            "target": "One T’AU EMPIRE BATTLESUIT unit from your army that can Fly whose attacks have been resolved this phase.",
            "effect": "If your unit is not within Engagement Range of one or more enemy units, it can make a Normal move. If it does, your unit cannot declare a charge this turn.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "blue"
        },
        {
            "name": "the shortened blade",
            "subindex": "strategic ploy stratagem",
            "lore": "Made famous by Commander Farsight and his protege Brightsword, this philosophy encourages pilots to drop into the very teeth of the enemy army and apply their firepower at point-blank range.",
            "when": "Your Movement phase.",
            "target": "One T’AU EMPIRE BATTLESUIT unit from your army that is arriving using the Deep Strike ability this phase.",
            "effect": "Your unit can be set up anywhere on the battlefield that is more than 3” horizontally away from all enemy models.",
            "restrictions": "A unit targeted with this Stratagem is not eligible to declare a charge in the same turn.",
            "icon": [
                ""
            ],
            "cp": 2,
            "color": "blue"
        },
        {
            "name": "grav-inhibitor field",
            "subindex": "strategic ploy stratagem",
            "lore": "First used by O’Jr during the battle for Laguna Shard, these battlesuit-mounted emitters batter advancing foes backwards with gravitic pulse waves.",
            "when": "Your opponent’s Charge phase, just after an enemy unit has declared a charge.",
            "target": "One T’AU EMPIRE BATTLESUIT unit from your army that was selected as a target of that charge.",
            "effect": "That enemy unit must immediately take a Battle-shock test and you must roll one D6 for each model in that enemy unit; for each 6, that enemy unit suffers 1 mortal wound.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "red"
        }
    ]
}
