{
    "detachmentName": "Bully boyz",
    "detachmentRule": [
        {
            "name": "da boss is watchin'",
            "lore": "Gathered together into an all-conquering mass of hulking brutes, the biggest Nobz and their even larger bosses are - or so they claim - more Orky than anyone else. Their bellowed war cries are louder, their self-belief, impetus and sheer presence an affront to the senses. Theirs is a violent  momentum that can roll through entire  enemy armies in an unrelenting wave of aggression. ",
            "description": "At the start of a battle round in which you have not called a Waaaghl, if you have one or more <strong>WARBOSS</strong> models on the battlefield (or embarked  within a <strong>TRANSPORT</strong> that is on the battlefield), you can call a Waaagh! for a second time this battle. When doing so, that second Waaagh! only counts as having been called for WaRBoss, NoBz and <strong>MEGANOBZ</strong> units from your army. "
        }
    ],
    "enhacements": [
        {
            "name": "Tellyporta",
            "points": 25,
            "lore": "Nothing shocks the enemy like an angry mob of the biggest and surliest Orks imaginable suddenly appearing in a blast of green lightning!",
            "description": "Warboss in Mega Armour model only. Models in the bearer’s unit have the Deep Strike ability."
          },
          {
            "name": "Big Gob",
            "points": 20,
            "lore": "This warlord’ bellowing war cry is so loud that it can be heard over the thickest of fighting, rolling outwards in a terrifying bestial roar.",
            "description": "Infantry Warboss model only. At the start of the Fight phase, select one enemy unit within Engagement range of the bearer. That unit must take a Battle-shock test, and when doing so, subtract 1 from the result."
          },
          {
            "name": "Da Biggest Boss",
            "points": 15,
            "lore": "‘The bigger the Waaagh!, the bigger the boss must be to exert control. This Ork has countless huge battles under his belt and has grown in stature and aggression to match.",
            "description": "Infantry Warboss model only. Add 2 to the bearer’s Wounds characteristic."
          },
          {
            "name": "Eadstompa",
            "points": 10,
            "lore": "A solid slab of muscle and aggression, this Ork is living embodiment of the undeniable truth of his enemies inferiority.",
            "description": "Infantry Warboss model only. Each time the bearer makes an attack that targets a unit that is below its Starting Strength, re-roll a Wound roll of 1. If that unit is Below Half-strength, you can re-roll the Wound roll instead."
          }
    ],
    "stratagems": [
        {
            "name": "Armed to Da Teef",
            "subindex": "battle tactic stratagem",
            "lore": "Nobz load themselves with all manner of weapons in shows of wealth and influence, enabling them to smash the foe with a ceaseless barrage of attacks.",
            "when": "Your Shooting phase or the Fight phase.",
            "target": "One Nobz or Meganobz unit from your army that has not been selected to shoot or fight this phase.",
            "effect": "Until the end of the phase, each time a model in your unit makes an attack, re-roll a Hit roll of 1. If a Waaagh! is active for your unit, you can re-roll the Hit roll instead.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "green"
        },
        {
            "name": "Too Arrogant to Die",
            "subindex": "strategic ploy stratagem",
            "lore": "With bone-headed arrogance, Nobz will carry on killing before their deaths finally register.",
            "when": "Your opponent's Shooting phase or the Fight phase, just after an enemy unit has selected its targets.",
            "target": "One Nobz or Meganobz unit from your army that was selected as the target of one or more of the attacking unit’s attacks.",
            "effect": "Until the end of the phase, each time a model in your unit is destroyed, if that model has not shot or fought this phase, roll one D6, adding 2 to the result if a Waaagh! is active for your unit. On a 5+, do not remove the destroyed model from play. It can shoot or fight after the attacking unit has finished making its attacks, and is then removed from play.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "green"
        },
        {
            "name": "Always Lookin' Fer a Fight",
            "subindex": "strategic ploy stratagem",
            "lore": "As one enemy falls to the choppas of a battle-hungry mob of Nobz, they immediately seek out more.",
            "when": "Fight phase, just after an enemy unit is destroyed.",
            "target": "One Nobz or Meganobz unit from your army that destroyed that enemy unit.",
            "effect": "Until the end of the phase, each time your unit makes a Consolidation move, it can move up to D3+3\" instead of up to 3\". If a Waaagh! is active for your unit, it can move up to 6\" instead.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "green"
        },
        {
            "name": "Crushing Impact",
            "subindex": "epic deed stratagem",
            "lore": "When a thundering mob of hulking Ork Nobz stomps into the foe, their crushing momentum is a lethal weapon by itself.",
            "when": "Your Charge phase, just after a Nobz or Meganobz unit from your army ends a Charge move.",
            "target": "That Nobz or Meganobz unit.",
            "effect": "Select one enemy unit within Engagement Range of your unit, then roll one D6 for each model in your unit that is within Engagement Range of that enemy unit: for each 5+, that enemy unit suffers 1 mortal wound (to a maximum of 6 mortal wounds). If a Waaagh! is active for your unit, that enemy unit suffers 1 mortal wound for each 4+ instead.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "blue"
        },
        {
            "name": "Cut 'Em Down",
            "subindex": "battle tactic stratagem",
            "lore": "Furious with any snivelling gitz who attempt to back away from a good fight, Nobz will ruthlessly hack them apart as they turn to flee.",
            "when": "Your opponent's Movement phase, just after an enemy unit is selected to Fall Back.",
            "target": "One Nobz or Meganobz unit from your army within Engagement Range of that enemy unit.",
            "effect": "When that enemy unit Falls Back, all models in that enemy unit must take a Desperate Escape test. When doing so, if a Waaagh! is active for your unit, subtract 1 from each of those tests.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "red"
        },
        {
            "name": "Hulking Brutes",
            "subindex": "battle tactic stratagem",
            "lore": "The sheer aggressive contempt advancing Nobz project, not to mention their thick skulls and 'eavy armour, make them a terrifying prospect for foes desperately trying to gun them down.",
            "when": "Your opponent's Shooting phase, just after an enemy unit has selected its targets.",
            "target": "One Nobz or Meganobz unit from your army that was selected as the target of one or more of the attacking unit's attacks.",
            "effect": "Until the end of the phase, each time an attack targets your unit, worsen the Armour Penetration characteristic of that attack by 1.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "red"
        }
    ]
}