{
    "detachmentName": "dread mob",
    "detachmentRule": [
        {
            "name": "try dat button!",
            "lore": "Inventive Meks wire all manner of kustomised gubbinz, suspicious extras and  inviting big red buttons to weapons or into the cockpits of their clanking kan creations. Eager Orks are always enthusiastic to try out such random innovations to see what sort of destruction they can cause. Sometimes this can be risky, but that’s half the fun! ",
            "description": " <p>Each time a <strong> MEK, ORKS WALKER</strong>  or <strong> GROTS VEHICLE</strong>  unit from your army is  selected to shoot or fight, roll one D6. Until the end of the phase, weapons quipped by models in that unit have the corresponding ability shown in the table below.  </p> </br> <div class= 'grid grid-cols-3'>  <div class='bg-zinc-200 border-solid border-2 my-2 border-white flex justify-center col-span-1'> <strong> 1-2 </strong> </div> <div class='flex justify-center my-2  col-span-2 pl-2'><p> [SUSTAINED HITS 1] ability. </p> </div>                <div class='bg-zinc-200 border-solid border-2 my-2 border-white flex justify-center col-span-1'> <strong> 3-4  </strong> </div> <div class='flex justify-center my-2  col-span-2 pl-2'>[LETHAL HITS] ability.  </div>                             <div class='bg-zinc-200 border-solid border-2 my-2 border-white flex justify-center col-span-1'> <strong>5-6  </strong> </div> <div class='flex justify-center my-2  col-span-2 pl-2'> <p>Each time an attack is made with this  weapon, ona Critical Wound, improve the Armour Penetration characteristic  of that attack by 2.  </p>   </div>   </div>      </div> <br/> <p>Alternatively, when such a unit is selected to shoot or fight, you can select one of the abilities above instead of rolling the D6. If you do, until the end of the phase, weapons equipped by models in that unithave the [HAZARDOUS] ability as well.  </p>   <p>If a weapon equipped by a model from you army has the [HAZARDOUS] ability from multiple sources, each time you take a Hazardous test for that weapon, it is failed on a roll ofa 1 ora 2.  </p> <br> <p> <strong>GRETCHIN </strong> units from your army gain the <strong>BATTLELINE </strong> keyword.  </p>  "
        }
    ],
    "enhacements": [
        {
            "name": "Smoky Gubbinz",
            "points": 20,
            "lore": "This loud, fume-belching device wreathes the bearer and his mates in a thick bank of smoke. This is hard for the enemy to see through, but has little detriment on the Orks’ own accuracy.",
            "description": "Mek model only. Models in the bearer’s unit have the Stealth ability."
          },
          {
            "name": "Supa-Glowy Fing",
            "points": 15,
            "lore": "The Mek cobbled together this strange device in a flash of feverish inventin’. He isn’t sure what it does - and it glows weirdly - but he proudly carries it to battle, eager to know what its big switch will do this time.",
            "description": "Mek model only. In your Command phase, select one enemy unit within 18\" of and visible to the bearer, then roll one D6: on a 1-2, that enemy unit must take a Battle-shock test; on a 3-4, that enemy unit suffers D3 mortal wounds; on a 5-6, until the start of your next Command phase, each time a model in that enemy unit makes an attack, subtract 1 from the Hit roll."
          },
          {
            "name": "Press It Fasta!",
            "points": 35,
            "lore": "Impatient for better results, this Mek is an avid advocate of the theory that smashing buttons and cranking dials faster makes kustom guns more shooty.",
            "description": "Mek model only. Each time the bearer’s unit is selected to shoot, when rolling to determine which ability that unit’s weapons gain from the Try Dat Button! Detachment rule, roll one additional D6: until the end of the phase, ranged weapons equipped by models in that unit gain both Button Effects generated by those rolls. If a duplicate Button Effect is rolled, it has no additional effect."
          },
          {
            "name": "Gitfinder Gogglez",
            "points": 10,
            "lore": "By squinting hard through the mismatched lenses of these goggles, even the sneakiest git can be pinpointed.",
            "description": "Mek model only. Ranged weapons equipped by models in the bearer’s unit have the [IGNORES COVER] ability."
          }
        
    ],
    "stratagems": [
        {
            "name": "Klanikin' Klaws",
            "subindex": "battle tactic stratagem",
            "lore": "The krews of a Mek's simplest contraptions revel in ripping apart anything they can get their klaws on, heedless of the damage done to their own gubbinz.",
            "when": "Fight phase.",
            "target": "One Orks Walker unit from your army that has not been selected to fight this phase.",
            "effect": "Each time you use this Stratagem, you can choose to push it. Until the end of the phase, add 2 to the Strength characteristic of melee weapons equipped by models in your unit and, if you choose to push it, until the end of the phase, add 1 to the Damage characteristic of those weapons and they have the [Hazardous] ability as well.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "green"
        },
        {
            "name": "Superfuelled Boiler",
            "subindex": "strategic ploy stratagem",
            "lore": "By pushing their engines past any sane level, Ork combat walkers can build terrifying momentum.",
            "when": "Your Movement phase, just after an Orks Walker unit from your army has been selected to Advance.",
            "target": "That Orks Walker unit.",
            "effect": "Until the end of the turn, you can re-roll Advance rolls made for your unit and ranged weapons equipped by models in your unit have the [Assault] ability.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "blue"
        },
        {
            "name": "Bigger Shells for Bigger Gitz",
            "subindex": "battle tactic stratagem",
            "lore": "Stashes of extra speshul ammo provided by the Meks are often expended on rival monstrosities.",
            "when": "Your Shooting phase.",
            "target": "One Mek, Orks Walker or Grots Vehicle unit from your army that has not been selected to shoot this phase.",
            "effect": "Each time you use this Stratagem, you can choose to push it. Until the end of the phase, each time a model in your unit makes an attack that targets a Monster or Vehicle, add 1 to the Wound roll. If you choose to push it, add 1 to the Damage characteristic of that attack and, until the end of the phase, ranged weapons equipped by models in your unit have the [Hazardous] ability as well.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "blue"
        },
        {
            "name": "Dakka! Dakka! Dakka!",
            "subindex": "battle tactic stratagem",
            "lore": "Orks have a tendency to hold the trigger down until their weapon stops firing, falls apart or misfires.",
            "when": "Your Shooting phase.",
            "target": "One Orks Walker or Grots Vehicle unit from your army that has not been selected to shoot this phase.",
            "effect": "Each time you use this Stratagem, you can choose to push it. Until the end of the phase, each time a model in your unit makes an attack, re-roll a Hit roll of 1. If you choose to push it, you can re-roll the Hit roll instead and, until the end of the phase, ranged weapons equipped by models in your unit have the [Hazardous] ability as well.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "blue"
        },
        {
            "name": "Conniving Runts",
            "subindex": "strategic ploy stratagem",
            "lore": "A Gretchin's lot is often a wretched one, and the spiteful zoggers will take any chance to cause pain and mischief using sneaky traps before legging it.",
            "when": "Your opponent's Movement phase, just after an enemy unit ends a Normal, Advance or Fall Back move.",
            "target": "One Gretchin unit from your army that is within 9\" of that enemy unit and not within Engagement Range of any enemy units.",
            "effect": "Roll one D6. On a 4+, that enemy unit suffers D3+1 mortal wounds. Your unit can then make a Normal move.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "red"
        },
        {
            "name": "Extra Gubbinz",
            "subindex": "battle tactic stratagem",
            "lore": "The Meks' creations can afford to have all manner of useless junk blasted from them with little effect.",
            "when": "Your opponent's Shooting phase, just after an enemy unit has selected its targets.",
            "target": "One Orks Walker or Grots Vehicle unit from your army including Titanic units that was selected as the target of one or more of the attacking unit’s attacks.",
            "effect": "Until the end of the phase, each time an attack is allocated to a model in your unit, subtract 1 from the Damage characteristic of that attack.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "red"
        }
    ]
}