{
    "detachmentName": "rad-cohort",
    "detachmentRule": [
        {
            "name": "cyber-psalm programming",
            "lore": "In advance of a Cohort Cyberneticas battles, the Legios most talented Datasmiths will feed dogmatic auto-scripture into the programming cores of their robotic charges, as well as oracular schematics and tactical hymnals that delineate the strategy to come. So blessed, the Cohorts robots add their own grinding chants of static to a systematic chorus of praise in the Omnissiah’s name.",
            "description": "<strong>LEGIO CYBERNETICA</strong> units from your army gain the Doctrina Imperatives army rule"
        }
    ],
    "enhacements": [
        {
            "name": "Necromechanic",
            "points": 25,
            "lore": "The blessed healing of machinery is the sign of a true shepherd of the Omnissiah’s flock.",
            "description": "TECH-PRIEST model only. Once per battle round, when a saving throw made for a friendly LEGIO CYBERNETICA or ADEPTUS MECHANICUS VEHICLE model within 12'' of the bearer is failed, the bearer can use this Enhancement. If they do, change the Damage characteristic of that attack to 0."
        },
        {
            "name": "Lord of Machines",
            "points": 20,
            "lore": "An intense burst of viral static can overload those machine spirits yoked to the service of the enemy.",
            "description": "TECH-PRIEST model only. Once per turn, at the start of your opponent’s Shooting phase, select one enemy VEHICLE unit within 12'' of and visible to the bearer. That unit must take a Leadership test: if that test is passed, until the end of the phase, each time a model in that unit makes an attack, subtract 1 from the Hit roll; if that test is failed, that unit is not eligible to shoot this phase."
        },
        {
            "name": "Emotionless Clarity",
            "points": 15,
            "lore": "With a mind unsullied by the passions common to the flesh, a Tech-Priest can entreat the machine spirit of a dying war engine to enact one final triumph.",
            "description": "TECH-PRIEST model only. Once per turn, when a friendly LEGIO CYBERNETICA or ADEPTUS MECHANICUS VEHICLE model with the Deadly Demise ability that is within 12'' of the bearer is destroyed, the bearer can use this Enhancement. If it does, do not roll to determine whether any mortal wounds are inflicted as a result of that model’s Deadly Demise ability. Instead, mortal wounds are automatically inflicted."
        },
        {
            "name": "Arch-Negator",
            "points": 10,
            "lore": "Feeding magneto-voltaic arcs and deadly frequencies into their weapons, the Tech-Priest is death incarnate to blasphemies against the Machine God.",
            "description": "TECH-PRIEST model only. Ranged weapons equipped by the bearer have the [ANTI-VEHICLE 4+] ability."
        }
    ],
    "stratagems": [
        {
            "name": "motive imperative",
            "subindex": "battle tactic stratagem",
            "lore": "Intensifying the locomotive protocols of a war engine - while not dishonouring its machine spirit - is a millennia-proven method to hasten the foe’s demise.",
            "when": "Your Command phase.",
            "target": "One ADEPTUS MECHANICUS VEHICLE unit from your army. ",
            "effect": "Until the start of your next Command phase, add 3'' to the Move characteristic of models in your unit and add 1 to Advance and Charge rolls made for it.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "blue"
        },
        {
            "name": "auto-divinatory targeting",
            "subindex": "battle tactic stratagem",
            "lore": "Encoded with the schemata of the enemy's fortified battle lines and auto-codified vectors of attack, the Cohort's war engines are perfectly aligned to deliver the Machine God's wrath.",
            "when": " Your Command phase.",
            "target": "One LEGIO CYBERNETICA or ADEPTUS MECHANICUS VEHICLE unit from your army, and one objective marker.",
            "effect": "Until the start of your next Command phase, ranged weapons equipped by models in your unit have a Ballistic Skill characteristic of 3+ and the [IGNORES COVER] ability, but they can only target units within range of the selected objective marker.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "blue"
        },
        {
            "name": "machine spirit resurgent",
            "subindex": "epic deed stratagem",
            "lore": "To invigorate the failing machine spirit of a damaged vehicle is a sacred task, greatly aided by certain data-hymns transmitted in the correct sequence.",
            "when": "Your Command phase.",
            "target": "One LEGIO CYBERNETICA or ADEPTUS MECHANICUS VEHICLE unit from your army that is below its Starting Strength.",
            "effect": "Until the start of your next Command phase, each time a model in your unit makes an attack, you can re-roll the Hit roll. If your unit is Below Half-strength, you can re-roll the Wound roll as well.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "blue"
        },
        {
            "name": "machine superiority",
            "subindex": "epic deed stratagem",
            "lore": "Let the unenlightened be cast down! Let all feel the fire of the Motive Force, and may the sacred engines crunch over their weak bones without impediment!",
            "when": "Your Command phase.",
            "target": "One LEGIO CYBERNETICA or ADEPTUS MECHANICUS VEHICLE unit from your army.",
            "effect": "Until the end of the turn, your unit is eligible to shoot in a turn in which it Fell Back and you can ignore any or all modifiers to its characteristics and/or to any roll or test made for it (excluding modifiers to saving throws).",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "blue"
        },
        {
            "name": "trascendent cogitation",
            "subindex": "strategic ploy stratagem",
            "lore": "Enhanced static chants can briefly raise a war engine's machine spirits to exultant heights of cogitation and multi-tactical capacity.",
            "when": "Your Command phase.",
            "target": "One LEGIO CYBERNETICA or ADEPTUS MECHANICUS VEHICLE unit from your army.",
            "effect": "Until the start of your next Command phase, the Conqueror Imperative and Protector Imperative are both active for your unit.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "blue"
        },
        {
            "name": "benevolence of the omnissiah",
            "subindex": "battle tactic stratagem",
            "lore": "A protective blessing chanted in pentakairic Novabyte moves machine spirits to defy the most esoteric of assaults.",
            "when": "Your Command phase.",
            "target": "One LEGIO CYBERNETICA or ADEPTUS MECHANICUS VEHICLE unit from your army.",
            "effect": "Until the start of your next Command phase, models in your unit have the Feel No Pain 6+ ability, which is improved to Feel No Pain 5+ against mortal wounds.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "blue"
        }
    ]
}