{
    "detachmentName": "data-psalm conclave",
    "detachmentRule": [
        {
            "name": "benedictions of the omnissiah",
            "lore": "The Tech-Priests of the Omnissiah lead their disciples in a cortege of war. The buzz of static psalms chanted in synchronicity unites all in the stately eradication of the heretic and blasphemer.",
            "description": "At the start of the first battle round, select one of the following Benedictions of the Omnissiah to be active for CULT MECHANICUS units from your army until the end of the battle:"
        }
    ],
    "enhacements": [
        {
            "name": "Mechanicus Locum",
            "points": 10,
            "lore": "Amongst every congregation of Tech-Priests are masters of arcane knowledge - inspirational leaders of the cybernetic and the mechanical.",
            "description": "TECH-PRIEST model only. The bearer has a Leadership characteristic of 6+ and, once per battle, at the start of any phase, you can select one friendly CULT MECHANICUS unit that is Battle-shocked and within 12'' of the bearer. That unit is no longer Battle-shocked."
        },
        {
            "name": "Mantle Of the Gnosticarch",
            "points": 15,
            "lore": "The toughened weave of this hooded robe includes hypo-ceramic threads, thermoplastics and terranic polymers that create a holy shroud capable of resisting the infernos of plasma reactors.",
            "description": "TECH-PRIEST model only. Each time an attack is allocated to the bearer, change the Damage characteristic of that attack to 1."
        },
        {
            "name": "Data-blessed Autosermon",
            "points": 20,
            "lore": "Struck with an infoload of revelation, truly blessed Tech-Priests will override the sacred canticles to deliver the Machine God’s adaptive wisdom.",
            "description": "TECH-PRIEST model only. Once per battle, at the start of your Command phase, you can select the Benediction of the Omnissiah you did not select at the start of the first battle round. Until the start of your next Command phase, that Benediction of the Omnissiah is active for the bearer’s unit in addition to the one that is currently active for your army."
        },
        {
            "name": "Temporcopia",
            "points": 25,
            "lore": "The Temporcopia is a relic from the Dark Age of Technology that releases a swarm of nano-engineered machines. These invisible devices seek out nearby prey, briefly draining electro-chemical potential before their power expires. Enemy warriors slow and stumble, at the mercy of the Tech-Priest’s bodyguard.",
            "description": "TECH-PRIEST model only. The bearer’s unit has the Fights First ability"
        }
    ],
    "stratagems": [
        {
            "name": "incantation of the iron soul",
            "subindex": "battle tactic stratagem",
            "lore": "Raising their voices in binharic praise, the Machine God's disciples bolster their spirits - as well as those that inhabit their augmentations - with iron surety.",
            "when": "Any phase, just after you allocate a mortal wound to a CULT MECHANICUS model from your army.",
            "target": "That CULT MECHANICUS model’s unit.",
            "effect": "Until the end of the phase, CULT MECHANICUS models in your unit have the Feel No Pain 4+ ability against mortal wounds.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "green"
        },
        {
            "name": "chant of the remorseless fist",
            "subindex": "battle tactic stratagem",
            "lore": "These warrior organisms destroy all as their adrenaline surges.",
            "when": "Fight phase.",
            "target": "Up to two TYRANIDS units from your army that are within Synapse Range of your army and are eligible to fight, or one other TYRANIDS unit from your army that is eligible to fight.",
            "effect": "Until the end of the phase, each time a model in any of those selected units makes an attack, an unmodified Hit roll of 5+ scores a Critical Hit.",
            "icon": [
                ""
            ],
            "cp": 2,
            "color": "green"
        },
        {
            "name": "death frenzy",
            "subindex": "strategic ploy stratagem",
            "lore": "Tyranids care nothing for self-preservation, lashing out even in death.",
            "when": "Fight phase, just after an enemy unit has selected its targets.",
            "target": "One TYRANIDS unit from your army that was selected as the target of one or more of the attacking unit’s attacks.",
            "effect": "Until the end of the phase, each time a model in your unit is destroyed, if that model has not fought this phase, roll one D6: on a 4+, do not remove it from play. The destroyed model can fight after the attacking model’s unit has finished making its attacks, and is then removed from play.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "green"
        },
        {
            "name": "overrun",
            "subindex": "strategic ploy stratagem",
            "lore": "Tyranids in battle form an unstoppable avalanche of flesh and chitin that buries the foe alive.",
            "when": "Fight phase, just before a TYRANIDS unit from your army Consolidates.",
            "target": "That TYRANIDS unit.",
            "effect": "Until the end of the phase, each time your unit Consolidates, models in it can move an additional 3'' as long as your unit can end that move within Engagement Range of one or more enemy units. If your unit is within Synapse Range of your army and not within Engagement Range of any enemy units, instead of making that Consolidation move, it can make a Normal move of up to 6''",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "green"
        },
        {
            "name": "predatory imperative",
            "subindex": "strategic ploy stratagem",
            "lore": "Guided by the instincts of leader-beasts, the swarm can be tasked with focusing its hunting instincts.",
            "when": "Your Command phase.",
            "target": "Up to two TYRANIDS units from your army that are within Synapse Range of your army, or one other TYRANIDS unit from your army.",
            "effect": "Select one Hyper-adaptation. Until the start of your next Command phase, that Hyper-adaptation is active for those selected units in addition to any other that may be active for your army.",
            "restrictions": "You cannot select the same Hyper-adaptation you selected at the start of the first battle round.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "blue"
        },
        {
            "name": "endless swarm",
            "subindex": "strategic ploy stratagem",
            "lore": "As the battle rages, more organisms pour in to bolster the swarms.",
            "when": "Your Command phase.",
            "target": "Up to two ENDLESS MULTITUDE units from your army that are within Synapse Range of your army, or one other ENDLESS MULTITUDE unit from your army.",
            "effect": "You can return up to D3+3 destroyed models to each of the selected units.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "blue"
        }
    ]
}