{
    "detachmentName": "data-psalm conclave",
    "detachmentRule": [
        {
            "name": "benedictions of the omnissiah",
            "lore": "The Tech-Priests of the Omnissiah lead their disciples in a cortege of war. The buzz of static psalms chanted in synchronicity unites all in the stately eradication of the heretic and blasphemer.",
            "description": "<p>At the start of the first battle round, select one of the following Benedictions of the Omnissiah to be active for CULT MECHANICUS units from your army until the end of the battle: </p><br/>  <p> <strong>Panegyric Procession </strong> </p>  <p>Each time a CULT MECHANICUS model from your army makes a ranged attack that targets a unit within half range, improve the Armour Penetration characteristic of that attack by 1 </p> <br/> <p> <strong>Citation in Savagery </strong> </p>  <p>Each time a CULT MECHANICUS unit from your army is selected to fight, if that unit made a Charge move this turn, until the end of the phase, add 1 to the Strength and Attacks characteristics of melee weapons equipped by models in that unit </p>"
        }
    ],
    "enhacements": [
        {
            "name": "Mechanicus Locum",
            "points": 10,
            "lore": "Amongst every congregation of Tech-Priests are masters of arcane knowledge - inspirational leaders of the cybernetic and the mechanical.",
            "description": "TECH-PRIEST model only. The bearer has a Leadership characteristic of 6+ and, once per battle, at the start of any phase, you can select one friendly CULT MECHANICUS unit that is Battle-shocked and within 12'' of the bearer. That unit is no longer Battle-shocked."
        },
        {
            "name": "Mantle Of the Gnosticarch",
            "points": 15,
            "lore": "The toughened weave of this hooded robe includes hypo-ceramic threads, thermoplastics and terranic polymers that create a holy shroud capable of resisting the infernos of plasma reactors.",
            "description": "TECH-PRIEST model only. Each time an attack is allocated to the bearer, change the Damage characteristic of that attack to 1."
        },
        {
            "name": "Data-blessed Autosermon",
            "points": 20,
            "lore": "Struck with an infoload of revelation, truly blessed Tech-Priests will override the sacred canticles to deliver the Machine God’s adaptive wisdom.",
            "description": "TECH-PRIEST model only. Once per battle, at the start of your Command phase, you can select the Benediction of the Omnissiah you did not select at the start of the first battle round. Until the start of your next Command phase, that Benediction of the Omnissiah is active for the bearer’s unit in addition to the one that is currently active for your army."
        },
        {
            "name": "Temporcopia",
            "points": 25,
            "lore": "The Temporcopia is a relic from the Dark Age of Technology that releases a swarm of nano-engineered machines. These invisible devices seek out nearby prey, briefly draining electro-chemical potential before their power expires. Enemy warriors slow and stumble, at the mercy of the Tech-Priest’s bodyguard.",
            "description": "TECH-PRIEST model only. The bearer’s unit has the Fights First ability"
        }
    ],
    "stratagems": [
        {
            "name": "incantation of the iron soul",
            "subindex": "battle tactic stratagem",
            "lore": "Raising their voices in binharic praise, the Machine God's disciples bolster their spirits - as well as those that inhabit their augmentations - with iron surety.",
            "when": "Any phase, just after you allocate a mortal wound to a CULT MECHANICUS model from your army.",
            "target": "That CULT MECHANICUS model’s unit.",
            "effect": "Until the end of the phase, CULT MECHANICUS models in your unit have the Feel No Pain 4+ ability against mortal wounds.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "green"
        },
        {
            "name": "chant of the remorseless fist",
            "subindex": "battle tactic stratagem",
            "lore": "In spitting out a staccato chant to the Motive Force, the faithful warriors of the Cult Mechanicus are filled with merciless surety as well as intent.",
            "when": "Fight phase.",
            "target": "One CULT MECHANICUS unit from your army that has not been selected to fight this phase.",
            "effect": "Until the end of the phase, each time a CULT MECHANICUS model in your unit makes a melee attack, add 1 to the Wound roll.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "green"
        },
        {
            "name": "verse of vengeance",
            "subindex": "strategic ploy stratagem",
            "lore": "Rousing code in binharic duometer incites fury for the lost fragments of technological lore. In the grip of vengeance, the devoted extend their remaining functions for one last act of retribution.",
            "when": "Fight phase, just after an enemy unit has selected its targets.",
            "target": "One CULT MECHANICUS unit from your army that was selected as the target of one or more of the attacking unit’s attacks.",
            "effect": "Until the end of the phase, each time a CULT MECHANICUS model in your unit is destroyed, if that model has not fought this phase, roll one D6: on a 4+, do not remove it from play. The destroyed model can fight after the attacking model’s unit has finished making its attacks, and is then removed from play.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "green"
        },
        {
            "name": "tribute of emphatic veneration",
            "subindex": "strategic ploy stratagem",
            "lore": "A cacophonous chorale pours from the emitters and augmented throats of the Cult Mechanicus’ faithful, venerating the Omnissiah in deafening and disconcerting frequencies of praise.",
            "when": "Start of your Movement phase.",
            "target": "One CULT MECHANICUS unit from your army and one enemy unit within 18'' of it. ",
            "effect": "That enemy unit must take a Battle-shock test. If that test is failed, until the start of your next Command phase, each time a model in that enemy unit makes an attack, subtract 1 from the Hit roll.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "blue"
        },
        {
            "name": "litany of the electromancer",
            "subindex": "strategic ploy stratagem",
            "lore": "Summoning the spark of the Machine God's divinity that burns within them, the Omnissiah’s faithful manifest blazing auras of energy that lay low the unbeliever.",
            "when": "Your Shooting phase.",
            "target": "One CULT MECHANICUS unit from your army.",
            "effect": "Roll one D6 for each enemy unit within 6'' of one or more CULT MECHANICUS models in your unit, adding 1 to the result if that model is an ELECTRO-PRIEST. On a 5+, that enemy unit suffers D3 mortal wounds.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "blue"
        },
        {
            "name": "luminescent blessing",
            "subindex": "battle tactic stratagem",
            "lore": "As the cohorts of the Omnissiah recite their dazzling consecration, energy is redirected to infuse masterwork bionics and even the lambent glow of protective fields ignites in a halo of divine defence.",
            "when": "Your opponent’s Shooting phase, just after an enemy unit has selected its targets.",
            "target": "One CULT MECHANICUS unit from your army that was selected as the target of one or more of the attacking unit’s attacks.",
            "effect": "Until the end of the phase, CULT MECHANICUS models in your unit have a 4+ invulnerable save.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "red"
        }
    ]
}