{
    "detachmentName": "explorator maniple",
    "detachmentRule": [
        {
            "name": "acquisition at any cost",
            "lore": "In their eternal quest for the acquisition of knowledge and technology, Tech-Priests require superhuman efforts from the troops under their command.",
            "description": "At the start of your Command phase, select one objective marker. Until the start of your next Command phase, that objective marker is your Acquisition objective marker. Each time an ADEPTUS MECHANICUS model from your army makes an attack, if that model’s unit is within range of your Acquisition objective marker, or if the target of that attack is within range of your Acquisition objective marker, re-roll a Wound roll of 1."
        }
    ],
    "enhacements": [
        {
            "name": "Magos",
            "points": 15,
            "lore": "Magi are masters of fiercely guarded knowledge, pursuing esoteric agendas at all costs. No risk is too great and no gambit too unwise in their ceaseless and predatory acquisition of ancient lore.",
            "description": "TECH-PRIEST model only. At the end of your Command phase, if the bearer is within range of your Acquisition objective marker, roll one D6: on a 4+, you gain 1CP."
        },
        {
            "name": "Genetor",
            "points": 25,
            "lore": "Cyborg interfaces, genetic manipulation and alchemical behavioural modification are all avenues of interest to Genetors, and their enhanced creations are formidable in protecting their master’s divine work.",
            "description": "TECH-PRIEST model only. While the bearer is leading a unit that is within range of your Acquisition objective marker, models in that unit have a 4+ invulnerable save."
        },
        {
            "name": "Logis",
            "points": 20,
            "lore": "Data-vores and biocogitators, logi amass huge stores of information. They analyse data from thousands of sources, rationalising every weak point the foe has. It is a fool indeed that stands before a logi and their prize.",
            "description": "TECH-PRIEST model only. While the bearer is leading a unit, each time a model in that unit makes an attack that targets a unit within range of your Acquisition objective marker, add 1 to the Hit roll."
        },
        {
            "name": "Artisan",
            "points": 15,
            "lore": "Artisans create wondrous artefacts of war. They install circuits of such beauty, and capacitor-nodes of such fine calibration, that their machine spirits respond with divine gratitude.",
            "description": "TECH-PRIEST model only. While the bearer is leading a unit that is within range of your Acquisition objective marker, once per phase, you can change the result of one Hit roll, one Wound roll or one saving throw made for that unit to an unmodified 6."
        }
    ],
    "stratagems": [
        {
            "name": "cached acquisition",
            "subindex": "epic deed stratagem",
            "lore": "Death is irrelevant compared to the hallowed duty of securing the Omnissiah's knowledge for future retrieval.",
            "when": "Any phase.",
            "target": "One ADEPTUS MECHANICUS unit from your army that was just destroyed while it was within range of an objective marker you controlled. You can use this Stratagem on that unit even though it was just destroyed.",
            "effect": "That objective marker remains under your control, even if you have no models within range of it, until your opponent controls it at the start or end of any turn.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "green"
        },
        {
            "name": "priority reclamation",
            "subindex": "battle tactic stratagem",
            "lore": "Retrieval of the most sacred and ancient fragments of technology is embedded in loops of alpha-logic.",
            "when": "Fight phase, just before an ADEPTUS MECHANICUS unit from your army Consolidates.",
            "target": "That ADEPTUS MECHANICUS unit.",
            "effect": "Until the end of the phase, each time a model in your unit makes a Consolidation move, it can move up to 6'' instead of up to 3'', provided your unit ends that Consolidation move within range of your Acquisition objective marker.",
            "restrictions":"You cannot target a unit with this Stratagem if it is within 3'' of one or more enemy units.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "green"
        },
        {
            "name": "infoslave skull",
            "subindex": "wargear stratagem",
            "lore": "Mono-task infoslave skulls range ahead to assess potential sites that must be investigated.",
            "when": "Your Command phase.",
            "target": "One TECH-PRIEST model from your army and one objective marker within 24'' of that model (excluding your Acquisition objective marker].",
            "effect": "Until the start of your next Command phase, that objective marker is also considered to be one of your Acquisition objective markers for all rules purposes.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "blue"
        },
        {
            "name": "auto-oracular retrieval",
            "subindex": "battle tactic stratagem",
            "lore": "With a surge of targeting data from the war engine as its hatches slam open, the warriors inside pour out with weapons already trained unerringly on the foe.",
            "when": "Your Shooting phase.",
            "target": "One ADEPTUS MECHANICUS unit from your army that disembarked from a TRANSPORT this turn.",
            "effect": "Until the end of the phase, each time a model in your unit makes a ranged attack that targets an enemy unit within range of your Acquisition objective marker, add 1 to the Wound roll.",
            "icon": [
                ""
            ],
            "cp": 2,
            "color": "blue"
        },
        {
            "name": "incense exhausts",
            "subindex": "wargear stratagem",
            "lore": "The machine spirits of sanctified war engines can be entreated to release clouds of incense laced with radioactive particles, veiling the faithful from the foe.",
            "when": "Your opponent’s Shooting phase, just after an enemy unit has selected its targets.",
            "target": "One ADEPTUS MECHANICUS INFANTRY unit from your army that was selected as the target of one or more of the attacking unit’s attacks, and one friendly ADEPTUS MECHANICUS SMOKE unit within 6'' of it.",
            "effect": "Until the end of the phase, both of those units have the Stealth ability and the Benefit of Cover.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "red"
        },
        {
            "name": "reactive safeguard",
            "subindex": "strategic ploy stratagem",
            "lore": "Holy data must be hoarded at all costs, and thickly armoured war engines offer swift and secure vaults.",
            "when": "Your opponent’s Charge phase, just after an enemy unit has declared a charge.",
            "target": "One ADEPTUS MECHANICUS INFANTRY nit from your army within range of your Acquisition objective marker that was selected as a target of that charge, and one friendly ADEPTUS MECHANICUS TRANSPORT.",
            "effect": "Your unit can embark within that TRANSPORT.",
            "restrictions":"Every model in your unit must be within 3'' of that TRANSPORT and there must be sufficient transport capacity to embark the entire unit.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "red"
        }
    ]
}