{
    "detachmentName": "rad-cohort",
    "detachmentRule": [
        {
            "name": "rad-bombardment",
            "lore": "Whether as a result of natural phenomena, apocalyptic internecine strife or calamitous accidents, many forge worlds are heavily irradiated. When holy wars of requisition are unleashed, the Tech-Priests think nothing of turning this invisible curse upon their foes, bombarding the battlefield with deadly radiation prior to an assault.",
            "description": "At the start of the first battle round, select one of the following Hyper-adaptations to be active for TYRANIDS units from your army until the end of the battle:"
        }
    ],
    "enhacements": [
        {
            "name": "Archived Purge Protocols",
            "points": 10,
            "lore": "Having witnessed the rad-bombardment of a hundred battlefields, this experienced commander can call upon the minutiae of those servo-recorded conflicts, feeding adjusted protocols into the data-nets of their warriors, granting them a hyper-predictive combat awareness to perfectly defeat the foe as they stumble out from their irradiated positions.",
            "description": "SKITARII MARSHAL model only. At the start of the battle round, you can select one friendly SKITARII unit within 12'' of the bearer. Until the start of the next battle round, if the Protector Imperative is active for your army, the Conqueror Imperative is active for that unit instead, and if the Conqueror Imperative is active for your army, the Protector Imperative is active for that unit instead."
        },
        {
            "name": "Excoriating Emanation",
            "points": 25,
            "lore": "This devoted follower of the Machine God is wreathed in a dense, radioactive fog that shrouds their allies from the sights and scanners of the foe.",
            "description": "ADEPTUS MECHANICUS model only. While the bearer is leading a unit, models in that unit have the Stealth ability."
        },
        {
            "name": "Master Annihilator",
            "points": 35,
            "lore": "With a mind blissfully unsullied by the passions common to the flesh, this zealot has become a peerless annihilator, commanding ruthless technology to eliminate all life before them. So blessed, they impart the detached logic of their priorities unto their minions.",
            "description": "ADEPTUS MECHANICUS model only. While the bearer is leading a unit, ranged weapons equipped by models in that unit have the [SUSTAINED HITS 1] ability."
        },
        {
            "name": "Omni-steriliser",
            "points": 20,
            "lore": "This weapon exemplifies the Adeptus Mechanicus' disdain for organic life. All flesh, blood and bone caught in its searing beams are reduced to inert atoms in an instant.",
            "description": "ADEPTUS MECHANICUS model only. Add 3 to the Attacks characteristic of the bearer’s ranged weapons. In addition, the bearer’s ranged weapons have the [ANTI-INFANTRY 2+] and [ANTI-MONSTER 4+] abilities."
        }
    ],
    "stratagems":[
        {
            "name": "rapid regeneration",
            "subindex": "battle tactic stratagem",
            "lore": "Prey stare in horror as chitinous armour regrows and flesh, muscle and sinew knots back together.",
            "when": "Your opponent’s Shooting phase or the Fight phase, just after an enemy unit has selected its targets.",
            "target": "One TYRANIDS unit from your army that was selected as the target of one or more of the attacking unit’s attacks.",
            "effect": "Until the end of the phase, models in your unit have the Feel No Pain 6+ ability. If your unit is within Synapse Range of your army, models in your unit have the Feel No Pain 5+ ability instead.",
            "icon" : [""],
            "cp":1,
            "color":"green"
        },
        {
            "name": "adrenal surge",
            "subindex": "battle tactic stratagem",
            "lore": "These warrior organisms destroy all as their adrenaline surges.",
            "when": "Fight phase.",
            "target": "Up to two TYRANIDS units from your army that are within Synapse Range of your army and are eligible to fight, or one other TYRANIDS unit from your army that is eligible to fight.",
            "effect": "Until the end of the phase, each time a model in any of those selected units makes an attack, an unmodified Hit roll of 5+ scores a Critical Hit.",
            "icon" : [""],
            "cp":2,
            "color":"green"
        },
        {
            "name": "death frenzy",
            "subindex": "strategic ploy stratagem",
            "lore": "Tyranids care nothing for self-preservation, lashing out even in death.",
            "when": "Fight phase, just after an enemy unit has selected its targets.",
            "target": "One TYRANIDS unit from your army that was selected as the target of one or more of the attacking unit’s attacks.",
            "effect": "Until the end of the phase, each time a model in your unit is destroyed, if that model has not fought this phase, roll one D6: on a 4+, do not remove it from play. The destroyed model can fight after the attacking model’s unit has finished making its attacks, and is then removed from play.",
            "icon" : [""],
            "cp":1,
            "color":"green"
        },
        {
            "name": "overrun",
            "subindex": "strategic ploy stratagem",
            "lore": "Tyranids in battle form an unstoppable avalanche of flesh and chitin that buries the foe alive.",
            "when": "Fight phase, just before a TYRANIDS unit from your army Consolidates.",
            "target": "That TYRANIDS unit.",
            "effect": "Until the end of the phase, each time your unit Consolidates, models in it can move an additional 3'' as long as your unit can end that move within Engagement Range of one or more enemy units. If your unit is within Synapse Range of your army and not within Engagement Range of any enemy units, instead of making that Consolidation move, it can make a Normal move of up to 6''",
            "icon" : [""],
            "cp":1,
            "color":"green"
        },
        {
            "name": "predatory imperative",
            "subindex": "strategic ploy stratagem",
            "lore": "Guided by the instincts of leader-beasts, the swarm can be tasked with focusing its hunting instincts.",
            "when": "Your Command phase.",
            "target": "Up to two TYRANIDS units from your army that are within Synapse Range of your army, or one other TYRANIDS unit from your army.",
            "effect": "Select one Hyper-adaptation. Until the start of your next Command phase, that Hyper-adaptation is active for those selected units in addition to any other that may be active for your army.",
            "restrictions":"You cannot select the same Hyper-adaptation you selected at the start of the first battle round.",
            "icon" : [""],
            "cp":1,
            "color":"blue"
        },
        {
            "name": "endless swarm",
            "subindex": "strategic ploy stratagem",
            "lore": "As the battle rages, more organisms pour in to bolster the swarms.",
            "when": "Your Command phase.",
            "target": "Up to two ENDLESS MULTITUDE units from your army that are within Synapse Range of your army, or one other ENDLESS MULTITUDE unit from your army.",
            "effect": "You can return up to D3+3 destroyed models to each of the selected units.",
            "icon" : [""],
            "cp":1,
            "color":"blue"
        }
    ]

}