{
    "symbol": "votann-symbol",
    
    "description": "The Leagues of Votann have emerged from the depths of the galactic core. To face their armies in battle is to stand before an armoured avalanche that crushes all in its path. It is to be appraised and then brusquely dealt with by attackers who see you as little more than an obstruction to profit – or worse, as a hated nemesis whose annihilation is worth any cost. To their partners in trade and war, the Kin are invaluable allies. Yet those they deem a risk to their peoples’ survival face destruction, meted out with the same relentless rigour that the Kin apply to all their undertakings.",
    "rules": [
        {
            "name": "eye of the ancestors",
            "lore": "The Kin are a highly practical people in every area of life, not least in war. Their leaders make swift and careful calculations before and during battle, constantly striving to determine if the potential reward of conflict is worth the inevitable loss of resources and precious Kin lives. An essential part of this is what is known as casting the Eye of the Ancestors, through which Kin commanders assess the greatest enemy threats, mark weak points in their defences and determine what forces are needed to overcome both.",
            "description": "<p>If your Army Faction is <strong>LEAGUES OF VOTANN </strong>, each time an enemy unit destroys a <strong>LEAGUES OF VOTANN </strong> unit from your army, that enemy unit gains 1 Judgement token. An enemy unit can never have more than 2 Judgement tokens (any further Judgement tokens a unit would gain beyond this are ignored). </p> <br/> <p> Each time a model from your army with this ability makes an attack that targets a unit that has one or more Judgement tokens, until that model’s attacks have been resolved, apply the relevant bonus from the table below to that attack. </p> <br/> <br/>                                                                                <div class= 'grid grid-cols-3'>  <div class='bg-zinc-200 border-solid border-2 my-2 border-white flex justify-center col-span-1'> <strong> 1 token </strong> </div> <div class='flex justify-center my-2  col-span-2 pl-2'><span><strong> Eminent Threat:</strong> Add 1 to the Hit roll.</span> </div>                <div class='bg-zinc-200 border-solid border-2 my-2 border-white flex justify-center col-span-1'> <strong> 2 tokens  </strong> </div> <div class='flex justify-center my-2  col-span-2 pl-2'> <span><strong>Now We’ve Got a Grudge to Settle:</strong> Add 1 to the Hit roll and add 1 to the Wound roll.</span> </div>            </div> "
        }
    ],
    "detachments": [
        "oathband"
    ],
    "units": [
        "brôkhyr iron-master",
        "brôkhyr thunderkyn",
        "cthonian beserks",
        "einhyr champion",
        "einhyr hearthguard",
        "grimnyr",
        "hearthkyn warriors",
        "hekaton land fortress",
        "hernkyn pioneers",
        "hernkyn Yaegirs",
        "kâhl",
        "sagitaur",
        "ûthar the Destined"
    ],

  "characters": [
    {"unitName": "Brôkhyr Iron-master", "basicPoints": 65},
    {"unitName": "Einhyr Champion", "basicPoints": 60},
    {"unitName": "Grimnyr", "basicPoints": 65},
    {"unitName": "Kâhl", "basicPoints": 70},
    {"unitName": "Ûthar the Destined", "basicPoints": 80}
  ],
  "battleline": [
    {"unitName": "Hearthkyn Warriors", "basicPoints": 100}
  ],
  "dedicatedTransports": [
    {"unitName": "Sagitaur", "basicPoints": 115}
  ],
  "other": [
    {"unitName": "Brôkhyr Thunderkyn", "basicPoints": 85},
    {"unitName": "Cthonian Beserks", "basicPoints": 100},
    {"unitName": "Einhyr Hearthguard", "basicPoints": 150},
    {"unitName": "Hekaton Land Fortress", "basicPoints": 225},
    {"unitName": "Hernkyn Pioneers", "basicPoints": 90},
    {"unitName": "Hernkyn Yaegirs", "basicPoints": 90}
  ]
}