{
    "symbol": "sororitas-symbol",
    
    "detachments": [
        "hallowed martyrs"
    ],
    "rules": [
        {
            "name": "acts of faith",
            "lore": "The infamous war cry of the Orks is known and feared throughout the galaxy. When it echoes across the battlefield, bellowed from hundreds or even thousands of greenskin mouths, even the most stalwart warriors fear the onslaught to come.",
            "description": "If your Army Faction is <strong>ADEPTA SORORITAS</strong>, each unit from your army with this ability can perform one Act of Faith per phase. This is done using Miracle dice. <br/><br/> <strong> GAINING MIRACLE DICE </strong><br/> <br/><p> If your Army Faction is ADEPTA SORORITAS, you gain 1 Miracle dice:</p> <li>At the start of each turn. </li> <li>Each time an ADEPTA SORORITAS unit from your army is destroyed.</li> <br/> <p> Each time you gain a Miracle dice, roll one D6. The number you roll is the value of that Miracle dice. This value cannot be changed or re-rolled, unless a rule specifically states otherwise. Keep your Miracle dice to one side – this is your Miracle dice pool. </p><br/> <strong>PERFORMING AN ACT OF FAITH</strong> <br/> <p> Before making a dice roll for a model or unit from your army with the Acts of Faith ability, if you have one or more dice in your Miracle dice pool, that unit can perform an Act of Faith. If it does, select one of the dice from your Miracle dice pool to substitute that dice roll (if a roll involves more than one dice, e.g. a Charge roll or Battle-shock test, only a single dice can be substituted). The dice that is being substituted is not rolled; instead the value of the selected Miracle dice is used as if it had been rolled (this counts as an unmodified dice roll of that value for all rules purposes). Each Miracle dice can only be selected for substitution once. Once all Miracle dice substitutions have been made, remove the chosen Miracle dice from your Miracle dice pool, and roll all remaining, unsubstituted dice that are a part of the dice roll. You can use Miracle dice when a unit performs an Act of Faith for any of the following types of dice roll </p> <br/> <li>Advance roll </li> <li>Battle-shock test </li> <li>Charge roll </li> <li>Damage roll </li> <li>Hit roll </li> <li>Saving throw </li> <li>Wound roll </li> "
        }
    ],
    "description": "The Adepta Sororitas, also known as the Sisters of Battle, are an elite sisterhood of warriors raised from infancy to believe unquestioningly in the supreme power of the Emperor of Mankind. The perfervid, unshakeable nature of their faith is a potent weapon indeed, manifesting as divine inspiration that drives the Sisters of Battle to incredible feats of martial prowess. Their fanatical devotion and unwavering purity are a bulwark against corruption, heresy and alien attack, and once battle has been joined they will stop at nothing until their enemies are utterly crushed.",
    "units": [
        "aestred thurga and agathae dolan",
        "arco-flagellants",
        "battle sisters squad",
        "canoness",
        "castigator",
        "celestian sacresants",
        "crusaders",
        "daemonifuge",
        "death cult assassins",
        "dialogus",
        "dogmata",
        "dominion squad",
        "exorcist",
        "hospitaller",
        "imagifier",
        "immolator",
        "junith eruita",
        "missionary",
        "mortifiers",
        "morvenn vahl",
        "palatine",
        "paragon warsuits",
        "penitent engines",
        "preacher",
        "repentia squad",
        "retributor squad",
        "saint celestine",
        "seraphim squad",
        "sisters novitiate squad",
        "sororitas rhino",
        "triumph of saint katherine",
        "zephyrim squad"
    ],
    "characters": [
      {"unitName": "Aestred Thurga And Agathae Dolan", "basicPoints": 120},
      {"unitName": "Canoness", "basicPoints": 90},
      {"unitName": "Daemonifuge", "basicPoints": 150},
      {"unitName": "Dialogus", "basicPoints": 80},
      {"unitName": "Dogmata", "basicPoints": 100},
      {"unitName": "Hospitaller", "basicPoints": 70},
      {"unitName": "Imagifier", "basicPoints": 85},
      {"unitName": "Junith Eruita", "basicPoints": 160},
      {"unitName": "Missionary", "basicPoints": 60},
      {"unitName": "Morvenn Vahl", "basicPoints": 200},
      {"unitName": "Palatine", "basicPoints": 75},
      {"unitName": "Preacher", "basicPoints": 55},
      {"unitName": "Saint Celestine", "basicPoints": 180},
      {"unitName": "Triumph Of Saint Katherine", "basicPoints": 220}
      ],
      "battleline": [
        "Battle Sisters Squad"
      ],
      "dedicatedTransports": [
        "Immolator",
        "Sororitas Rhino"
      ],
      "Fortifications": [
        "Arco-flagellants",
        "Castigator",
        "Celestian Sacresants",
        "Crusaders",
        "Death Cult Assassins",
        "Dominion Squad",
        "Exorcist",
        "Mortifiers",
        "Paragon Warsuits",
        "Penitent Engines",
        "Repentia Squad",
        "Retributor Squad",
        "Seraphim Squad",
        "Sisters Novitiate Squad",
        "Zephyrim Squad"
      ]
}