{
    "twin-linked": {
        "lore": "Dual weapons are often grafted to the same targeting system for greater lethality.",
        "description": "Weapons with [TWIN-LINKED] in their profile are known as Twin-linked weapons. Each time an attack is made with such a weapon, you can re-roll that attack’s Wound roll.",
        "summary": []
    },
    "lethal hits": {
        "lore": "Some weapons can inflict fatal injuries on any foe, no matter their resilience.",
        "description": "Weapons with [LETHAL HITS] in their profile are known as Lethal Hits weapons. Each time an attack is made with such a weapon, a Critical Hit automatically wounds the target."
    },
    "blast": {
        "lore": "High-explosives can fell several warriors in a single blast, but firing them where your comrades will get caught in the ensuing detonation is simply unwise.",
        "description": "Weapons with [BLAST] in their profile are known as Blast weapons, and they make a random number of attacks. Each time you determine how many attacks are made with a Blast weapon, add 1 to the result for every five models that were in the target unit when you selected it as the target (rounding down). Blast weapons can never be used to make attacks against a unit that is within Engagement Range of one or more units from the attacking model’s army (including its own unit).",
        "summary": [
            "Add 1 to the Attacks characteristic for every five models in the target unit (rounding down).",
            "Can never be used against a target that is within Engagement Range of any units from the attacking model’s army (including its own)."
        ]
    },
    "devastating wounds": {
        "lore": "Some weapons can inflict strikes of such power that they make a mockery of armour",
        "description": "Weapons with [DEVASTATING WOUNDS] in their profile are known as Devastating Wounds weapons. Each time an attack is made with such a weapon, if that attack scores a Critical Wound, no saving throw of any kind can be made against that attack (including invulnerable saving throws). Such attacks are only allocated to models after all other attacks made by the attacking unit have been allocated and resolved.",
        "summary": [
            "Saving throws cannot be made against Critical Wounds scored by this weapon (including invulnerable saving throws)."
        ]
    },
    "ignores cover": {
        "lore": "Some weapons are designed to root enemy formations out of entrenched positions.",
        "description": "Weapons with [IGNORES COVER] in their profile are known as Ignores Cover weapons. Each time an attack is made with such a weapon, the target cannot have the Benefit of Cover against that attack.",
        "summary": []
    },
    "heavy": {
        "lore": "Heavy weapons are amongst the biggest guns on the battlefield, but require bracing to fire at full effect and are unwieldy to bring to bear at close quarters.",
        "description": "Weapons with [HEAVY] in their profile are known as Heavy weapons. Each time an attack is made with such a weapon, if the attacking model’s unit Remained Stationary this turn, add 1 to that attack’s Hit roll.",
        "summary": [
            "Add 1 to Hit rolls if the bearer’s unit Remained Stationary this turn."
        ]
    },
    "rapid fire": {
        "lore": "Rapid fire weapons are capable of long-ranged precision shots or controlled bursts at nearby targets.",
        "description": "Weapons with [RAPID FIRE X] in their profile are known as Rapid Fire weapons. Each time such a weapon targets a unit within half that weapon’s range, the Attacks characteristic of that weapon is increased by the amount denoted by ‘x’.",
        "summary": [
            "[RAPID FIRE X]: Increase the Attacks by ‘x’ when targeting units within half range."
        ]
    },
    "assault": {
        "lore": "Assault weapons fire so indiscriminately that they can be shot from the hip as warriors dash forward.",
        "description": "Weapons with [ASSAULT] in their profile are known as Assault weapons. If a unit that Advanced this turn contains any models equipped with Assault weapons, it is still eligible to shoot in this turn’s Shooting phase. When such a unit is selected to shoot, you can only resolve attacks using Assault weapons its models are equipped with.",
        "summary": [
            "Can be shot even if the bearer’s unit Advanced."
        ]
    },
    "pistol": {
        "lore": "Pistols can be wielded even at point-blank range.",
        "description": "Weapons with [PISTOL] in their profile are known as Pistols. If a unit contains any models equipped with Pistols, that unit is eligible to shoot in its controlling player’s Shooting phase even while it is within Engagement Range of one or more enemy units. When such a unit is selected to shoot, it can only resolve attacks using its Pistols and can only target one of the enemy units it is within Engagement Range of. In such circumstances, a Pistol can target an enemy unit even if other friendly units are within Engagement Range of the same enemy unit.   If a model is equipped with one or more Pistols, unless it is a MONSTER or VEHICLE model, it can either shoot with its Pistols or with all of its other ranged weapons. Declare whether such a model will shoot with its Pistols or its other ranged weapons before selecting targets.",
        "summary": [
            "Can be shot even if the bearer’s unit is within Engagement Range of enemy units, but must target one of those enemy units.",
            "Cannot be shot alongside any other non-Pistol weapon (except by a MONSTER or VEHICLE)."
        ]
    },
    "torrent": {
        "lore": "Torrent weapons shoot clouds of fire, gas or other lethal substances that few foes can hope to evade.",
        "description": "Weapons with [TORRENT] in their profile are known as Torrent weapons. Each time an attack is made with such a weapon, that attack automatically hits the target.",
        "summary": []
    },
    "lance": {
        "lore": "Lance weapons are deadly on the charge.",
        "description": "Weapons with [LANCE] in their profile are known as Lance weapons. Each time an attack is made with such a weapon, if the bearer made a Charge move this turn, add 1 to that attack’s Wound roll.",
        "summary": []
    },
    "indirect fire": {
        "lore": "Indirect fire weapons launch munitions over or around intervening obstacles – nowhere is safe from their fury.",
        "description": "Weapons with [INDIRECT FIRE] in their profile are known as Indirect Fire weapons, and attacks can be made with them even if the target is not visible to the attacking model. These attacks can destroy enemy models in a target unit even though none may have been visible to the attacking unit when you selected that target.",
        "summary": [
            "Can target and make attacks against units that are not visible to the attacking unit.",
            "If no models are visible in a target unit when it is selected, then when making an attack against that target with an Indirect Fire weapon, subtract 1 from that attack’s Hit roll and the target has the Benefit of Cover against that attack."
        ]
    },
    "melta": {
        "lore": "Melta weapons are powerful heat rays whose fury is magnified at close range.",
        "description": "Weapons with [MELTA X] in their profile are known as Melta weapons. Each time an attack made with such a weapon targets a unit within half that weapon’s range, that attack’s Damage characteristic is increased by the amount denoted by ‘x’.",
        "summary": [
            "[MELTA X]: Increase the Damage by ‘x’ when targeting units within half range."
        ]
    },
    "precision": {
        "lore": "Precision attacks can pick high-value targets out in a crowd, whether through the unerring aim of a sniper or the pinpoint accuracy of a blade-master’s strike.",
        "description": "Weapons with [PRECISION] in their profile are known as Precision weapons. Each time an attack made with such a weapon successfully wounds an Attached unit (see Leader ability), if a CHARACTER model in that unit is visible to the attacking model, the attacking model’s player can choose to have that attack allocated to that CHARACTER model instead of following the normal attack sequence.",
        "summary": [
            "When targeting an Attached unit, the attacking model’s player can have the attack allocated to a CHARACTER model in that unit visible to the bearer."
        ]
    },
    "harponeed": {
        "lore": "",
        "description": "After the bearer has shot with this weapon, select one enemy MONSTER or VEHICLE unit hit by one or more of those attacks. Until the end of the turn, each time the bearer selects that unit as a target of a charge, add 2 to the Charge roll.",
        "summary": []
    },
    "one shot": {
        "lore": "",
        "description": "The bearer can only shoot with this weapon once per battle.",
        "summary": []
    },
    "psychic": {
        "lore": "",
        "description": "Wounds made by this weapon are considered to be inflicted by a psychic attack.",
        "summary": []
    },
    "hazardous": {
        "lore": "Weapons powered by unstable and dangerous energy sources pose a substantial risk to the wielder every time they are used.",
        "description": "Weapons with [HAZARDOUS] in their profile are known as Hazardous weapons. Each time a unit is selected to shoot or fight, if one or more models attack with Hazardous weapons, then after that unit has resolved all of its attacks, you must take one Hazardous test for each Hazardous weapon that was just used by rolling one D6. For each roll of 1, that test is failed and one model in that unit equipped with a Hazardous weapon is destroyed (selected by the controlling player), unless that model is a CHARACTER, MONSTER or VEHICLE, in which case it suffers 3 mortal wounds instead. Note that if you selected a CHARACTER model in an Attached unit, the mortal wounds suffered must be allocated to that model first, even if there is another model in that unit that has lost one or more wounds or has had attacks allocated to it this phase.",
        "summary": [
            "After a unit shoots or fights, roll one Hazardous test (one D6) for each Hazardous weapon used. For each 1, one model equipped with a Hazardous weapon is destroyed (CHARACTERS, MONSTERS and VEHICLES suffer 3 mortal wounds instead)."
        ]
    },
    "sustained hits": {
        "lore": "Some weapons strike in a flurry of blows, tearing the foe apart with relentless ferocity.",
        "description": "Weapons with [SUSTAINED HITS X] in their profile are known as Sustained Hits weapons. Each time an attack is made with such a weapon, if a Critical Hit is rolled, that attack scores a number of additional hits on the target as denoted by ‘x’.",
        "summary": [
            "[SUSTAINED HITS X]: Each Critical Hit scores ‘x’ additional hits on the target."
        ]
    },
    "extra attacks": {
        "lore": "Some warriors ride to battle atop trusty mounts that gore and trample nearby foes. Others wield combat weapons that deliver a frenzy of additional blows.",
        "description": "Weapons with [EXTRA ATTACKS] in their profile are known as Extra Attacks weapons. Each time the bearer of such a weapon fights, it can make attacks with that weapon in addition to the one it chooses to fight with. The number of attacks made with an Extra Attacks weapon cannot be modified by other rules.",
        "summary": [
            "The bearer can attack with this weapon in addition to any other weapons it can make attacks with."
        ]
    },
    "anti": {
        "lore": "Certain weapons are the bane of a particular foe.",
        "description": "Weapons with [ANTI-KEYWORD X+] in their profile are known as Anti weapons. Each time an attack is made with such a weapon against a target with the keyword after the word ‘Anti-’, an unmodified Wound roll of ‘x+’ scores a Critical Wound.",
        "summary": [
            "[ANTI-KEYWORD X+]: An unmodified Wound roll of ‘x+’ against a target with the matching keyword scores a Critical Wound."
        ]
    },
    "bubblechukka": {
        "lore": "",
        "description": "Before selecting targets for this weapon, roll one D6 to determine which of its profiles to make attacks with, comparing the result with the numbers shown on the left."
    },
    "leader": {
        "lore": "Mighty heroes fight at the forefront of battle.",
        "description": "Some CHARACTER units have ‘Leader’ listed on their datasheets. Such CHARACTER units are known as Leaders, and the units they can lead – known as their Bodyguard units – are listed on their datasheet. ///  /n During the Declare Battle Formations step, for each Leader in your army, if your army also includes one or more of that Leader’s Bodyguard units, you can select one of those Bodyguard units. That Leader will then attach to that Bodyguard unit for the duration of the battle and is said to be leading that unit. Each Bodyguard unit can only have one Leader attached to it. /// /n  While a Bodyguard unit contains a Leader, it is known as an Attached unit and, with the exception of rules that are triggered when units are destroyed (pg 12), it is treated as a single unit for all rules purposes. Each time an attack targets an Attached unit, until the attacking unit has resolved all of its attacks, you must use the Toughness characteristic of the Bodyguard models in that unit, even if a Leader in that unit has a different Toughness characteristic. Each time an attack sucessfully wounds an Attached unit, that attack cannot be allocated to a CHARACTER model in that unit, even if that CHARACTER model has lost one or more wounds or has already had attacks allocated to it this phase. As soon as the last Bodyguard model in an Attached unit has been destroyed, any attacks made against that unit that have yet to be allocated can then be allocated to CHARACTER models in that unit.",
        "summary": [
            "Before the battle, CHARACTER units with the Leader ability can be attached to one of their Bodyguard units to form an Attached unit.",
            "Attached units can only contain one Leader.",
            "Attacks cannot be allocated to CHARACTER models in Attached units."
        ]
    },
    "infiltrators": {
        "lore": "Many armies employ reconnaissance units who can sit concealed, waiting for the right moment to strike.",
        "description": "During deployment, if every model in a unit has this ability, then when you set it up, it can be set up anywhere on the battlefield that is more than 9'' horizontally away from the enemy deployment zone and all enemy models.",
        "summary": []
    },
    "lone operative": {
        "lore": "Assassins and other covert agents are difficult to track and pinpoint in the swirling maelstrom of battle.",
        "description": "Unless part of an Attached unit (see Leader), this unit can only be selected as the target of a ranged attack if the attacking model is within 12''.",
        "summary": []
    },
    "stealth": {
        "lore": "Some warriors are masters of disguise and concealment..",
        "description": "If every model in a unit has this ability, then each time a ranged attack is made against it, subtract 1 from that attack’s Hit roll.",
        "summary": []
    },
    "deadly demise": {
        "lore": "From detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.",
        "description": "Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6'' of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6'').",
        "summary": [
            "Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6'' suffers ‘x’ mortal wounds."
        ]
    },
    "feel no pain": {
        "lore": "Some warriors refuse to be laid low, even by what should be fatal wounds.",
        "description": "Some models have ‘Feel No Pain x+’ listed in their abilities. Each time a model with this ability suffers damage and so would lose a wound (including wounds lost due to mortal wounds), roll one D6: if the result is greater than or equal to the number denoted by ‘x’, that wound is ignored and is not lost. If a model has more than one Feel No Pain ability, you can only use one of those abilities each time that model suffers damage and so would lose a wound.",
        "summary": [
            "Feel No Pain x+: Each time this model would lose a wound, roll one D6: if the result equals or exceeds ‘x’, that wound is not lost."
        ]
    },
    "deep strike": {
        "lore": "Some units make their way to battle via tunnelling, teleportation, high-altitude descent or other extraordinary means that allow them to appear suddenly in the thick of the fighting.",
        "description": "During the Declare Battle Formations step, if every model in a unit has this ability, you can set it up in Reserves instead of setting it up on the battlefield. If you do, in the Reinforcements step of one of your Movement phases you can set up this unit anywhere on the battlefield that is more than 9'' horizontally away from all enemy models.",
        "summary": [
            "Unit can be set up in Reserves instead of on the battlefield.",
            "Unit can be set up in your Reinforcements step, more than 9'' horizontally away from all enemy models."
        ]
    },
    "fights first": {
        "lore": "Some warriors attack with blinding speed, landing their blows before their foes can react.",
        "description": "Units with this ability that are eligible to fight do so in the Fights First step, provided every model in the unit has this ability.",
        "summary": []
    },
    "hover": {
        "lore": "Some aircraft can use vectored thrusters or anti-grav technology to hover over the battlefield, the better to hunt their prey or deploy embarked troops.",
        "description": "Some AIRCRAFT models have ‘Hover’ listed in their abilities. When you are instructed to Declare Battle Formations, before doing anything else, you must first declare which models from your army with this ability will be in Hover mode. /n If a model is in Hover mode, then until the end of the battle, its Move characteristic is changed to 20'', it loses the AIRCRAFT keyword and it loses all associated rules for being an AIRCRAFT model. Models in Hover mode do not start the battle in Reserves, but you can choose to place them into Strategic Reserves following the normal rules if you wish.",
        "summary": []
    },
    "scouts": {
        "lore": "Scouts form the vanguard of many armies. Unnoticed by the enemy, they range ahead of the main force.",
        "description": "Some units have ‘Scouts x''’ listed in their abilities. If every model in a unit has this ability, then at the start of the first battle round, before the first turn begins, it can make a Normal move of up to x''' as if it were your Movement phase – as can any DEDICATED TRANSPORT model such a unit starts the battle embarked within (provided only models with this ability are embarked within that DEDICATED TRANSPORT model). A unit that moves using this ability must end that move more than 9''' horizontally away from all enemy models. If both players have units that can do this, the player who is taking the first turn moves their units first.",
        "summary": [
            "Scouts x'' Unit can make a Normal move of up to x'' before the first turn begins.",
            "If embarked in a DEDICATED TRANSPORT, that DEDICATED TRANSPORT can make this move instead",
            "Must end this move more than 9'' horizontally away from all enemy models"
        ]
    },
    "synapse": {
        "lore": "Some Tyranids serve as synaptic conduits or nodal relays through which a portion of the Hive Mind’s iron will flows, overriding the natural instincts of the swarm to direct the teeming warrior-beasts to function as a single, gestalt organism on the battlefield.",
        "description": "If your Army Faction is TYRANIDS, while a TYRANIDS unit from your army is within 6'' of one or more friendly SYNAPSE models, that TYRANIDS unit is said to be within Synapse Range of that model and of your army. Each time a TYRANIDS unit from your army takes a Battle-shock test, if it is within Synapse Range of your army, take that test on 3D6 instead of 2D6.",
        "summary": [
            
        ]
    },
    "oath of moment": {
        "lore": "In battle, Space Marines swear mighty oaths to destroy the enemies of the Emperor and uphold the honour of their Chapter, and such vows are sacrosanct. When the Angels of Death strike, they do so with the precision of a surgeon and the force of a thunderbolt. Experience and strategic expertise help them to read the shifting shape of the battle with post-human speed and clarity, directing their wrath towards one priority target after another. Command assets are annihilated, leaving the enemy reeling leaderless. Heavy armour, potent artillery and the vaunted elites of the foe’s forces are laid waste with horrifying speed, until the Emperor’s Angels of Death stand victorious over a field of smouldering wreckage and bolt-riddled corpses, and honour is finally satisfied.",
        "description": "If your Army Faction is ADEPTUS ASTARTES, at the start of your Command phase, select one unit from your opponent’s army. Until the start of your next Command phase, that enemy unit is your Oath of Moment target. Each time a model with this ability makes an attack that targets your Oath of Moment target, you can re-roll the Hit roll.",
        "summary": [
            
        ]
    },
    "super-heavy walker":{
        "lore": "",
        "description": "Each time a model with this ability makes a Normal, Advance or Fall Back move, it can move over models (excluding TITANIC models) and terrain features that are 4'' or less in height as if they were not there."
    },
   
    "cult ambush":{
        "lore": "Genestealer Cults keep their fighting strength carefully hidden from their oppressors until the glorious Day of Ascension arrives. When they finally emerge to fight, it is after long years of meticulous planning, and with an intimate knowledge of the battlefield that grants them a tactical advantage. Even as battle rages, reinforcements slip from the shadows or spill up from the dark places below, called to war by the Broodmind.",
        "description": "If your Army Faction is GENESTEALER CULTS, each time a unit with this ability is destroyed, roll one D6, adding 1 to the result if it is a BATTLELINE unit, and adding 1 to the result if it is the first or second battle round. On a 5+, add a new unit to your army identical to your destroyed unit, in Cult Ambush, at its Starting Strength and with all of its wounds remaining, and you can place one Cult Ambush marker* anywhere on the battlefield that is more than 9'' horizontally away from all enemy units (if this is not possible, no marker is placed)."
    }
}