{
    "symbol": "tau-symbol",
      
    "rules": [
        {
            "name": "for the greater good",
            "lore": "The Hunter Cadres battle for the betterment of the T’au Empire, not for personal gain or egotistic accomplishments. This burning commitment allows for prodigiously effective covering fire. Enemies are pinned in place by deadly bursts of pulse blasts, or the infamous T’au markerlight is used to expose even well-fortified enemy positions, allowing other T’au warriors to fall on the vulnerable enemies with murderous force.",
            "description": "If your Army Faction is T’AU EMPIRE, then in your Shooting phase units from your army can work in pairs to help each other target specific enemy units. When they do this, one unit is the Observer unit and the other is their Guided unit. The enemy they are targeting is called their Spotted unit. <br/><br/>  Each time you select this unit to shoot, if it is not an Observer unit, it can use this ability. If it does, select one other friendly unit with this ability that is also eligible to shoot (excluding FORTIFICATION, Battle-shocked and Observer units). Until the end of the phase, this unit is considered a Guided unit, and that friendly unit is considered an Observer unit. Then select one enemy unit that is visible to both your units to be their Spotted unit. <br/><br/>  Until the end of the phase: <br/> <li>Each time a model in a Guided unit makes an attack that targets their Spotted unit, improve the Ballistic Skill characteristic of the attack by 1 and, if their Observer unit has the MARKERLIGHT keyword, the attack has the [IGNORES COVER] ability. </li>  <li>Each time a model in a Guided unit makes an attack that does not target their Spotted unit, worsen the Ballistic Skill characteristic of the attack by 1. </li>"
        }
    ],
    "detachments": [
        "kauyon",
        "mont'ka",
        "retaliation cadre",
        "kroot hunting pack"
    ],
    "description": "The T’au Empire is a dynamic rising force in the galaxy, as yet unburdened by the bloody failures of a long history. United by their shared vision of the Greater Good, the T’au strive to bring enlightenment to other races, even if they must do so at the barrel of a gun.",
    "units": [
        "Cadre Fireblade",
        "Commander Farsight",
        "Commander In Coldstar Battlesuit",
        "Commander In Crisis Battlesuit",
        "Commander In Enforcer Battlesuit",
        "Commander Shadowsun",
        "Darkstrider",
        "Ethereal",
        "Firesight Team",
        "Kroot Shaper",
        "Kroot Lone-Spear",
        "Kroot Trail Shaper",
        "Kroot War Shaper",
        "Longstrike",
        "Breacher Team",
        "Strike Team",
        "Devilfish",
        "Tidewall Droneport",
        "Tidewall Gunrig",
        "Tidewall Shieldline",
        "Broadside Battlesuits",
        "Crisis Fireknife Battlesuits",
        "Crisis Starscythe Battlesuits",
        "Crisis Sunforge Battlesuits",
        "Ghostkeel Battlesuit",
        "Hammerhead Gunship",
        "Kroot Carnivores",
        "Kroot Farstalkers",
        "Kroot Hounds",
        "Krootox Rampagers",
        "Krootox Riders",
        "Pathfinder Team",
        "Piranhas",
        "Razorshark Strike Fighter",
        "Riptide Battlesuit",
        "Sky Ray Gunship",
        "Stealth Battlesuits",
        "Stormsurge",
        "Sun Shark Bomber",
        "Vespid Stingwings"
        ]
}