{
    "detachmentName": "ascension day",
    "detachmentRule": [
        {
            "name": "they came from below",
            "lore": "For generations an insidious threat has lain hidden within the shadows. Now their time is nigh, and from out of the tunnels and sewers they rise to topple their oppressors in brutally violent insurrection. None can escape the sudden ambushes that herald the Day of Ascension!",
            "description": "Each time a <strong>GENESTEALER CULTS</strong> unit from your army is set up on the battlefield as Reinforcements, until the end of your next Fight phase, weapons equipped by models in that unit have the [SUSTAINED HITS 1] and [IGNORES COVER] abilities."
        }
    ],
    "enhacements": [
        {
            "name": "Prowling Agitant",
            "points": 15,
            "lore": "No matter how often the oppressors seek to trap or silence this leader, they always find themselves left empty-handed and foolish, their elusive quarry long gone.",
            "description": "GENESTEALER CULTS model only. Once per turn, when an enemy unit ends a Normal, Advance or Fall Back move within 9'' of the bearer’s unit, if the bearer’s unit is not within Engagement Range of any enemy units, it can make a Normal move of up to D6''."
        },
        {
            "name": "Inscrutable Cunning",
            "points": 30,
            "lore": "Every variable has been factored into this strategist’s master plan.",
            "description": "GENESTEALER CULTS model only. While the bearer is leading a unit, models in that unit have the Infiltrators ability and each time you select that unit as the target of a Stratagem, roll one D6: on a 4+, you gain 1CP."
        },
        {
            "name": "Meticulous Planner",
            "points": 40,
            "lore": "No other force spends as long laying meticulous preparations for the battles to come as the Genestealer Cults. Their plans to counter the foe are works of dark genius.",
            "description": "GENESTEALER CULTS model only. Once per battle, just after your opponent uses a Stratagem, if the bearer is on the battlefield, it can use this ability. If it does, until the end of the battle, the CP cost your opponent must pay to use that Stratagem again is increased by 1CP."
        },
        {
            "name": "Focus of Adoration",
            "points": 10,
            "lore": "This warlord inspires such insane devotion that their minions will leap headlong into battle in order to win their favour.",
            "description": "GENESTEALER CULTS model only. While the bearer is leading a unit, you can target that unit with the Heroic Intervention Stratagem for 0CP, and can do so even if you have already targeted a different unit with that Stratagem this phase."
        }
    ],
    "stratagems": [
        {
            "name": "unquestioning loyalty",
            "subindex": "epic deed stratagem",
            "lore": "Broodkin are so fanatically loyal that they do not hesitate to sacrifice themselves to protect their leaders.",
            "when": "Your opponent’s Shooting phase or the Fight phase, just after an enemy unit has selected its targets.",
            "target": "One GENESTEALER CULTS CHARACTER unit from your army that was selected as the target of one or more of that enemy unit’s attacks.",
            "effect": "Until the end of the phase, each time a CHARACTER model in your unit would lose a wound, select one friendly GENESTEALER CULTS unit within 3'' of it (excluding VEHICLE units). Your CHARACTER model does not lose that wound and that selected unit suffers one mortal wound instead.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "green"
        },
        {
            "name": "coordinated trap",
            "subindex": "epic deed stratagem",
            "lore": "Broodkin are so fanatically loyal that they do not hesitate to sacrifice themselves to protect their leaders.",
            "when": "Your opponent’s Shooting phase or the Fight phase, just after an enemy unit has selected its targets.",
            "target": " One GENESTEALER CULTS CHARACTER unit from your army that was selected as the target of one or more of that enemy unit’s attacks.",
            "effect": "Until the end of the phase, each time a CHARACTER model in your unit would lose a wound, select one friendly GENESTEALER CULTS unit within 3'' of it (excluding VEHICLE units). Your CHARACTER model does not lose that wound and that selected unit suffers one mortal wound instead.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "green"
        },
        {
            "name": "tunnel crawlers",
            "subindex": "strategic ploy stratagem",
            "lore": "Squirming, crawling and scrabbling through confined spaces is second nature to many broodkin, and is a skill they use to assail seemingly impregnable enemy positions.",
            "when": " Your Movement phase.",
            "target": "One GENESTEALER CULTS unit from your army that is arriving using the Deep Strike ability this phase.",
            "effect": "Your unit can be set up anywhere on the battlefield that is more than 3'' horizontally away from all enemy models.",
            "restrictions":"A unit targeted by this Stratagem is not eligible to declare a charge in the same turn.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "blue"
        },
        {
            "name": "a perfect ambush",
            "subindex": "battle tactic stratagem",
            "lore": "These Cultists have tracked their enemies tirelessly, as predatory beasts stalk their prey. Only when their position is perfect do they strike, engulfing their victims in a hail of unexpected firepower.",
            "when": "Your Shooting phase.",
            "target": "One GENESTEALER CULTS unit from your army that arrived from Reserves this turn and has not been selected to shoot this phase.",
            "effect": "Until the end of the phase, improve the Ballistic Skill and Armour Penetration characteristics of ranged weapons equipped by models in your unit by 1.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "blue"
        },
        {
            "name": "one with the darkness",
            "subindex": "strategic ploy stratagem",
            "lore": "In dark nooks and crevices the true believers of the cult whisper and skulk, all but invisible to those who approach.",
            "when": "Your opponent’s Shooting phase, just after an enemy unit has selected its targets.",
            "target": "One GENESTEALER CULTS INFANTRY unit from your army that was selected as the target of one or more of that enemy unit’s attacks.",
            "effect": "Until the end of the phase, your unit has the Stealth ability and can only be selected as the target of a ranged attack if the attacking model is within 12''",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "red"
        },
        {
            "name": "return to the shadows",
            "subindex": "battle tactic stratagem",
            "lore": "Ever cunning and duplicitous, broods of the faithful often vanish back into tunnels and vents after their initial strike, ready to regroup and attack again elsewhere.",
            "when": "End of your opponent’s turn.",
            "target": "Up to two GENESTEALER CULTS BATTLELINE units from your army, or one other GENESTEALER CULTS INFANTRY unit from your army.",
            "effect": "Remove the targeted units from the battlefield and place them into Strategic Reserves.",
            "restrictions":"The targeted units must have the Deep Strike ability and cannot be within Engagement Range of any enemy units when targeted.",
            "icon": [
                ""
            ],
            "cp": 1,
            "color": "red"
        }
    ]
}