{
    "detachmentName": "ascension day",
    "detachmentRule": [
        {
            "name": "they came from below",
            "lore": "For generations an insidious threat has lain hidden within the shadows. Now their time is nigh, and from out of the tunnels and sewers they rise to topple their oppressors in brutally violent insurrection. None can escape the sudden ambushes that herald the Day of Ascension!",
            "description": "Each time a <strong>GENESTEALER CULTS</strong> unit from your army is set up on the battlefield as Reinforcements, until the end of your next Fight phase, weapons equipped by models in that unit have the [SUSTAINED HITS 1] and [IGNORES COVER] abilities."
        }
    ],
    "enhacements": [
        {
            "name": "Prowling Agitant",
            "points": 15,
            "lore": "No matter how often the oppressors seek to trap or silence this leader, they always find themselves left empty-handed and foolish, their elusive quarry long gone.",
            "description": "GENESTEALER CULTS model only. Once per turn, when an enemy unit ends a Normal, Advance or Fall Back move within 9'' of the bearer’s unit, if the bearer’s unit is not within Engagement Range of any enemy units, it can make a Normal move of up to D6''."
        },
        {
            "name": "Inscrutable Cunning",
            "points": 30,
            "lore": "Every variable has been factored into this strategist’s master plan.",
            "description": "GENESTEALER CULTS model only. While the bearer is leading a unit, models in that unit have the Infiltrators ability and each time you select that unit as the target of a Stratagem, roll one D6: on a 4+, you gain 1CP."
        },
        {
            "name": "Meticulous Planner",
            "points": 40,
            "lore": "No other force spends as long laying meticulous preparations for the battles to come as the Genestealer Cults. Their plans to counter the foe are works of dark genius.",
            "description": "GENESTEALER CULTS model only. Once per battle, just after your opponent uses a Stratagem, if the bearer is on the battlefield, it can use this ability. If it does, until the end of the battle, the CP cost your opponent must pay to use that Stratagem again is increased by 1CP."
        },
        {
            "name": "Focus of Adoration",
            "points": 10,
            "lore": "This warlord inspires such insane devotion that their minions will leap headlong into battle in order to win their favour.",
            "description": "GENESTEALER CULTS model only. While the bearer is leading a unit, you can target that unit with the Heroic Intervention Stratagem for 0CP, and can do so even if you have already targeted a different unit with that Stratagem this phase."
        }
    ],
    "stratagems": [
        {
            "name": "along shadowed trails",
            "subindex": "strategic ploy stratagem",
            "lore": "With raw speed and subtle misdirection, Atalan Jackals outflank those who believe them trapped.",
            "when": "Any phase, just after an enemy unit ends a move within 9\" of one or more of your Cult Ambush markers.",
            "target": "One ATALAN JACKALS unit from your army in Cult Ambush.",
            "effect": "Select one of those Cult Ambush markers. You can set up that Cult Ambush marker anywhere on the battlefield that is more than 9” horizontally away from all enemy units and wholly within 6\" of one or more battlefield edges. Until the end of the battle, you can only select ATALAN JACKALS units from your army to set up using that Cult Ambush marker.",
            "icon": [""],
            "cp": 1,
            "color": "blue"
        },
        {
            "name": "devoted crew",
            "subindex": "battle tactic stratagem",
            "lore": "With evasive manoeuvres and split-second repairs, Outlander Claws marshal their rugged vehicles through the worst the foe can throw at them.",
            "when": "Your opponent’s Shooting phase or the Fight phase, just after an enemy unit has selected its targets.",
            "target": "One GOLIATH ROCKGRINDER or GOLIATH TRUCK unit from your army that was selected as the target of one or more of the attacking unit’s attacks.",
            "effect": "Until the end of the phase, each time an attack targets your unit, subtract 1 from the Damage characteristic of that attack.",
            "icon": [""],
            "cp": 1,
            "color": "green"
        },
        {
            "name": "close-range shoot-out",
            "subindex": "battle tactic stratagem",
            "lore": "A cult’s experienced outriders are experts in hit-and-run attacks and close-range firefights. These skills are deadly when combined.",
            "when": "Your Shooting phase.",
            "target": "One GENESTEALER CULTS MOUNTED or GENESTEALER CULTS VEHICLE unit from your army that has not been selected to shoot this phase.",
            "effect": "Until the end of the phase, ranged weapons equipped by models in your unit have the [LETHAL HITS] ability while targeting an enemy unit within 18\".",
            "icon": [""],
            "cp": 1,
            "color": "green"
        },
        {
            "name": "rapid feint",
            "subindex": "strategic ploy stratagem",
            "lore": "An Outlander Claw’s skilled riders and crews can use their enhanced hybrid reactions to rapidly alter speed and course, roaring after fleeing prey or luring enemy out of position and leaving them flat-footed.",
            "when": "Your opponent’s Movement phase, just after an enemy unit ends a Normal, Advance or Fall Back move.",
            "target": "One ACHILLES RIDGERUNNERS or ATALAN JACKALS unit from your army that is within 9\" of that enemy unit.",
            "effect": "Your unit can make a Normal move of up to 6\".",
            "icon": [""],
            "cp": 1,
            "color": "blue"
        },
        {
            "name": "deft manoeuvring",
            "subindex": "battle tactic stratagem",
            "lore": "Serpent-fast, jinking and swerving with incredible skill, the cult’s light vehicles appear to slide through the oppressors' gunfire.",
            "when": "Your opponent's Shooting phase, just after an enemy unit has selected its targets.",
            "target": "One ACHILLES RIDGERUNNERS or ATALAN JACKALS unit from your army that was selected as the target of one or more of the attacking unit’s attacks.",
            "effect": "Until the end of the phase, models in your unit have a 4+ invulnerable save.",
            "icon": [""],
            "cp": 1,
            "color": "green"
        },
        {
            "name": "encircling the prey",
            "subindex": "strategic ploy stratagem",
            "lore": "Skirting the edge of battle, an Outlander Claw's raiders watch keenly for vulnerabilities, ready to throw themselves back into the fight to exploit any weaknesses in the enemy.",
            "when": "End of your opponent's Fight phase.",
            "target": "One GENESTEALER CULTS MOUNTED or GENESTEALER CULTS VEHICLE unit from your army that is not within Engagement Range of one or more enemy units and is wholly within 9\" of one or more battlefield edges.",
            "effect": "Remove your unit from the battlefield and place it into Strategic Reserves.",
            "icon": [""],
            "cp": 1,
            "color": "blue"
        }
    ]
}